sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h

#ifndef _IOD3081_INCLUDED
#define _IOD3081_INCLUDED

// -------------------------------------------------------------------------------------
//
// Copyright (C) 2023-2025 Renesas Electronics Corporation and/or its affiliates.
// All rights reserved. Confidential Information.
//
// This software ("Software") is supplied by Renesas Electronics Corporation and/or its
// affiliates ("Renesas"). Renesas grants you a personal, non-exclusive, non-transferable,
// revocable, non-sub-licensable right and license to use the Software, solely if used in
// or together with Renesas products. You may make copies of this Software, provided this
// copyright notice and disclaimer ("Notice") is included in all such copies. Renesas
// reserves the right to change or discontinue the Software at any time without notice.
//
// THE SOFTWARE IS PROVIDED "AS IS". RENESAS DISCLAIMS ALL WARRANTIES OF ANY KIND,
// WHETHER EXPRESS, IMPLIED, OR STATUTORY, INCLUDING BUT NOT LIMITED TO THE WARRANTIES
// OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. TO THE
// MAXIMUM EXTENT PERMITTED UNDER LAW, IN NO EVENT SHALL RENESAS BE LIABLE FOR ANY DIRECT,
// INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING FROM, OUT OF OR IN
// CONNECTION WITH THE SOFTWARE, EVEN IF RENESAS HAS BEEN ADVISED OF THE POSSIBILITY OF
// SUCH DAMAGES. USE OF THIS SOFTWARE MAY BE SUBJECT TO TERMS AND CONDITIONS CONTAINED IN
// AN ADDITIONAL AGREEMENT BETWEEN YOU AND RENESAS. IN CASE OF CONFLICT BETWEEN THE TERMS
// OF THIS NOTICE AND ANY SUCH ADDITIONAL LICENSE AGREEMENT, THE TERMS OF THE AGREEMENT
// SHALL TAKE PRECEDENCE. BY CONTINUING TO USE THIS SOFTWARE, YOU AGREE TO THE TERMS OF
// THIS NOTICE.IF YOU DO NOT AGREE TO THESE TERMS, YOU ARE NOT PERMITTED TO USE THIS
// SOFTWARE.
//
// -------------------------------------------------------------------------------------
// C Source
// -------------------------------------------------------------------------------------
//
// Project         : $Aliases$
// Date            : $Date$
// Revision        : $Revision$
// Original Author : <initial major contributor(s) to this code, not usually changed>
// Last Changed By : $Author$
// Source          : $Source$
//
// -------------------------------------------------------------------------------------
//
// Description: "D3081.h" (Datasheet #7084)
//              C header file of the device registers and bit fields
//              Generated by DoxBox on Jun 27, 2023 12:38:31
//
// -------------------------------------------------------------------------------------
//
// Synchronicity history:
//
// $Log$
//
// -------------------------------------------------------------------------------------
#include <stdint.h>


/*===========================================================================*/ 
/*========================== Start of header part ===========================*/ 
/*===========================================================================*/ 
/*
* ===============================================================================================
* ---------- Interrupt ReQuest number definitions (see also CMSDK_CM0plus.h) --------------------
* ===============================================================================================
*/

/*
* -----------------------------------------------------------------------------------------------
* The Cortex-M0+ Processor Exceptions Numbers and Device Specific Interrupt Request Numbers.    -
* -----------------------------------------------------------------------------------------------
*/
typedef enum IRQn
{
/****** Cortex-M0+ Processor Exceptions Numbers ************************************************/
NonMaskableInt_IRQn  = -14, /*  2 Non Maskable Interrupt Request.                              */
HardFault_IRQn       = -13, /*  3 Cortex-M0 Hard Fault Interrupt Request.                      */
SVCall_IRQn          = -5,  /* 11 Cortex-M0 SV Call Interrupt Request.                         */
PendSV_IRQn          = -2,  /* 14 Cortex-M0 Pend SV Interrupt Request.                         */
SysTick_IRQn         = -1,  /* 15 Cortex-M0 System Tick Interrupt Request.                     */

/****** D2632 Specific Interrupt Numbers *******************************************************/
BLE_WAKEUP_LP_IRQn   =  0,  /* Wakeup from Low Power Interrupt Request from BLE.               */
BLE_GEN_IRQn         =  1,  /* BLE Interrupt Request. Sources:                                 */
                            /*   - finetgtim_irq  : Fine Target Timer interrupt generated when */
                            /*                      Fine Target timer expired. Timer           */
                            /*                      resolution is 625us base time reference.   */
                            /*   - grosstgtim_irq : Gross Target Timer interrupt generated     */
                            /*                      when Gross Target timer expired. Timer     */
                            /*                      resolution is 16 times 625us base time     */
                            /*                      reference.                                 */
                            /*   - cscnt_irq      : 625us base time reference interrupt,       */
                            /*                      available in active modes.                 */
                            /*   - slp_irq        : End of Sleep mode interrupt.               */
                            /*   - error_irq      : Error interrupt, generated when undesired  */
                            /*                      behavior or bad programming occurs in the  */
                            /*                      BLE Core.                                  */
                            /*   - rx_irq         : Receipt interrupt at the end of each       */
                            /*                      received packets.                          */
                            /*   - event_irq      : End of Advertising / Scanning / Connection */
                            /*                      events interrupt.                          */
                            /*   - crypt_irq      : Encryption / Decryption interrupt,         */
                            /*                      generated either when AES and/or CCM       */
                            /*                      processing is finished.                    */
                            /*   - sw_irq         : SW triggered interrupt, generated on SW    */
                            /*                      request.                                   */
UART_IRQn            =  2,  /* UART Interrupt Request.                                         */
UART2_IRQn           =  3,  /* UART2 Interrupt Request.                                        */
I2C_IRQn             =  4,  /* I2C Interrupt Request.                                          */
SPI_IRQn             =  5,  /* SPI Interrupt Request.                                          */
ADC_IRQn             =  6,  /* Analog-Digital Converter Interrupt Request.                     */
KEYBRD_IRQn          =  7,  /* Keyboard Interrupt Request.                                     */
BLE_RF_DIAG_IRQn     =  8,  /* Baseband or Radio Diagnostics Interrupt Request. Required for   */
                            /* signaling Radio or Baseband internal events.                    */
                            /* 2 signals per Radio and 2 per BB                                */
RF_CAL_IRQn          =  9,  /* Radio Calibration Interrupt Request.                            */
GPIO0_IRQn           = 10,  /* GPIO Interrupt Request through debounce.                        */
GPIO1_IRQn           = 11,  /* GPIO Interrupt Request through debounce.                        */
GPIO2_IRQn           = 12,  /* GPIO Interrupt Request through debounce.                        */
GPIO3_IRQn           = 13,  /* GPIO Interrupt Request through debounce.                        */
GPIO4_IRQn           = 14,  /* GPIO Interrupt Request through debounce.                        */
SWTIM_IRQn           = 15,  /* Software Timer (Timer0) Interrupt Request.                      */
WKUP_QUADEC_IRQn     = 16,  /* Combines the Wake up Capture Timer Interrupt Request,           */
                            /* the GPIO Interrupt and the QuadDecoder Interrupt Request.       */
SWTIM1_IRQn          = 17,  /* Software Timer (Timer1) Interrupt Request.                      */
RTC_IRQn             = 18,  /* RTC Alarm Interrupt Request.                                    */
DMA_IRQn             = 19,  /* DMA Interrupt Request.                                          */
XTAL32M_RDY_IRQn     = 20,  /* XTAL 32M settling Interrupt Request.                            */
RESERVED21_IRQn      = 21,  /* SoftWare Interrupt Request.                                     */
RESERVED22_IRQn      = 22,  /* SoftWare Interrupt Request.                                     */
RESERVED23_IRQn      = 23,  /* SoftWare Interrupt Request.                                     */
} IRQn_Type;


/*---------------------------------------------------------------------------------------------*/
/* Configuration of the Cortex-M0+ Processor and Core Peripherals (see also CMSDK_CM0plus.h).  */
/*---------------------------------------------------------------------------------------------*/
/* Note: The next 4 defines are used in the global included "core_cm0plus.h".                  */
#define __NVIC_PRIO_BITS       (2) /* Number of Bits used for Priority Levels.                 */
#define __Vendor_SysTickConfig (0) /* Set to 1 if different SysTick Config is used.            */
#define __MPU_PRESENT           0  /* MPU present or not.                                      */
/* Allow a different '__VTOR_PRESENT' value for e.g. the CM0+ config check test.               */
#ifndef __VTOR_PRESENT
  #define __VTOR_PRESENT        0  /* Cortex-M0+ can support the VTOR.                         */
#endif

/*--GPIO PID functions-------------------------------------------------------------------------*/
#define FUNC_GPIO          ( 0)
#define FUNC_UART_RX       ( 1)
#define FUNC_UART_TX       ( 2)
#define FUNC_UART2_RX      ( 3)
#define FUNC_UART2_TX      ( 4)
#define FUNC_SYS_CLK       ( 5)
#define FUNC_LP_CLK        ( 6)
#define FUNC_SPI_DATA_READY (7)
#define FUNC_I2C_SCL       ( 9)
#define FUNC_I2C_SDA       (10)
#define FUNC_PWM5          (11)
#define FUNC_PWM6          (12)
#define FUNC_PWM7          (13)
#define FUNC_ADC           (15)
#define FUNC_PWM0          (16)
#define FUNC_PWM1          (17)
#define FUNC_BLE_DIAG      (18)
#define FUNC_UART_CTSN     (19)
#define FUNC_UART_RTSN     (20)
#define FUNC_PWM2          (23)
#define FUNC_PWM3          (24)
#define FUNC_PWM4          (25)
#define FUNC_SPI_DI        (26)
#define FUNC_SPI_DO        (27)
#define FUNC_SPI_CLK       (28)
#define FUNC_SPI_CSN0      (29)
#define FUNC_SPI_CSN1      (30)
/*--GPIO Direction settings--------------------------------------------------------------------*/
#define DIR_INPUT          0x000
#define DIR_PULLUP         0x100
#define DIR_PULLDOWN       0x200
#define DIR_OUTPUT         0x300


/*===========================================================================*/ 
/*=========================== End of header part ============================*/ 
/*===========================================================================*/ 



/*===========================================================================*/ 
/*==================== Start of automatic generated code ====================*/ 
/*===========================================================================*/ 



/*===========================================================================*/
/* memory map ADPLLDIG */
/*===========================================================================*/
//reserved only



/*===========================================================================*/
/* memory map ANAMISC */
/*===========================================================================*/



#define CLK_REF_SEL_REG                      (0x50001600) /* Select clock for oscillator calibration */
#define CLK_REF_SEL_REG_RESET                (0x00000000)

/*=============================*/
struct __CLK_REF_SEL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_REF_CLK_SEL                       : 2;
    volatile uint16_t BITFLD_REF_CAL_START                     : 1;
    volatile uint16_t BITFLD_EXT_CNT_EN_SEL                    : 1;
};
