sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define DIAG0                                 (0x003F)
#define DIAG0_EN                              (0x0080)
#define DIAG1                                 (0x3F00)
#define DIAG1_EN                              (0x8000)
#define DIAG2                                 (0x3F0000)
#define DIAG2_EN                              (0x800000)
#define DIAG3                                 (0x3F000000)
#define DIAG3_EN                              (0x80000000)



#define BLE_DIAGSTAT_REG                     (0x40000054) /* Debug use only */
#define BLE_DIAGSTAT_REG_RESET               (0x00000000)

/*=============================*/
struct __BLE_DIAGSTAT_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DIAG0STAT                         : 8;
    volatile uint32_t BITFLD_DIAG1STAT                         : 8;
    volatile uint32_t BITFLD_DIAG2STAT                         : 8;
    volatile uint32_t BITFLD_DIAG3STAT                         : 8;
};
#define DIAG0STAT                             (0x00FF)
#define DIAG1STAT                             (0xFF00)
#define DIAG2STAT                             (0xFF0000)
#define DIAG3STAT                             (0xFF000000)



#define BLE_DEBUGADDMAX_REG                  (0x40000058) /* Upper limit for the memory zone */
#define BLE_DEBUGADDMAX_REG_RESET            (0x00000000)

/*=============================*/
struct __BLE_DEBUGADDMAX_REG
/*=============================*/
{
    volatile uint32_t BITFLD_EM_ADDMAX                         : 16;
    volatile uint32_t BITFLD_REG_ADDMAX                        : 16;
};
#define EM_ADDMAX                             (0xFFFF)
#define REG_ADDMAX                            (0xFFFF0000)



#define BLE_DEBUGADDMIN_REG                  (0x4000005C) /* Lower limit for the memory zone */
#define BLE_DEBUGADDMIN_REG_RESET            (0x00000000)

/*=============================*/
struct __BLE_DEBUGADDMIN_REG
/*=============================*/
{
    volatile uint32_t BITFLD_EM_ADDMIN                         : 16;
    volatile uint32_t BITFLD_REG_ADDMIN                        : 16;
};
#define EM_ADDMIN                             (0xFFFF)
#define REG_ADDMIN                            (0xFFFF0000)



#define BLE_ERRORTYPESTAT_REG                (0x40000060) /* Error Type Status registers */
#define BLE_ERRORTYPESTAT_REG_RESET          (0x00000000)

/*=============================*/
struct __BLE_ERRORTYPESTAT_REG
/*=============================*/
{
    volatile uint32_t BITFLD_TXCRYPT_ERROR                     : 1;
    volatile uint32_t BITFLD_RXCRYPT_ERROR                     : 1;
    volatile uint32_t BITFLD_PKTCNTL_EMACC_ERROR               : 1;
    volatile uint32_t BITFLD_RADIO_EMACC_ERROR                 : 1;
    volatile uint32_t BITFLD_EVT_SCHDL_EMACC_ERROR             : 1;
    volatile uint32_t BITFLD_EVT_SCHDL_ENTRY_ERROR             : 1;
    volatile uint32_t BITFLD_EVT_SCHDL_APFM_ERROR              : 1;
    volatile uint32_t BITFLD_EVT_CNTL_APFM_ERROR               : 1;
    volatile uint32_t BITFLD_WHITELIST_ERROR                   : 1;
    volatile uint32_t BITFLD_IFS_UNDERRUN                      : 1;
    volatile uint32_t BITFLD_ADV_UNDERRUN                      : 1;
    volatile uint32_t BITFLD_LLCHMAP_ERROR                     : 1;
    volatile uint32_t BITFLD_CSFORMAT_ERROR                    : 1;
    volatile uint32_t BITFLD_TXDESC_EMPTY_ERROR                : 1;
    volatile uint32_t BITFLD_RXDESC_EMPTY_ERROR                : 1;
    volatile uint32_t BITFLD_TXDATA_PTR_ERROR                  : 1;
    volatile uint32_t BITFLD_RXDATA_PTR_ERROR                  : 1;
    volatile uint32_t BITFLD_CONCEVTIRQ_ERROR                  : 1;
};
#define TXCRYPT_ERROR                         (0x0001)
#define RXCRYPT_ERROR                         (0x0002)
#define PKTCNTL_EMACC_ERROR                   (0x0004)
#define RADIO_EMACC_ERROR                     (0x0008)
#define EVT_SCHDL_EMACC_ERROR                 (0x0010)
#define EVT_SCHDL_ENTRY_ERROR                 (0x0020)
#define EVT_SCHDL_APFM_ERROR                  (0x0040)
#define EVT_CNTL_APFM_ERROR                   (0x0080)
#define WHITELIST_ERROR                       (0x0100)
#define IFS_UNDERRUN                          (0x0200)
#define ADV_UNDERRUN                          (0x0400)
#define LLCHMAP_ERROR                         (0x0800)
#define CSFORMAT_ERROR                        (0x1000)
#define TXDESC_EMPTY_ERROR                    (0x2000)
#define RXDESC_EMPTY_ERROR                    (0x4000)
#define TXDATA_PTR_ERROR                      (0x8000)
#define RXDATA_PTR_ERROR                      (0x10000)
#define CONCEVTIRQ_ERROR                      (0x20000)



#define BLE_SWPROFILING_REG                  (0x40000064) /* Software Profiling register */
#define BLE_SWPROFILING_REG_RESET            (0x00000000)

/*=============================*/
struct __BLE_SWPROFILING_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SWPROFVAL                         : 32;
};
#define SWPROFVAL                             (0xFFFFFFFF)



#define BLE_RADIOCNTL1_REG                   (0x40000074) /* Radio interface control register */
#define BLE_RADIOCNTL1_REG_RESET             (0x00000000)

/*=============================*/
struct __BLE_RADIOCNTL1_REG
/*=============================*/
{
             uint32_t                                          : 16;
    volatile uint32_t BITFLD_XRFSEL                            : 5;
};
#define XRFSEL                                (0x1F0000)



#define BLE_RADIOPWRUPDN_REG                 (0x40000080) /* RX/TX power up/down phase register */
#define BLE_RADIOPWRUPDN_REG_RESET           (0x00D203D2)

/*=============================*/
struct __BLE_RADIOPWRUPDN_REG
/*=============================*/
{
    volatile uint32_t BITFLD_TXPWRUP                           : 8;
    volatile uint32_t BITFLD_TXPWRDN                           : 4;
             uint32_t                                          : 4;
    volatile uint32_t BITFLD_RXPWRUP                           : 8;
    volatile uint32_t BITFLD_RTRIP_DELAY                       : 7;
};
