sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define RXMICVAL                              (0xFFFFFFFF)



#define BLE_RFTESTCNTL_REG                   (0x400000E0) /* RF Testing Register */
#define BLE_RFTESTCNTL_REG_RESET             (0x00000000)

/*=============================*/
struct __BLE_RFTESTCNTL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_TXLENGTH                          : 9;
             uint32_t                                          : 2;
    volatile uint32_t BITFLD_TXPKTCNTEN                        : 1;
    volatile uint32_t BITFLD_TXPLDSRC                          : 1;
    volatile uint32_t BITFLD_PRBSTYPE                          : 1;
    volatile uint32_t BITFLD_TXLENGTHSRC                       : 1;
    volatile uint32_t BITFLD_INFINITETX                        : 1;
             uint32_t                                          : 11;
    volatile uint32_t BITFLD_RXPKTCNTEN                        : 1;
             uint32_t                                          : 3;
    volatile uint32_t BITFLD_INFINITERX                        : 1;
};
#define TXLENGTH                              (0x01FF)
#define TXPKTCNTEN                            (0x0800)
#define TXPLDSRC                              (0x1000)
#define PRBSTYPE                              (0x2000)
#define TXLENGTHSRC                           (0x4000)
#define INFINITETX                            (0x8000)
#define RXPKTCNTEN                            (0x8000000)
#define INFINITERX                            (0x80000000)



#define BLE_RFTESTTXSTAT_REG                 (0x400000E4) /* RF Testing Register */
#define BLE_RFTESTTXSTAT_REG_RESET           (0x00000000)

/*=============================*/
struct __BLE_RFTESTTXSTAT_REG
/*=============================*/
{
    volatile uint32_t BITFLD_TXPKTCNT                          : 32;
};
#define TXPKTCNT                              (0xFFFFFFFF)



#define BLE_RFTESTRXSTAT_REG                 (0x400000E8) /* RF Testing Register */
#define BLE_RFTESTRXSTAT_REG_RESET           (0x00000000)

/*=============================*/
struct __BLE_RFTESTRXSTAT_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RXPKTCNT                          : 32;
};
#define RXPKTCNT                              (0xFFFFFFFF)



#define BLE_TIMGENCNTL_REG                   (0x400000F0) /* Timing Generator Register */
#define BLE_TIMGENCNTL_REG_RESET             (0x81FE0096)

/*=============================*/
struct __BLE_TIMGENCNTL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_PREFETCH_TIME                     : 9;
             uint32_t                                          : 7;
    volatile uint32_t BITFLD_PREFETCHABORT_TIME                : 10;
             uint32_t                                          : 5;
    volatile uint32_t BITFLD_APFM_EN                           : 1;
};
#define PREFETCH_TIME                         (0x01FF)
#define PREFETCHABORT_TIME                    (0x3FF0000)
#define APFM_EN                               (0x80000000)



#define BLE_GROSSTIMTGT_REG                  (0x400000F4) /* Gross Timer Target value */
#define BLE_GROSSTIMTGT_REG_RESET            (0x00000000)

/*=============================*/
struct __BLE_GROSSTIMTGT_REG
/*=============================*/
{
    volatile uint32_t BITFLD_GROSSTARGET                       : 23;
};
#define GROSSTARGET                           (0x7FFFFF)



#define BLE_FINETIMTGT_REG                   (0x400000F8) /* Fine Timer Target value */
#define BLE_FINETIMTGT_REG_RESET             (0x00000000)

/*=============================*/
struct __BLE_FINETIMTGT_REG
/*=============================*/
{
    volatile uint32_t BITFLD_FINETARGET                        : 27;
};
#define FINETARGET                            (0x7FFFFFF)



#define BLE_SAMPLECLK_REG                    (0x400000FC) /* Samples the Base Time Counter */
#define BLE_SAMPLECLK_REG_RESET              (0x00000000)

/*=============================*/
struct __BLE_SAMPLECLK_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SAMP                              : 1;
};
#define SAMP                                  (0x0001)



#define BLE_COEXIFCNTL0_REG                  (0x40000100) /* Coexistence interface Control 0 Register */
#define BLE_COEXIFCNTL0_REG_RESET            (0x00000010)

/*=============================*/
struct __BLE_COEXIFCNTL0_REG
/*=============================*/
{
    volatile uint32_t BITFLD_COEX_EN                           : 1;
    volatile uint32_t BITFLD_SYNCGEN_EN                        : 1;
             uint32_t                                          : 2;
    volatile uint32_t BITFLD_WLANRXMSK                         : 2;
    volatile uint32_t BITFLD_WLANTXMSK                         : 2;
             uint32_t                                          : 8;
    volatile uint32_t BITFLD_WLCTXPRIOMODE                     : 2;
             uint32_t                                          : 2;
    volatile uint32_t BITFLD_WLCRXPRIOMODE                     : 2;
};
#define COEX_EN                               (0x0001)
#define SYNCGEN_EN                            (0x0002)
#define WLANRXMSK                             (0x0030)
#define WLANTXMSK                             (0x00C0)
#define WLCTXPRIOMODE                         (0x30000)
#define WLCRXPRIOMODE                         (0x300000)



#define BLE_COEXIFCNTL1_REG                  (0x40000104) /* Coexistence interface Control 1 Register */
#define BLE_COEXIFCNTL1_REG_RESET            (0x00000000)

/*=============================*/
struct __BLE_COEXIFCNTL1_REG
/*=============================*/
{
    volatile uint32_t BITFLD_WLCPDELAY                         : 7;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_WLCPDURATION                      : 7;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_WLCPTXTHR                         : 5;
             uint32_t                                          : 3;
    volatile uint32_t BITFLD_WLCPRXTHR                         : 5;
};
