sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define RAM_PWR_CTRL_REG                     (0x50000018) /* Control power state of System RAMS */
#define RAM_PWR_CTRL_REG_RESET               (0x00000000)

/*=============================*/
struct __RAM_PWR_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RAM1_PWR_CTRL                     : 2;
    volatile uint16_t BITFLD_RAM2_PWR_CTRL                     : 2;
};
#define RAM1_PWR_CTRL                         (0x0003)
#define RAM2_PWR_CTRL                         (0x000C)



#define CLK_RC32K_REG                        (0x50000020) /* 32 kHz RC oscillator register */
#define CLK_RC32K_REG_RESET                  (0x0000000E)

/*=============================*/
struct __CLK_RC32K_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RC32K_DISABLE                     : 1;
    volatile uint16_t BITFLD_RC32K_TRIM                        : 4;
};
#define RC32K_DISABLE                         (0x0001)
#define RC32K_TRIM                            (0x001E)



#define CLK_RC32M_REG                        (0x50000024) /* Fast RC control register */
#define CLK_RC32M_REG_RESET                  (0x00000790)

/*=============================*/
struct __CLK_RC32M_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RC32M_DISABLE                     : 1;
    volatile uint16_t BITFLD_RC32M_BIAS                        : 4;
    volatile uint16_t BITFLD_RC32M_RANGE                       : 2;
    volatile uint16_t BITFLD_RC32M_COSC                        : 4;
};
#define RC32M_DISABLE                         (0x0001)
#define RC32M_BIAS                            (0x001E)
#define RC32M_RANGE                           (0x0060)
#define RC32M_COSC                            (0x0780)



#define CLK_RCX_REG                          (0x50000026) /* RCX-oscillator control register */
#define CLK_RCX_REG_RESET                    (0x00000AFC)

/*=============================*/
struct __CLK_RCX_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RCX_ENABLE                        : 1;
    volatile uint16_t BITFLD_RCX_RADJUST                       : 1;
    volatile uint16_t BITFLD_RCX_CADJUST                       : 5;
    volatile uint16_t BITFLD_RCX_C0                            : 1;
    volatile uint16_t BITFLD_RCX_BIAS                          : 4;
};
#define RCX_ENABLE                            (0x0001)
#define RCX_RADJUST                           (0x0002)
#define RCX_CADJUST                           (0x007C)
#define RCX_C0                                (0x0080)
#define RCX_BIAS                              (0x0F00)



#define BANDGAP_REG                          (0x50000028) /* Bandgap trimming */
#define BANDGAP_REG_RESET                    (0x00000000)

/*=============================*/
struct __BANDGAP_REG
/*=============================*/
{
    volatile uint16_t BITFLD_BGR_TRIM                          : 5;
    volatile uint16_t BITFLD_BGR_ITRIM                         : 5;
};
#define BGR_TRIM                              (0x001F)
#define BGR_ITRIM                             (0x03E0)



#define XTAL32M_START_REG                    (0x50000030) /* Trim values for XTAL32M */
#define XTAL32M_START_REG_RESET              (0x00000032)

/*=============================*/
struct __XTAL32M_START_REG
/*=============================*/
{
    volatile uint16_t BITFLD_XTAL32M_START                     : 8;
    volatile uint16_t BITFLD_XTAL32M_RAMP                      : 8;
};
#define XTAL32M_START                         (0x00FF)
#define XTAL32M_RAMP                          (0xFF00)



#define XTAL32M_TRSTAT_REG                   (0x50000032) /* Read back value of current XTAL trimming */
#define XTAL32M_TRSTAT_REG_RESET             (0x00000000)

/*=============================*/
struct __XTAL32M_TRSTAT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_XTAL32M_TRSTAT                    : 8;
};
#define XTAL32M_TRSTAT                        (0x00FF)



#define XTALRDY_CTRL_REG                     (0x50000034) /* Control register for XTALRDY IRQ */
#define XTALRDY_CTRL_REG_RESET               (0x00000000)

/*=============================*/
struct __XTALRDY_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_XTALRDY_CNT                       : 8;
};
#define XTALRDY_CNT                           (0x00FF)



#define POR_PIN_REG                          (0x50000040) /* Selects a GPIO pin for POR generation */
#define POR_PIN_REG_RESET                    (0x00000000)

/*=============================*/
struct __POR_PIN_REG
/*=============================*/
{
    volatile uint16_t BITFLD_POR_PIN_SELECT                    : 4;
             uint16_t                                          : 3;
    volatile uint16_t BITFLD_POR_PIN_POLARITY                  : 1;
};
#define POR_PIN_SELECT                        (0x000F)
#define POR_PIN_POLARITY                      (0x0080)



#define POR_TIMER_REG                        (0x50000042) /* Time for POR to happen */
#define POR_TIMER_REG_RESET                  (0x00000018)

/*=============================*/
struct __POR_TIMER_REG
/*=============================*/
{
    volatile uint16_t BITFLD_POR_TIME                          : 7;
};
#define POR_TIME                              (0x007F)



#define PMU_SLEEP_REG                        (0x50000050) /* Bandgap refresh interval during sleep */
#define PMU_SLEEP_REG_RESET                  (0x00000080)

/*=============================*/
struct __PMU_SLEEP_REG
/*=============================*/
{
    volatile uint16_t BITFLD_BG_REFRESH_INTERVAL               : 12;
};
#define BG_REFRESH_INTERVAL                   (0x0FFF)



#define POWER_CTRL_REG                       (0x50000052) /* Power management control */
#define POWER_CTRL_REG_RESET                 (0x00004000)

/*=============================*/
struct __POWER_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CMP_VBAT_HIGH_NOK_ENABLE          : 1;
    volatile uint16_t BITFLD_CMP_VBAT_HIGH_OK_ENABLE           : 1;
    volatile uint16_t BITFLD_VBAT_HL_CONNECT                   : 1;
    volatile uint16_t BITFLD_LDO_CORE_RET_ENABLE               : 1;
    volatile uint16_t BITFLD_LDO_CORE_DISABLE                  : 1;
    volatile uint16_t BITFLD_LDO_LOW_CTRL_REG                  : 2;
    volatile uint16_t BITFLD_LDO_VREF_HOLD_FORCE               : 1;
    volatile uint16_t BITFLD_CP_DISABLE                        : 1;
    volatile uint16_t BITFLD_POR_VBAT_LOW_DISABLE              : 1;
    volatile uint16_t BITFLD_POR_VBAT_LOW_HYST_SEL             : 1;
    volatile uint16_t BITFLD_POR_VBAT_LOW_HYST_DIS             : 1;
    volatile uint16_t BITFLD_POR_VBAT_HIGH_DISABLE             : 1;
    volatile uint16_t BITFLD_POR_VBAT_HIGH_HYST_SEL            : 1;
    volatile uint16_t BITFLD_POR_VBAT_HIGH_HYST_DIS            : 1;
    volatile uint16_t BITFLD_VBAT_HL_CONNECT_MODE              : 1;
};
