sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define CMP_VBAT_HIGH_NOK_ENABLE              (0x0001)
#define CMP_VBAT_HIGH_OK_ENABLE               (0x0002)
#define VBAT_HL_CONNECT                       (0x0004)
#define LDO_CORE_RET_ENABLE                   (0x0008)
#define LDO_CORE_DISABLE                      (0x0010)
#define LDO_LOW_CTRL_REG                      (0x0060)
#define LDO_VREF_HOLD_FORCE                   (0x0080)
#define CP_DISABLE                            (0x0100)
#define POR_VBAT_LOW_DISABLE                  (0x0200)
#define POR_VBAT_LOW_HYST_SEL                 (0x0400)
#define POR_VBAT_LOW_HYST_DIS                 (0x0800)
#define POR_VBAT_HIGH_DISABLE                 (0x1000)
#define POR_VBAT_HIGH_HYST_SEL                (0x2000)
#define POR_VBAT_HIGH_HYST_DIS                (0x4000)
#define VBAT_HL_CONNECT_MODE                  (0x8000)



#define DCDC_SLP_CTRL_REG                    (0x50000056) /* Control of DCDC in sleep */
#define DCDC_SLP_CTRL_REG_RESET              (0x00000090)

/*=============================*/
struct __DCDC_SLP_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DCDC_SLP_ENABLE                   : 1;
    volatile uint16_t BITFLD_DCDC_SLP_INTERVAL                 : 3;
    volatile uint16_t BITFLD_DCDC_SLP_UPDATE_INTERVAL          : 1;
    volatile uint16_t BITFLD_DCDC_SLP_OFFSET                   : 3;
};
#define DCDC_SLP_ENABLE                       (0x0001)
#define DCDC_SLP_INTERVAL                     (0x000E)
#define DCDC_SLP_UPDATE_INTERVAL              (0x0010)
#define DCDC_SLP_OFFSET                       (0x00E0)



#define LDO_CORE_LEVEL_REG                   (0x50000058) /* Control the LDO CORE voltage output */
#define LDO_CORE_LEVEL_REG_RESET             (0x00000000)

/*=============================*/
struct __LDO_CORE_LEVEL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_LDO_CORE_LEVEL                    : 3;
};
#define LDO_CORE_LEVEL                        (0x0007)



/*===========================================================================*/
/* memory map CRG_AON */
/*===========================================================================*/



#define HWR_CTRL_REG                         (0x50000300) /* Hardware Reset control register */
#define HWR_CTRL_REG_RESET                   (0x00000000)

/*=============================*/
struct __HWR_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DISABLE_HWR                       : 1;
};
#define DISABLE_HWR                           (0x0001)



#define RESET_STAT_REG                       (0x50000304) /* Reset status register */
#define RESET_STAT_REG_RESET                 (0x0000000F)

/*=============================*/
struct __RESET_STAT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PORESET_STAT                      : 1;
    volatile uint16_t BITFLD_HWRESET_STAT                      : 1;
    volatile uint16_t BITFLD_SWRESET_STAT                      : 1;
    volatile uint16_t BITFLD_WDOGRESET_STAT                    : 1;
};
#define PORESET_STAT                          (0x0001)
#define HWRESET_STAT                          (0x0002)
#define SWRESET_STAT                          (0x0004)
#define WDOGRESET_STAT                        (0x0008)



#define RAM_LPMX_REG                         (0x50000308) /*  */
#define RAM_LPMX_REG_RESET                   (0x00000007)

/*=============================*/
struct __RAM_LPMX_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RAMx_LPMX                         : 3;
};
#define RAMx_LPMX                             (0x0007)



#define PAD_LATCH_REG                        (0x5000030C) /* Control the state retention of the GPIO ports */
#define PAD_LATCH_REG_RESET                  (0x00000001)

/*=============================*/
struct __PAD_LATCH_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PAD_LATCH_EN                      : 1;
};
#define PAD_LATCH_EN                          (0x0001)



#define HIBERN_CTRL_REG                      (0x50000310) /* Hibernation control register */
#define HIBERN_CTRL_REG_RESET                (0x00000000)

/*=============================*/
struct __HIBERN_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_HIBERNATION_ENABLE                : 1;
    volatile uint16_t BITFLD_HIBERN_WKUP_POLARITY              : 1;
    volatile uint16_t BITFLD_HIBERN_WKUP_MASK                  : 5;
};
#define HIBERNATION_ENABLE                    (0x0001)
#define HIBERN_WKUP_POLARITY                  (0x0002)
#define HIBERN_WKUP_MASK                      (0x007C)



#define PULL_HW_BYPASS_REG                   (0x50000314) /* Control the muxes for P0_1 pull up and down */
#define PULL_HW_BYPASS_REG_RESET             (0x00000001)

/*=============================*/
struct __PULL_HW_BYPASS_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PULL_HW_BYPASS                    : 1;
};
#define PULL_HW_BYPASS                        (0x0001)



/*===========================================================================*/
/* memory map CRG_TIM */
/*===========================================================================*/
//reserved only



/*===========================================================================*/
/* memory map DCDC */
/*===========================================================================*/



#define DCDC_CTRL_REG                        (0x50000080) /*  */
#define DCDC_CTRL_REG_RESET                  (0x000084A2)

/*=============================*/
struct __DCDC_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DCDC_ENABLE                       : 1;
    volatile uint16_t BITFLD_DCDC_CLK_DIV                      : 2;
    volatile uint16_t BITFLD_DCDC_TIMEOUT                      : 3;
    volatile uint16_t BITFLD_DCDC_OK_CLR_CNT                   : 2;
    volatile uint16_t BITFLD_DCDC_ILIM_MIN                     : 4;
    volatile uint16_t BITFLD_DCDC_ILIM_MAX                     : 4;
};
#define DCDC_ENABLE                           (0x0001)
#define DCDC_CLK_DIV                          (0x0006)
#define DCDC_TIMEOUT                          (0x0038)
#define DCDC_OK_CLR_CNT                       (0x00C0)
#define DCDC_ILIM_MIN                         (0x0F00)
#define DCDC_ILIM_MAX                         (0xF000)



#define DCDC_CTRL1_REG                       (0x50000082) /*  */
#define DCDC_CTRL1_REG_RESET                 (0x0000003F)

/*=============================*/
struct __DCDC_CTRL1_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DCDC_ILIM_SLP                     : 4;
    volatile uint16_t BITFLD_DCDC_FIX_ILIM_SLP                 : 1;
    volatile uint16_t BITFLD_DCDC_LEVEL1V1_BUMP                : 1;
};
#define DCDC_ILIM_SLP                         (0x000F)
#define DCDC_FIX_ILIM_SLP                     (0x0010)
#define DCDC_LEVEL1V1_BUMP                    (0x0020)



/*===========================================================================*/
/* memory map DEM */
/*===========================================================================*/
//reserved only



/*===========================================================================*/
/* memory map DMA */
/*===========================================================================*/



#define DMA0_A_STARTL_REG                    (0x50003600) /* Start address Low A of DMA channel 0 */
#define DMA0_A_STARTL_REG_RESET              (0x00000000)

/*=============================*/
struct __DMA0_A_STARTL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA0_A_STARTL                     : 16;
};
#define DMA0_A_STARTL                         (0xFFFF)



#define DMA0_A_STARTH_REG                    (0x50003602) /* Start address High A of DMA channel 0 */
#define DMA0_A_STARTH_REG_RESET              (0x00000000)

/*=============================*/
struct __DMA0_A_STARTH_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA0_A_STARTH                     : 16;
};
#define DMA0_A_STARTH                         (0xFFFF)



