sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define P05_MODE_REG                         (0x50003010) /* P05 Mode Register */
#define P05_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P05_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                               : 5;
             uint16_t                                          : 3;
    volatile uint16_t BITFLD_PUPD                              : 2;
};
#define PID                                   (0x001F)
#define PUPD                                  (0x0300)



#define P06_MODE_REG                         (0x50003012) /* P06 Mode Register */
#define P06_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P06_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                               : 5;
             uint16_t                                          : 3;
    volatile uint16_t BITFLD_PUPD                              : 2;
};
#define PID                                   (0x001F)
#define PUPD                                  (0x0300)



#define P07_MODE_REG                         (0x50003014) /* P07 Mode Register */
#define P07_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P07_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                               : 5;
             uint16_t                                          : 3;
    volatile uint16_t BITFLD_PUPD                              : 2;
};
#define PID                                   (0x001F)
#define PUPD                                  (0x0300)



#define P08_MODE_REG                         (0x50003016) /* P08 Mode Register */
#define P08_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P08_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                               : 5;
             uint16_t                                          : 3;
    volatile uint16_t BITFLD_PUPD                              : 2;
};
#define PID                                   (0x001F)
#define PUPD                                  (0x0300)



#define P09_MODE_REG                         (0x50003018) /* P09 Mode Register */
#define P09_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P09_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                               : 5;
             uint16_t                                          : 3;
    volatile uint16_t BITFLD_PUPD                              : 2;
};
#define PID                                   (0x001F)
#define PUPD                                  (0x0300)



#define P010_MODE_REG                        (0x5000301A) /* P010 Mode Register */
#define P010_MODE_REG_RESET                  (0x00000200)

/*=============================*/
struct __P010_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                               : 5;
             uint16_t                                          : 3;
    volatile uint16_t BITFLD_PUPD                              : 2;
};
#define PID                                   (0x001F)
#define PUPD                                  (0x0300)



#define P011_MODE_REG                        (0x5000301C) /* P011 Mode Register */
#define P011_MODE_REG_RESET                  (0x00000200)

/*=============================*/
struct __P011_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                               : 5;
             uint16_t                                          : 3;
    volatile uint16_t BITFLD_PUPD                              : 2;
};
#define PID                                   (0x001F)
#define PUPD                                  (0x0300)



#define PAD_WEAK_CTRL_REG                    (0x5000301E) /* Pad driving strength control Register */
#define PAD_WEAK_CTRL_REG_RESET              (0x00000000)

/*=============================*/
struct __PAD_WEAK_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PAD_LOW_DRV                       : 12;
};
#define PAD_LOW_DRV                           (0x0FFF)



#define TEST_CTRL5_REG                       (0x50003042) /* Test Control Register 5 */
#define TEST_CTRL5_REG_RESET                 (0x00000000)

/*=============================*/
struct __TEST_CTRL5_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RADIO_CP_TEST_SEL                 : 1;
    volatile uint16_t BITFLD_RADIO_CP_TEST_EN                  : 1;
    volatile uint16_t BITFLD_RADIO_CP_BIAS_TRIM                : 2;
};
#define RADIO_CP_TEST_SEL                     (0x0001)
#define RADIO_CP_TEST_EN                      (0x0002)
#define RADIO_CP_BIAS_TRIM                    (0x000C)



/*===========================================================================*/
/* memory map GPREG */
/*===========================================================================*/



#define SET_FREEZE_REG                       (0x50003300) /* Controls freezing of various timers/counters. */
#define SET_FREEZE_REG_RESET                 (0x00000000)

/*=============================*/
struct __SET_FREEZE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_FRZ_WKUPTIM                       : 1;
    volatile uint16_t BITFLD_FRZ_SWTIM                         : 1;
    volatile uint16_t BITFLD_FRZ_BLETIM                        : 1;
    volatile uint16_t BITFLD_FRZ_WDOG                          : 1;
    volatile uint16_t BITFLD_FRZ_DMA                           : 1;
};
#define FRZ_WKUPTIM                           (0x0001)
#define FRZ_SWTIM                             (0x0002)
#define FRZ_BLETIM                            (0x0004)
#define FRZ_WDOG                              (0x0008)
#define FRZ_DMA                               (0x0010)



#define RESET_FREEZE_REG                     (0x50003302) /* Controls unfreezing of various timers/counters. */
#define RESET_FREEZE_REG_RESET               (0x00000000)

/*=============================*/
struct __RESET_FREEZE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_FRZ_WKUPTIM                       : 1;
    volatile uint16_t BITFLD_FRZ_SWTIM                         : 1;
    volatile uint16_t BITFLD_FRZ_BLETIM                        : 1;
    volatile uint16_t BITFLD_FRZ_WDOG                          : 1;
    volatile uint16_t BITFLD_FRZ_DMA                           : 1;
};
