sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define FRZ_WKUPTIM                           (0x0001)
#define FRZ_SWTIM                             (0x0002)
#define FRZ_BLETIM                            (0x0004)
#define FRZ_WDOG                              (0x0008)
#define FRZ_DMA                               (0x0010)



#define DEBUG_REG                            (0x50003304) /* Various debug information register. */
#define DEBUG_REG_RESET                      (0x00000001)

/*=============================*/
struct __DEBUG_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DEBUGS_FREEZE_EN                  : 1;
};
#define DEBUGS_FREEZE_EN                      (0x0001)



#define GP_STATUS_REG                        (0x50003306) /* General purpose system status register. */
#define GP_STATUS_REG_RESET                  (0x00000000)

/*=============================*/
struct __GP_STATUS_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CAL_PHASE                         : 1;
             uint16_t                                          : 1;
};
#define CAL_PHASE                             (0x0001)



#define GP_CONTROL_REG                       (0x50003308) /* General purpose system control register. */
#define GP_CONTROL_REG_RESET                 (0x00000000)

/*=============================*/
struct __GP_CONTROL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_BLE_WAKEUP_REQ                    : 1;
             uint16_t                                          : 1;
    volatile uint16_t BITFLD_BLE_WAKEUP_LP_IRQ                 : 1;
             uint16_t                                          : 1;
    volatile uint16_t BITFLD_CPU_DMA_BUS_PRIO                  : 1;
    volatile uint16_t BITFLD_BLE_TIMER_DATA_CTRL               : 2;
};
#define BLE_WAKEUP_REQ                        (0x0001)
#define BLE_WAKEUP_LP_IRQ                     (0x0004)
#define CPU_DMA_BUS_PRIO                      (0x0010)
#define BLE_TIMER_DATA_CTRL                   (0x0060)



#define BLE_TIMER_REG                        (0x5000330A) /* BLE FINECNT sampled value while in deep sleep state. */
#define BLE_TIMER_REG_RESET                  (0x00000000)

/*=============================*/
struct __BLE_TIMER_REG
/*=============================*/
{
    volatile uint16_t BITFLD_BLE_TIMER_DATA                    : 10;
};
#define BLE_TIMER_DATA                        (0x03FF)



/*===========================================================================*/
/* memory map I2C */
/*===========================================================================*/



#define I2C_CON_REG                          (0x50001300) /* I2C Control Register */
#define I2C_CON_REG_RESET                    (0x0000007D)

/*=============================*/
struct __I2C_CON_REG
/*=============================*/
{
    volatile uint16_t BITFLD_I2C_MASTER_MODE                   : 1;
    volatile uint16_t BITFLD_I2C_SPEED                         : 2;
    volatile uint16_t BITFLD_I2C_10BITADDR_SLAVE               : 1;
    volatile uint16_t BITFLD_I2C_10BITADDR_MASTER              : 1;
    volatile uint16_t BITFLD_I2C_RESTART_EN                    : 1;
    volatile uint16_t BITFLD_I2C_SLAVE_DISABLE                 : 1;
};
#define I2C_MASTER_MODE                       (0x0001)
#define I2C_SPEED                             (0x0006)
#define I2C_10BITADDR_SLAVE                   (0x0008)
#define I2C_10BITADDR_MASTER                  (0x0010)
#define I2C_RESTART_EN                        (0x0020)
#define I2C_SLAVE_DISABLE                     (0x0040)



#define I2C_TAR_REG                          (0x50001304) /* I2C Target Address Register */
#define I2C_TAR_REG_RESET                    (0x00000055)

/*=============================*/
struct __I2C_TAR_REG
/*=============================*/
{
    volatile uint16_t BITFLD_IC_TAR                            : 10;
    volatile uint16_t BITFLD_GC_OR_START                       : 1;
    volatile uint16_t BITFLD_SPECIAL                           : 1;
};
#define IC_TAR                                (0x03FF)
#define GC_OR_START                           (0x0400)
#define SPECIAL                               (0x0800)



#define I2C_SAR_REG                          (0x50001308) /* I2C Slave Address Register */
#define I2C_SAR_REG_RESET                    (0x00000055)

/*=============================*/
struct __I2C_SAR_REG
/*=============================*/
{
    volatile uint16_t BITFLD_IC_SAR                            : 10;
};
#define IC_SAR                                (0x03FF)



#define I2C_DATA_CMD_REG                     (0x50001310) /* I2C Rx/Tx Data Buffer and Command Register */
#define I2C_DATA_CMD_REG_RESET               (0x00000000)

/*=============================*/
struct __I2C_DATA_CMD_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DAT                               : 8;
    volatile uint16_t BITFLD_I2C_CMD                           : 1;
    volatile uint16_t BITFLD_I2C_STOP                          : 1;
    volatile uint16_t BITFLD_I2C_RESTART                       : 1;
};
#define DAT                                   (0x00FF)
#define I2C_CMD                               (0x0100)
#define I2C_STOP                              (0x0200)
#define I2C_RESTART                           (0x0400)



#define I2C_SS_SCL_HCNT_REG                  (0x50001314) /* Standard Speed I2C Clock SCL High Count Register */
#define I2C_SS_SCL_HCNT_REG_RESET            (0x00000048)

/*=============================*/
struct __I2C_SS_SCL_HCNT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_IC_SS_SCL_HCNT                    : 16;
};
#define IC_SS_SCL_HCNT                        (0xFFFF)



#define I2C_SS_SCL_LCNT_REG                  (0x50001318) /* Standard Speed I2C Clock SCL Low Count Register */
#define I2C_SS_SCL_LCNT_REG_RESET            (0x0000004F)

/*=============================*/
struct __I2C_SS_SCL_LCNT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_IC_SS_SCL_LCNT                    : 16;
};
#define IC_SS_SCL_LCNT                        (0xFFFF)



#define I2C_FS_SCL_HCNT_REG                  (0x5000131C) /* Fast Speed I2C Clock SCL High Count Register */
#define I2C_FS_SCL_HCNT_REG_RESET            (0x00000008)

/*=============================*/
struct __I2C_FS_SCL_HCNT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_IC_FS_SCL_HCNT                    : 16;
};
