sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define I2C_COMP2_VERSION                    (0x500013FA)
#define I2C_COMP2_VERSION_RESET              (0x00003132)

/*=============================*/
struct __I2C_COMP2_VERSION
/*=============================*/
{
    volatile uint16_t BITFLD_IC_COMP2_VERSION                  : 16;
};
#define IC_COMP2_VERSION                      (0xFFFF)



#define I2C_COMP_TYPE_REG                    (0x500013FC)
#define I2C_COMP_TYPE_REG_RESET              (0x00000140)

/*=============================*/
struct __I2C_COMP_TYPE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_IC_COMP_TYPE                      : 16;
};
#define IC_COMP_TYPE                          (0xFFFF)



#define I2C_COMP_TYPE2_REG                   (0x500013FE)
#define I2C_COMP_TYPE2_REG_RESET             (0x00004457)

/*=============================*/
struct __I2C_COMP_TYPE2_REG
/*=============================*/
{
    volatile uint16_t BITFLD_IC_COMP2_TYPE                     : 16;
};
#define IC_COMP2_TYPE                         (0xFFFF)



/*===========================================================================*/
/* memory map KBRD */
/*===========================================================================*/



#define GPIO_IRQ0_IN_SEL_REG                 (0x50001400) /* GPIO interrupt selection for GPIO_IRQ0 */
#define GPIO_IRQ0_IN_SEL_REG_RESET           (0x00000000)

/*=============================*/
struct __GPIO_IRQ0_IN_SEL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_KBRD_IRQ0_SEL                     : 4;
             uint16_t                                          : 2;
};
#define KBRD_IRQ0_SEL                         (0x000F)



#define GPIO_IRQ1_IN_SEL_REG                 (0x50001402) /* GPIO interrupt selection for GPIO_IRQ1 */
#define GPIO_IRQ1_IN_SEL_REG_RESET           (0x00000000)

/*=============================*/
struct __GPIO_IRQ1_IN_SEL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_KBRD_IRQ1_SEL                     : 4;
             uint16_t                                          : 2;
};
#define KBRD_IRQ1_SEL                         (0x000F)



#define GPIO_IRQ2_IN_SEL_REG                 (0x50001404) /* GPIO interrupt selection for GPIO_IRQ2 */
#define GPIO_IRQ2_IN_SEL_REG_RESET           (0x00000000)

/*=============================*/
struct __GPIO_IRQ2_IN_SEL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_KBRD_IRQ2_SEL                     : 4;
             uint16_t                                          : 2;
};
#define KBRD_IRQ2_SEL                         (0x000F)



#define GPIO_IRQ3_IN_SEL_REG                 (0x50001406) /* GPIO interrupt selection for GPIO_IRQ3 */
#define GPIO_IRQ3_IN_SEL_REG_RESET           (0x00000000)

/*=============================*/
struct __GPIO_IRQ3_IN_SEL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_KBRD_IRQ3_SEL                     : 4;
             uint16_t                                          : 2;
};
#define KBRD_IRQ3_SEL                         (0x000F)



#define GPIO_IRQ4_IN_SEL_REG                 (0x50001408) /* GPIO interrupt selection for GPIO_IRQ4 */
#define GPIO_IRQ4_IN_SEL_REG_RESET           (0x00000000)

/*=============================*/
struct __GPIO_IRQ4_IN_SEL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_KBRD_IRQ4_SEL                     : 4;
             uint16_t                                          : 2;
};
#define KBRD_IRQ4_SEL                         (0x000F)



#define GPIO_DEBOUNCE_REG                    (0x5000140C) /* debounce counter value for GPIO inputs */
#define GPIO_DEBOUNCE_REG_RESET              (0x00000000)

/*=============================*/
struct __GPIO_DEBOUNCE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DEB_VALUE                         : 6;
    volatile uint16_t BITFLD_DEB_ENABLE0                       : 1;
    volatile uint16_t BITFLD_DEB_ENABLE1                       : 1;
    volatile uint16_t BITFLD_DEB_ENABLE2                       : 1;
    volatile uint16_t BITFLD_DEB_ENABLE3                       : 1;
    volatile uint16_t BITFLD_DEB_ENABLE4                       : 1;
    volatile uint16_t BITFLD_DEB_ENABLE_KBRD                   : 1;
};
#define DEB_VALUE                             (0x003F)
#define DEB_ENABLE0                           (0x0040)
#define DEB_ENABLE1                           (0x0080)
#define DEB_ENABLE2                           (0x0100)
#define DEB_ENABLE3                           (0x0200)
#define DEB_ENABLE4                           (0x0400)
#define DEB_ENABLE_KBRD                       (0x0800)



#define GPIO_RESET_IRQ_REG                   (0x5000140E) /* GPIO interrupt reset register */
#define GPIO_RESET_IRQ_REG_RESET             (0x00000000)

/*=============================*/
struct __GPIO_RESET_IRQ_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RESET_GPIO0_IRQ                   : 1;
    volatile uint16_t BITFLD_RESET_GPIO1_IRQ                   : 1;
    volatile uint16_t BITFLD_RESET_GPIO2_IRQ                   : 1;
    volatile uint16_t BITFLD_RESET_GPIO3_IRQ                   : 1;
    volatile uint16_t BITFLD_RESET_GPIO4_IRQ                   : 1;
    volatile uint16_t BITFLD_RESET_KBRD_IRQ                    : 1;
};
#define RESET_GPIO0_IRQ                       (0x0001)
#define RESET_GPIO1_IRQ                       (0x0002)
#define RESET_GPIO2_IRQ                       (0x0004)
#define RESET_GPIO3_IRQ                       (0x0008)
#define RESET_GPIO4_IRQ                       (0x0010)
#define RESET_KBRD_IRQ                        (0x0020)



#define GPIO_INT_LEVEL_CTRL_REG              (0x50001410) /* high or low level select for GPIO interrupts */
#define GPIO_INT_LEVEL_CTRL_REG_RESET        (0x00000000)

/*=============================*/
struct __GPIO_INT_LEVEL_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_INPUT_LEVEL0                      : 1;
    volatile uint16_t BITFLD_INPUT_LEVEL1                      : 1;
    volatile uint16_t BITFLD_INPUT_LEVEL2                      : 1;
    volatile uint16_t BITFLD_INPUT_LEVEL3                      : 1;
    volatile uint16_t BITFLD_INPUT_LEVEL4                      : 1;
    volatile uint16_t BITFLD_EDGE_LEVELn0                      : 1;
    volatile uint16_t BITFLD_EDGE_LEVELn1                      : 1;
    volatile uint16_t BITFLD_EDGE_LEVELn2                      : 1;
    volatile uint16_t BITFLD_EDGE_LEVELn3                      : 1;
    volatile uint16_t BITFLD_EDGE_LEVELn4                      : 1;
};
#define INPUT_LEVEL0                          (0x0001)
#define INPUT_LEVEL1                          (0x0002)
#define INPUT_LEVEL2                          (0x0004)
#define INPUT_LEVEL3                          (0x0008)
#define INPUT_LEVEL4                          (0x0010)
#define EDGE_LEVELn0                          (0x0020)
#define EDGE_LEVELn1                          (0x0040)
#define EDGE_LEVELn2                          (0x0080)
#define EDGE_LEVELn3                          (0x0100)
#define EDGE_LEVELn4                          (0x0200)



#define KBRD_IRQ_IN_SEL0_REG                 (0x50001412) /* GPIO interrupt selection for KBRD_IRQ for P0 */
#define KBRD_IRQ_IN_SEL0_REG_RESET           (0x00000000)

/*=============================*/
struct __KBRD_IRQ_IN_SEL0_REG
/*=============================*/
{
    volatile uint16_t BITFLD_KBRD_P00_EN                       : 1;
    volatile uint16_t BITFLD_KBRD_P01_EN                       : 1;
    volatile uint16_t BITFLD_KBRD_P02_EN                       : 1;
    volatile uint16_t BITFLD_KBRD_P03_EN                       : 1;
    volatile uint16_t BITFLD_KBRD_P04_EN                       : 1;
    volatile uint16_t BITFLD_KBRD_P05_EN                       : 1;
    volatile uint16_t BITFLD_KBRD_P06_EN                       : 1;
    volatile uint16_t BITFLD_KBRD_P07_EN                       : 1;
    volatile uint16_t BITFLD_KBRD_P08_EN                       : 1;
    volatile uint16_t BITFLD_KBRD_P09_EN                       : 1;
    volatile uint16_t BITFLD_KBRD_P10_EN                       : 1;
    volatile uint16_t BITFLD_KBRD_P11_EN                       : 1;
};
#define KBRD_P00_EN                           (0x0001)
#define KBRD_P01_EN                           (0x0002)
#define KBRD_P02_EN                           (0x0004)
#define KBRD_P03_EN                           (0x0008)
#define KBRD_P04_EN                           (0x0010)
#define KBRD_P05_EN                           (0x0020)
#define KBRD_P06_EN                           (0x0040)
#define KBRD_P07_EN                           (0x0080)
#define KBRD_P08_EN                           (0x0100)
#define KBRD_P09_EN                           (0x0200)
#define KBRD_P10_EN                           (0x0400)
#define KBRD_P11_EN                           (0x0800)



#define KBRD_CTRL_REG                        (0x50001414) /* GPIO Kbrd control register */
#define KBRD_CTRL_REG_RESET                  (0x00000000)

/*=============================*/
struct __KBRD_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_KEY_REPEAT                        : 6;
    volatile uint16_t BITFLD_KBRD_LEVEL                        : 1;
    volatile uint16_t BITFLD_KBRD_REL                          : 1;
};
