sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define KEY_REPEAT                            (0x003F)
#define KBRD_LEVEL                            (0x0040)
#define KBRD_REL                              (0x0080)



/*===========================================================================*/
/* memory map logo */
/*===========================================================================*/



#define CHIP_ID1_REG                         (0x50003200) /* Chip identification register 1. */
#define CHIP_ID1_REG_RESET                   (0x00000033)

/*=============================*/
struct __CHIP_ID1_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CHIP_ID1                          : 8;
};
#define CHIP_ID1                              (0x00FF)



#define CHIP_ID2_REG                         (0x50003204) /* Chip identification register 2. */
#define CHIP_ID2_REG_RESET                   (0x00000030)

/*=============================*/
struct __CHIP_ID2_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CHIP_ID2                          : 8;
};
#define CHIP_ID2                              (0x00FF)



#define CHIP_ID3_REG                         (0x50003208) /* Chip identification register 3. */
#define CHIP_ID3_REG_RESET                   (0x00000038)

/*=============================*/
struct __CHIP_ID3_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CHIP_ID3                          : 8;
};
#define CHIP_ID3                              (0x00FF)



#define CHIP_ID4_REG                         (0x5000320C) /* Chip identification register 4. */
#define CHIP_ID4_REG_RESET                   (0x00000031)

/*=============================*/
struct __CHIP_ID4_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CHIP_ID4                          : 8;
};
#define CHIP_ID4                              (0x00FF)



#define CHIP_SWC_REG                         (0x50003210)
#define CHIP_SWC_REG_RESET                   (0x00000000)

/*=============================*/
struct __CHIP_SWC_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CHIP_SWC                          : 4;
};
#define CHIP_SWC                              (0x000F)



#define CHIP_REVISION_REG                    (0x50003214)
#define CHIP_REVISION_REG_RESET              (0x00000041)

/*=============================*/
struct __CHIP_REVISION_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CHIP_REVISION                     : 8;
};
#define CHIP_REVISION                         (0x00FF)



#define CHIP_TEST1_REG                       (0x500032F8)
#define CHIP_TEST1_REG_RESET                 (0x00000042)

/*=============================*/
struct __CHIP_TEST1_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CHIP_LAYOUT_REVISION              : 8;
};
#define CHIP_LAYOUT_REVISION                  (0x00FF)



#define CHIP_TEST2_REG                       (0x500032FC)
#define CHIP_TEST2_REG_RESET                 (0x00000000)

/*=============================*/
struct __CHIP_TEST2_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CHIP_METAL_OPTION                 : 4;
};
#define CHIP_METAL_OPTION                     (0x000F)



/*===========================================================================*/
/* memory map OTPC */
/*===========================================================================*/



#define OTPC_MODE_REG                        (0x07F40000) /* Mode register */
#define OTPC_MODE_REG_RESET                  (0x00000000)

/*=============================*/
struct __OTPC_MODE_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_MODE_MODE                    : 3;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_OTPC_MODE_USE_TST_ROW             : 1;
    volatile uint32_t BITFLD_OTPC_MODE_HT_MARG_EN              : 1;
    volatile uint32_t BITFLD_OTPC_MODE_PRG_SEL                 : 3;
};
#define OTPC_MODE_MODE                        (0x0007)
#define OTPC_MODE_USE_TST_ROW                 (0x0010)
#define OTPC_MODE_HT_MARG_EN                  (0x0020)
#define OTPC_MODE_PRG_SEL                     (0x01C0)



#define OTPC_STAT_REG                        (0x07F40004) /* Status register */
#define OTPC_STAT_REG_RESET                  (0x00000007)

/*=============================*/
struct __OTPC_STAT_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_STAT_PRDY                    : 1;
    volatile uint32_t BITFLD_OTPC_STAT_PBUF_EMPTY              : 1;
    volatile uint32_t BITFLD_OTPC_STAT_MRDY                    : 1;
};
#define OTPC_STAT_PRDY                        (0x0001)
#define OTPC_STAT_PBUF_EMPTY                  (0x0002)
#define OTPC_STAT_MRDY                        (0x0004)



#define OTPC_PADDR_REG                       (0x07F40008) /* The address of the word that will be programmed, when the PROG mode is used. */
#define OTPC_PADDR_REG_RESET                 (0x00000000)

/*=============================*/
struct __OTPC_PADDR_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_PADDR                        : 12;
};
#define OTPC_PADDR                            (0x0FFF)



#define OTPC_PWORD_REG                       (0x07F4000C) /* The 32-bit word that will be programmed, when the PROG mode is used. */
#define OTPC_PWORD_REG_RESET                 (0x00000000)

/*=============================*/
struct __OTPC_PWORD_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_PWORD                        : 32;
};
#define OTPC_PWORD                            (0xFFFFFFFF)



#define OTPC_TIM1_REG                        (0x07F40010) /* Various timing parameters of the OTP cell. */
#define OTPC_TIM1_REG_RESET                  (0x0999100F)

/*=============================*/
struct __OTPC_TIM1_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_TIM1_CC_T_1US                : 8;
    volatile uint32_t BITFLD_OTPC_TIM1_CC_T_20NS               : 3;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_OTPC_TIM1_CC_T_RD                 : 4;
    volatile uint32_t BITFLD_OTPC_TIM1_US_T_PL                 : 4;
    volatile uint32_t BITFLD_OTPC_TIM1_US_T_CS                 : 4;
    volatile uint32_t BITFLD_OTPC_TIM1_US_T_CSP                : 7;
};
#define OTPC_TIM1_CC_T_1US                    (0x00FF)
#define OTPC_TIM1_CC_T_20NS                   (0x0700)
#define OTPC_TIM1_CC_T_RD                     (0xF000)
#define OTPC_TIM1_US_T_PL                     (0xF0000)
#define OTPC_TIM1_US_T_CS                     (0xF00000)
#define OTPC_TIM1_US_T_CSP                    (0x7F000000)



