sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define OTPC_TIM2_REG                        (0x07F40014) /* Various timing parameters of the OTP cell. */
#define OTPC_TIM2_REG_RESET                  (0xA4040409)

/*=============================*/
struct __OTPC_TIM2_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_TIM2_US_T_PW                 : 5;
    volatile uint32_t BITFLD_OTPC_TIM2_US_T_PWI                : 3;
    volatile uint32_t BITFLD_OTPC_TIM2_US_T_PPR                : 7;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_OTPC_TIM2_US_T_PPS                : 5;
    volatile uint32_t BITFLD_OTPC_TIM2_US_T_VDS                : 3;
    volatile uint32_t BITFLD_OTPC_TIM2_US_T_PPH                : 5;
    volatile uint32_t BITFLD_OTPC_TIM2_US_T_SAS                : 2;
    volatile uint32_t BITFLD_OTPC_TIM2_US_ADD_CC_EN            : 1;
};
#define OTPC_TIM2_US_T_PW                     (0x001F)
#define OTPC_TIM2_US_T_PWI                    (0x00E0)
#define OTPC_TIM2_US_T_PPR                    (0x7F00)
#define OTPC_TIM2_US_T_PPS                    (0x1F0000)
#define OTPC_TIM2_US_T_VDS                    (0xE00000)
#define OTPC_TIM2_US_T_PPH                    (0x1F000000)
#define OTPC_TIM2_US_T_SAS                    (0x60000000)
#define OTPC_TIM2_US_ADD_CC_EN                (0x80000000)



#define OTPC_AHBADR_REG                      (0x07F40018) /* AHB master start address */
#define OTPC_AHBADR_REG_RESET                (0x00000000)

/*=============================*/
struct __OTPC_AHBADR_REG
/*=============================*/
{
             uint32_t                                          : 2;
    volatile uint32_t BITFLD_OTPC_AHBADR                       : 14;
};
#define OTPC_AHBADR                           (0xFFFC)



#define OTPC_CELADR_REG                      (0x07F4001C) /* OTP cell start address */
#define OTPC_CELADR_REG_RESET                (0x00000000)

/*=============================*/
struct __OTPC_CELADR_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_CELADR                       : 12;
};
#define OTPC_CELADR                           (0x0FFF)



#define OTPC_NWORDS_REG                      (0x07F40020) /* Number of words */
#define OTPC_NWORDS_REG_RESET                (0x00000000)

/*=============================*/
struct __OTPC_NWORDS_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_NWORDS                       : 12;
};
#define OTPC_NWORDS                           (0x0FFF)



/*===========================================================================*/
/* memory map PATCH */
/*===========================================================================*/
//reserved only



/*===========================================================================*/
/* memory map QDEC */
/*===========================================================================*/



#define QDEC_CTRL_REG                        (0x50000200) /* Quad Decoder control register */
#define QDEC_CTRL_REG_RESET                  (0x00000011)

/*=============================*/
struct __QDEC_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_QDEC_IRQ_ENABLE                   : 1;
    volatile uint16_t BITFLD_QDEC_EVENT_CNT_CLR                : 1;
    volatile uint16_t BITFLD_QDEC_IRQ_STATUS                   : 1;
    volatile uint16_t BITFLD_QDEC_IRQ_THRES                    : 8;
};
#define QDEC_IRQ_ENABLE                       (0x0001)
#define QDEC_EVENT_CNT_CLR                    (0x0002)
#define QDEC_IRQ_STATUS                       (0x0004)
#define QDEC_IRQ_THRES                        (0x07F8)



#define QDEC_XCNT_REG                        (0x50000202) /* Counter value of the X Axis */
#define QDEC_XCNT_REG_RESET                  (0x00000000)

/*=============================*/
struct __QDEC_XCNT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_QDEC_X_CNT                        : 16;
};
#define QDEC_X_CNT                            (0xFFFF)



#define QDEC_YCNT_REG                        (0x50000204) /* Counter value of the Y Axis */
#define QDEC_YCNT_REG_RESET                  (0x00000000)

/*=============================*/
struct __QDEC_YCNT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_QDEC_Y_CNT                        : 16;
};
#define QDEC_Y_CNT                            (0xFFFF)



#define QDEC_CLOCKDIV_REG                    (0x50000206) /* Clock divider register */
#define QDEC_CLOCKDIV_REG_RESET              (0x000003E7)

/*=============================*/
struct __QDEC_CLOCKDIV_REG
/*=============================*/
{
    volatile uint16_t BITFLD_QDEC_CLOCKDIV                     : 10;
    volatile uint16_t BITFLD_QDEC_PRESCALER_EN                 : 1;
};
#define QDEC_CLOCKDIV                         (0x03FF)
#define QDEC_PRESCALER_EN                     (0x0400)



#define QDEC_CTRL2_REG                       (0x50000208) /* Quad Decoder port selection register */
#define QDEC_CTRL2_REG_RESET                 (0x00000ED1)

/*=============================*/
struct __QDEC_CTRL2_REG
/*=============================*/
{
    volatile uint16_t BITFLD_QDEC_CHX_PORT_SEL                 : 3;
    volatile uint16_t BITFLD_QDEC_CHY_PORT_SEL                 : 3;
    volatile uint16_t BITFLD_QDEC_CHZ_PORT_SEL                 : 3;
    volatile uint16_t BITFLD_QDEC_CHX_EVENT_MODE               : 1;
    volatile uint16_t BITFLD_QDEC_CHY_EVENT_MODE               : 1;
    volatile uint16_t BITFLD_QDEC_CHZ_EVENT_MODE               : 1;
};
#define QDEC_CHX_PORT_SEL                     (0x0007)
#define QDEC_CHY_PORT_SEL                     (0x0038)
#define QDEC_CHZ_PORT_SEL                     (0x01C0)
#define QDEC_CHX_EVENT_MODE                   (0x0200)
#define QDEC_CHY_EVENT_MODE                   (0x0400)
#define QDEC_CHZ_EVENT_MODE                   (0x0800)



#define QDEC_ZCNT_REG                        (0x5000020A) /* Counter value of the Z Axis */
#define QDEC_ZCNT_REG_RESET                  (0x00000000)

/*=============================*/
struct __QDEC_ZCNT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_QDEC_Z_CNT                        : 16;
};
#define QDEC_Z_CNT                            (0xFFFF)



#define QDEC_EVENT_CNT_REG                   (0x5000020C) /* Event counter register */
#define QDEC_EVENT_CNT_REG_RESET             (0x00000000)

/*=============================*/
struct __QDEC_EVENT_CNT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_QDEC_EVENT_CNT                    : 8;
};
#define QDEC_EVENT_CNT                        (0x00FF)



/*===========================================================================*/
/* memory map RFCU */
/*===========================================================================*/
//reserved only



/*===========================================================================*/
/* memory map RFCU_POWER */
/*===========================================================================*/
//reserved only



/*===========================================================================*/
/* memory map RFMON */
/*===========================================================================*/
//reserved only



/*===========================================================================*/
/* memory map RTC */
/*===========================================================================*/



