sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define RTC_CONTROL_REG                      (0x50004100) /* RTC Control Register */
#define RTC_CONTROL_REG_RESET                (0x00000003)

/*=============================*/
struct __RTC_CONTROL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RTC_TIME_DISABLE                  : 1;
    volatile uint32_t BITFLD_RTC_CAL_DISABLE                   : 1;
};
#define RTC_TIME_DISABLE                      (0x0001)
#define RTC_CAL_DISABLE                       (0x0002)



#define RTC_HOUR_MODE_REG                    (0x50004104) /* RTC Hour Mode Register */
#define RTC_HOUR_MODE_REG_RESET              (0x00000000)

/*=============================*/
struct __RTC_HOUR_MODE_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RTC_HMS                           : 1;
};
#define RTC_HMS                               (0x0001)



#define RTC_TIME_REG                         (0x50004108) /* RTC Time Register */
#define RTC_TIME_REG_RESET                   (0x00000000)

/*=============================*/
struct __RTC_TIME_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RTC_TIME_H_U                      : 4;
    volatile uint32_t BITFLD_RTC_TIME_H_T                      : 4;
    volatile uint32_t BITFLD_RTC_TIME_S_U                      : 4;
    volatile uint32_t BITFLD_RTC_TIME_S_T                      : 3;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_RTC_TIME_M_U                      : 4;
    volatile uint32_t BITFLD_RTC_TIME_M_T                      : 3;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_RTC_TIME_HR_U                     : 4;
    volatile uint32_t BITFLD_RTC_TIME_HR_T                     : 2;
    volatile uint32_t BITFLD_RTC_TIME_PM                       : 1;
    volatile uint32_t BITFLD_RTC_TIME_CH                       : 1;
};
#define RTC_TIME_H_U                          (0x000F)
#define RTC_TIME_H_T                          (0x00F0)
#define RTC_TIME_S_U                          (0x0F00)
#define RTC_TIME_S_T                          (0x7000)
#define RTC_TIME_M_U                          (0xF0000)
#define RTC_TIME_M_T                          (0x700000)
#define RTC_TIME_HR_U                         (0xF000000)
#define RTC_TIME_HR_T                         (0x30000000)
#define RTC_TIME_PM                           (0x40000000)
#define RTC_TIME_CH                           (0x80000000)



#define RTC_CALENDAR_REG                     (0x5000410C) /* RTC Calendar Register */
#define RTC_CALENDAR_REG_RESET               (0x2000010F)

/*=============================*/
struct __RTC_CALENDAR_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RTC_DAY                           : 3;
    volatile uint32_t BITFLD_RTC_CAL_M_U                       : 4;
    volatile uint32_t BITFLD_RTC_CAL_M_T                       : 1;
    volatile uint32_t BITFLD_RTC_CAL_D_U                       : 4;
    volatile uint32_t BITFLD_RTC_CAL_D_T                       : 2;
             uint32_t                                          : 2;
    volatile uint32_t BITFLD_RTC_CAL_Y_U                       : 4;
    volatile uint32_t BITFLD_RTC_CAL_Y_T                       : 4;
    volatile uint32_t BITFLD_RTC_CAL_C_U                       : 4;
    volatile uint32_t BITFLD_RTC_CAL_C_T                       : 2;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_RTC_CAL_CH                        : 1;
};
#define RTC_DAY                               (0x0007)
#define RTC_CAL_M_U                           (0x0078)
#define RTC_CAL_M_T                           (0x0080)
#define RTC_CAL_D_U                           (0x0F00)
#define RTC_CAL_D_T                           (0x3000)
#define RTC_CAL_Y_U                           (0xF0000)
#define RTC_CAL_Y_T                           (0xF00000)
#define RTC_CAL_C_U                           (0xF000000)
#define RTC_CAL_C_T                           (0x30000000)
#define RTC_CAL_CH                            (0x80000000)



#define RTC_TIME_ALARM_REG                   (0x50004110) /* RTC Time Alarm Register */
#define RTC_TIME_ALARM_REG_RESET             (0x00000000)

/*=============================*/
struct __RTC_TIME_ALARM_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RTC_TIME_H_U                      : 4;
    volatile uint32_t BITFLD_RTC_TIME_H_T                      : 4;
    volatile uint32_t BITFLD_RTC_TIME_S_U                      : 4;
    volatile uint32_t BITFLD_RTC_TIME_S_T                      : 3;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_RTC_TIME_M_U                      : 4;
    volatile uint32_t BITFLD_RTC_TIME_M_T                      : 3;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_RTC_TIME_HR_U                     : 4;
    volatile uint32_t BITFLD_RTC_TIME_HR_T                     : 2;
    volatile uint32_t BITFLD_RTC_TIME_PM                       : 1;
};
#define RTC_TIME_H_U                          (0x000F)
#define RTC_TIME_H_T                          (0x00F0)
#define RTC_TIME_S_U                          (0x0F00)
#define RTC_TIME_S_T                          (0x7000)
#define RTC_TIME_M_U                          (0xF0000)
#define RTC_TIME_M_T                          (0x700000)
#define RTC_TIME_HR_U                         (0xF000000)
#define RTC_TIME_HR_T                         (0x30000000)
#define RTC_TIME_PM                           (0x40000000)



#define RTC_CALENDAR_ALARM_REG               (0x50004114) /* RTC Calendar Alram Register */
#define RTC_CALENDAR_ALARM_REG_RESET         (0x00000000)

/*=============================*/
struct __RTC_CALENDAR_ALARM_REG
/*=============================*/
{
             uint32_t                                          : 3;
    volatile uint32_t BITFLD_RTC_CAL_M_U                       : 4;
    volatile uint32_t BITFLD_RTC_CAL_M_T                       : 1;
    volatile uint32_t BITFLD_RTC_CAL_D_U                       : 4;
    volatile uint32_t BITFLD_RTC_CAL_D_T                       : 2;
};
