sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define RTC_CAL_M_U                           (0x0078)
#define RTC_CAL_M_T                           (0x0080)
#define RTC_CAL_D_U                           (0x0F00)
#define RTC_CAL_D_T                           (0x3000)



#define RTC_ALARM_ENABLE_REG                 (0x50004118) /* RTC Alarm Enable Register */
#define RTC_ALARM_ENABLE_REG_RESET           (0x00000000)

/*=============================*/
struct __RTC_ALARM_ENABLE_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RTC_ALARM_HOS_EN                  : 1;
    volatile uint32_t BITFLD_RTC_ALARM_SEC_EN                  : 1;
    volatile uint32_t BITFLD_RTC_ALARM_MIN_EN                  : 1;
    volatile uint32_t BITFLD_RTC_ALARM_HOUR_EN                 : 1;
    volatile uint32_t BITFLD_RTC_ALARM_DATE_EN                 : 1;
    volatile uint32_t BITFLD_RTC_ALARM_MNTH_EN                 : 1;
};
#define RTC_ALARM_HOS_EN                      (0x0001)
#define RTC_ALARM_SEC_EN                      (0x0002)
#define RTC_ALARM_MIN_EN                      (0x0004)
#define RTC_ALARM_HOUR_EN                     (0x0008)
#define RTC_ALARM_DATE_EN                     (0x0010)
#define RTC_ALARM_MNTH_EN                     (0x0020)



#define RTC_EVENT_FLAGS_REG                  (0x5000411C) /* RTC Event Flags Register */
#define RTC_EVENT_FLAGS_REG_RESET            (0x00000000)

/*=============================*/
struct __RTC_EVENT_FLAGS_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RTC_EVENT_HOS                     : 1;
    volatile uint32_t BITFLD_RTC_EVENT_SEC                     : 1;
    volatile uint32_t BITFLD_RTC_EVENT_MIN                     : 1;
    volatile uint32_t BITFLD_RTC_EVENT_HOUR                    : 1;
    volatile uint32_t BITFLD_RTC_EVENT_DATE                    : 1;
    volatile uint32_t BITFLD_RTC_EVENT_MNTH                    : 1;
    volatile uint32_t BITFLD_RTC_EVENT_ALRM                    : 1;
};
#define RTC_EVENT_HOS                         (0x0001)
#define RTC_EVENT_SEC                         (0x0002)
#define RTC_EVENT_MIN                         (0x0004)
#define RTC_EVENT_HOUR                        (0x0008)
#define RTC_EVENT_DATE                        (0x0010)
#define RTC_EVENT_MNTH                        (0x0020)
#define RTC_EVENT_ALRM                        (0x0040)



#define RTC_INTERRUPT_ENABLE_REG             (0x50004120) /* RTC Interrupt Enable Register */
#define RTC_INTERRUPT_ENABLE_REG_RESET       (0x00000000)

/*=============================*/
struct __RTC_INTERRUPT_ENABLE_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RTC_HOS_INT_EN                    : 1;
    volatile uint32_t BITFLD_RTC_SEC_INT_EN                    : 1;
    volatile uint32_t BITFLD_RTC_MIN_INT_EN                    : 1;
    volatile uint32_t BITFLD_RTC_HOUR_INT_EN                   : 1;
    volatile uint32_t BITFLD_RTC_DATE_INT_EN                   : 1;
    volatile uint32_t BITFLD_RTC_MNTH_INT_EN                   : 1;
    volatile uint32_t BITFLD_RTC_ALRM_INT_EN                   : 1;
};
#define RTC_HOS_INT_EN                        (0x0001)
#define RTC_SEC_INT_EN                        (0x0002)
#define RTC_MIN_INT_EN                        (0x0004)
#define RTC_HOUR_INT_EN                       (0x0008)
#define RTC_DATE_INT_EN                       (0x0010)
#define RTC_MNTH_INT_EN                       (0x0020)
#define RTC_ALRM_INT_EN                       (0x0040)



#define RTC_INTERRUPT_DISABLE_REG            (0x50004124) /* RTC Interrupt Disable Register */
#define RTC_INTERRUPT_DISABLE_REG_RESET      (0x00000000)

/*=============================*/
struct __RTC_INTERRUPT_DISABLE_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RTC_HOS_INT_DIS                   : 1;
    volatile uint32_t BITFLD_RTC_SEC_INT_DIS                   : 1;
    volatile uint32_t BITFLD_RTC_MIN_INT_DIS                   : 1;
    volatile uint32_t BITFLD_RTC_HOUR_INT_DIS                  : 1;
    volatile uint32_t BITFLD_RTC_DATE_INT_DIS                  : 1;
    volatile uint32_t BITFLD_RTC_MNTH_INT_DIS                  : 1;
    volatile uint32_t BITFLD_RTC_ALRM_INT_DIS                  : 1;
};
#define RTC_HOS_INT_DIS                       (0x0001)
#define RTC_SEC_INT_DIS                       (0x0002)
#define RTC_MIN_INT_DIS                       (0x0004)
#define RTC_HOUR_INT_DIS                      (0x0008)
#define RTC_DATE_INT_DIS                      (0x0010)
#define RTC_MNTH_INT_DIS                      (0x0020)
#define RTC_ALRM_INT_DIS                      (0x0040)



#define RTC_INTERRUPT_MASK_REG               (0x50004128) /* RTC Interrupt Mask Register */
#define RTC_INTERRUPT_MASK_REG_RESET         (0x0000007F)

/*=============================*/
struct __RTC_INTERRUPT_MASK_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RTC_HOS_INT_MSK                   : 1;
    volatile uint32_t BITFLD_RTC_SEC_INT_MSK                   : 1;
    volatile uint32_t BITFLD_RTC_MIN_INT_MSK                   : 1;
    volatile uint32_t BITFLD_RTC_HOUR_INT_MSK                  : 1;
    volatile uint32_t BITFLD_RTC_DATE_INT_MSK                  : 1;
    volatile uint32_t BITFLD_RTC_MNTH_INT_MSK                  : 1;
    volatile uint32_t BITFLD_RTC_ALRM_INT_MSK                  : 1;
};
#define RTC_HOS_INT_MSK                       (0x0001)
#define RTC_SEC_INT_MSK                       (0x0002)
#define RTC_MIN_INT_MSK                       (0x0004)
#define RTC_HOUR_INT_MSK                      (0x0008)
#define RTC_DATE_INT_MSK                      (0x0010)
#define RTC_MNTH_INT_MSK                      (0x0020)
#define RTC_ALRM_INT_MSK                      (0x0040)



#define RTC_STATUS_REG                       (0x5000412C) /* RTC Status Register */
#define RTC_STATUS_REG_RESET                 (0x0000000F)

/*=============================*/
struct __RTC_STATUS_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RTC_VALID_TIME                    : 1;
    volatile uint32_t BITFLD_RTC_VALID_CAL                     : 1;
    volatile uint32_t BITFLD_RTC_VALID_TIME_ALM                : 1;
    volatile uint32_t BITFLD_RTC_VALID_CAL_ALM                 : 1;
};
