sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define SPI_CS_SELECT                         (0x0007)



#define SPI_FIFO_HIGH_REG                    (0x50001228) /* Spi TX/RX High 16bit word */
#define SPI_FIFO_HIGH_REG_RESET              (0x00000000)

/*=============================*/
struct __SPI_FIFO_HIGH_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SPI_FIFO_HIGH                     : 16;
};
#define SPI_FIFO_HIGH                         (0xFFFF)



#define SPI_TXBUFFER_FORCE_L_REG             (0x5000122C) /* SPI TX buffer force low value */
#define SPI_TXBUFFER_FORCE_L_REG_RESET       (0x00000000)

/*=============================*/
struct __SPI_TXBUFFER_FORCE_L_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SPI_TXBUFFER_FORCE_L              : 16;
};
#define SPI_TXBUFFER_FORCE_L                  (0xFFFF)



#define SPI_TXBUFFER_FORCE_H_REG             (0x50001230) /* SPI TX buffer force high value */
#define SPI_TXBUFFER_FORCE_H_REG_RESET       (0x00000000)

/*=============================*/
struct __SPI_TXBUFFER_FORCE_H_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SPI_TXBUFFER_FORCE_H              : 16;
};
#define SPI_TXBUFFER_FORCE_H                  (0xFFFF)



#define SPI_PAUSE_CTRL_REG                   (0x50001234) /* SPI pause control register */
#define SPI_PAUSE_CTRL_REG_RESET             (0x00000000)

/*=============================*/
struct __SPI_PAUSE_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SPI_PAUSE_CLOCKS                  : 8;
    volatile uint16_t BITFLD_SPI_PAUSE_EN                      : 1;
    volatile uint16_t BITFLD_SPI_PAUSE_DATA_READY_EN           : 1;
    volatile uint16_t BITFLD_SPI_PAUSE_CLOCK_EN                : 1;
    volatile uint16_t BITFLD_SPI_PAUSE_READY_ACTIVE_HIGH       : 1;
    volatile uint16_t BITFLD_SPI_PAUSE_DATA_RDY_IS_MISO        : 1;
};
#define SPI_PAUSE_CLOCKS                      (0x00FF)
#define SPI_PAUSE_EN                          (0x0100)
#define SPI_PAUSE_DATA_READY_EN               (0x0200)
#define SPI_PAUSE_CLOCK_EN                    (0x0400)
#define SPI_PAUSE_READY_ACTIVE_HIGH           (0x0800)
#define SPI_PAUSE_DATA_RDY_IS_MISO            (0x1000)



/*===========================================================================*/
/* memory map Timer+3PWM */
/*===========================================================================*/



#define TIMER0_CTRL_REG                      (0x50003400) /* Timer0 control register */
#define TIMER0_CTRL_REG_RESET                (0x00000000)

/*=============================*/
struct __TIMER0_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_TIM0_CTRL                         : 1;
    volatile uint16_t BITFLD_TIM0_CLK_SEL                      : 1;
    volatile uint16_t BITFLD_TIM0_CLK_DIV                      : 1;
    volatile uint16_t BITFLD_PWM_MODE                          : 1;
};
#define TIM0_CTRL                             (0x0001)
#define TIM0_CLK_SEL                          (0x0002)
#define TIM0_CLK_DIV                          (0x0004)
#define PWM_MODE                              (0x0008)



#define TIMER0_ON_REG                        (0x50003402) /* Timer0 on control register */
#define TIMER0_ON_REG_RESET                  (0x00000000)

/*=============================*/
struct __TIMER0_ON_REG
/*=============================*/
{
    volatile uint16_t BITFLD_TIM0_ON                           : 16;
};
#define TIM0_ON                               (0xFFFF)



#define TIMER0_RELOAD_M_REG                  (0x50003404) /* 16 bits reload value for Timer0 */
#define TIMER0_RELOAD_M_REG_RESET            (0x00000000)

/*=============================*/
struct __TIMER0_RELOAD_M_REG
/*=============================*/
{
    volatile uint16_t BITFLD_TIM0_M                            : 16;
};
#define TIM0_M                                (0xFFFF)



#define TIMER0_RELOAD_N_REG                  (0x50003406) /* 16 bits reload value for Timer0 */
#define TIMER0_RELOAD_N_REG_RESET            (0x00000000)

/*=============================*/
struct __TIMER0_RELOAD_N_REG
/*=============================*/
{
    volatile uint16_t BITFLD_TIM0_N                            : 16;
};
#define TIM0_N                                (0xFFFF)



#define TRIPLE_PWM_FREQUENCY                 (0x50003408) /* Frequency for PWM 2,3,4,5,6 and 7 */
#define TRIPLE_PWM_FREQUENCY_RESET           (0x00000000)

/*=============================*/
struct __TRIPLE_PWM_FREQUENCY
/*=============================*/
{
    volatile uint16_t BITFLD_PWM_FREQ                          : 14;
};
#define PWM_FREQ                              (0x3FFF)



#define PWM2_START_CYCLE                     (0x5000340A) /* Defines start Cycle for PWM2 */
#define PWM2_START_CYCLE_RESET               (0x00000000)

/*=============================*/
struct __PWM2_START_CYCLE
/*=============================*/
{
    volatile uint16_t BITFLD_START_CYCLE                       : 14;
};
#define START_CYCLE                           (0x3FFF)



#define PWM3_START_CYCLE                     (0x5000340C) /* Defines start Cycle for PWM3 */
#define PWM3_START_CYCLE_RESET               (0x00000000)

/*=============================*/
struct __PWM3_START_CYCLE
/*=============================*/
{
    volatile uint16_t BITFLD_START_CYCLE                       : 14;
};
#define START_CYCLE                           (0x3FFF)



#define PWM4_START_CYCLE                     (0x5000340E) /* Defines start Cycle for PWM4 */
#define PWM4_START_CYCLE_RESET               (0x00000000)

/*=============================*/
struct __PWM4_START_CYCLE
/*=============================*/
{
    volatile uint16_t BITFLD_START_CYCLE                       : 14;
};
#define START_CYCLE                           (0x3FFF)



#define PWM5_START_CYCLE                     (0x50003410) /* Defines start Cycle for PWM5 */
#define PWM5_START_CYCLE_RESET               (0x00000000)

/*=============================*/
struct __PWM5_START_CYCLE
/*=============================*/
{
    volatile uint16_t BITFLD_START_CYCLE                       : 14;
};
