sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define START_CYCLE                           (0x3FFF)



#define PWM6_START_CYCLE                     (0x50003412) /* Defines start Cycle for PWM6 */
#define PWM6_START_CYCLE_RESET               (0x00000000)

/*=============================*/
struct __PWM6_START_CYCLE
/*=============================*/
{
    volatile uint16_t BITFLD_START_CYCLE                       : 14;
};
#define START_CYCLE                           (0x3FFF)



#define PWM7_START_CYCLE                     (0x50003414) /* Defines start Cycle for PWM7 */
#define PWM7_START_CYCLE_RESET               (0x00000000)

/*=============================*/
struct __PWM7_START_CYCLE
/*=============================*/
{
    volatile uint16_t BITFLD_START_CYCLE                       : 14;
};
#define START_CYCLE                           (0x3FFF)



#define PWM2_END_CYCLE                       (0x50003416) /* Defines end Cycle for PWM2 */
#define PWM2_END_CYCLE_RESET                 (0x00000000)

/*=============================*/
struct __PWM2_END_CYCLE
/*=============================*/
{
    volatile uint16_t BITFLD_END_CYCLE                         : 14;
};
#define END_CYCLE                             (0x3FFF)



#define PWM3_END_CYCLE                       (0x50003418) /* Defines end Cycle for PWM3 */
#define PWM3_END_CYCLE_RESET                 (0x00000000)

/*=============================*/
struct __PWM3_END_CYCLE
/*=============================*/
{
    volatile uint16_t BITFLD_END_CYCLE                         : 14;
};
#define END_CYCLE                             (0x3FFF)



#define PWM4_END_CYCLE                       (0x5000341A) /* Defines end Cycle for PWM4 */
#define PWM4_END_CYCLE_RESET                 (0x00000000)

/*=============================*/
struct __PWM4_END_CYCLE
/*=============================*/
{
    volatile uint16_t BITFLD_END_CYCLE                         : 14;
};
#define END_CYCLE                             (0x3FFF)



#define PWM5_END_CYCLE                       (0x5000341C) /* Defines end Cycle for PWM5 */
#define PWM5_END_CYCLE_RESET                 (0x00000000)

/*=============================*/
struct __PWM5_END_CYCLE
/*=============================*/
{
    volatile uint16_t BITFLD_END_CYCLE                         : 14;
};
#define END_CYCLE                             (0x3FFF)



#define PWM6_END_CYCLE                       (0x5000341E) /* Defines end Cycle for PWM6 */
#define PWM6_END_CYCLE_RESET                 (0x00000000)

/*=============================*/
struct __PWM6_END_CYCLE
/*=============================*/
{
    volatile uint16_t BITFLD_END_CYCLE                         : 14;
};
#define END_CYCLE                             (0x3FFF)



#define PWM7_END_CYCLE                       (0x50003420) /* Defines end Cycle for PWM7 */
#define PWM7_END_CYCLE_RESET                 (0x00000000)

/*=============================*/
struct __PWM7_END_CYCLE
/*=============================*/
{
    volatile uint16_t BITFLD_END_CYCLE                         : 14;
};
#define END_CYCLE                             (0x3FFF)



#define TRIPLE_PWM_CTRL_REG                  (0x50003422) /* PWM 2,3,4,5,6,7 Control */
#define TRIPLE_PWM_CTRL_REG_RESET            (0x00000004)

/*=============================*/
struct __TRIPLE_PWM_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_TRIPLE_PWM_ENABLE                 : 1;
    volatile uint16_t BITFLD_SW_PAUSE_EN                       : 1;
    volatile uint16_t BITFLD_HW_PAUSE_EN                       : 1;
    volatile uint16_t BITFLD_TRIPLE_PWM_CLK_SEL                : 1;
};
#define TRIPLE_PWM_ENABLE                     (0x0001)
#define SW_PAUSE_EN                           (0x0002)
#define HW_PAUSE_EN                           (0x0004)
#define TRIPLE_PWM_CLK_SEL                    (0x0008)



/*===========================================================================*/
/* memory map Timer1 */
/*===========================================================================*/



#define TIMER1_CTRL_REG                      (0x50004000) /* Timer1 control register */
#define TIMER1_CTRL_REG_RESET                (0x00000000)

/*=============================*/
struct __TIMER1_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_TIMER1_RELOAD                     : 11;
    volatile uint32_t BITFLD_TIMER1_ENABLE                     : 1;
    volatile uint32_t BITFLD_TIMER1_COUNT_DOWN_EN              : 1;
    volatile uint32_t BITFLD_TIMER1_IRQ_EN                     : 1;
    volatile uint32_t BITFLD_TIMER1_FREE_RUN_MODE_EN           : 1;
    volatile uint32_t BITFLD_TIMER1_USE_SYS_CLK                : 1;
    volatile uint32_t BITFLD_TIMER1_CLK_EN                     : 1;
};
#define TIMER1_RELOAD                         (0x07FF)
#define TIMER1_ENABLE                         (0x0800)
#define TIMER1_COUNT_DOWN_EN                  (0x1000)
#define TIMER1_IRQ_EN                         (0x2000)
#define TIMER1_FREE_RUN_MODE_EN               (0x4000)
#define TIMER1_USE_SYS_CLK                    (0x8000)
#define TIMER1_CLK_EN                         (0x10000)



#define TIMER1_CAPTURE_REG                   (0x50004004) /* Timer1 Capture control register */
#define TIMER1_CAPTURE_REG_RESET             (0x00000000)

/*=============================*/
struct __TIMER1_CAPTURE_REG
/*=============================*/
{
    volatile uint32_t BITFLD_TIMER1_GPIO1_CONF                 : 4;
    volatile uint32_t BITFLD_TIMER1_IN1_EVENT_FALL_EN          : 1;
    volatile uint32_t BITFLD_TIMER1_IN1_COUNT_EN               : 1;
    volatile uint32_t BITFLD_TIMER1_IN1_IRQ_EN                 : 1;
    volatile uint32_t BITFLD_TIMER1_IN1_PERIOD_MAX             : 6;
    volatile uint32_t BITFLD_TIMER1_IN1_STAMP_TYPE             : 1;
    volatile uint32_t BITFLD_TIMER1_GPIO2_CONF                 : 4;
    volatile uint32_t BITFLD_TIMER1_IN2_EVENT_FALL_EN          : 1;
    volatile uint32_t BITFLD_TIMER1_IN2_COUNT_EN               : 1;
    volatile uint32_t BITFLD_TIMER1_IN2_IRQ_EN                 : 1;
    volatile uint32_t BITFLD_TIMER1_IN2_PERIOD_MAX             : 6;
    volatile uint32_t BITFLD_TIMER1_IN2_STAMP_TYPE             : 1;
};
#define TIMER1_GPIO1_CONF                     (0x000F)
#define TIMER1_IN1_EVENT_FALL_EN              (0x0010)
#define TIMER1_IN1_COUNT_EN                   (0x0020)
#define TIMER1_IN1_IRQ_EN                     (0x0040)
#define TIMER1_IN1_PERIOD_MAX                 (0x1F80)
#define TIMER1_IN1_STAMP_TYPE                 (0x2000)
#define TIMER1_GPIO2_CONF                     (0x3C000)
#define TIMER1_IN2_EVENT_FALL_EN              (0x40000)
#define TIMER1_IN2_COUNT_EN                   (0x80000)
#define TIMER1_IN2_IRQ_EN                     (0x100000)
#define TIMER1_IN2_PERIOD_MAX                 (0x7E00000)
#define TIMER1_IN2_STAMP_TYPE                 (0x8000000)



#define TIMER1_STATUS_REG                    (0x50004008) /* Timer1 counter value */
#define TIMER1_STATUS_REG_RESET              (0x00000000)

/*=============================*/
struct __TIMER1_STATUS_REG
/*=============================*/
{
    volatile uint32_t BITFLD_TIMER1_TIMER_VALUE                : 11;
    volatile uint32_t BITFLD_TIMER1_TIMER_EVENT                : 1;
    volatile uint32_t BITFLD_TIMER1_IN1_EVENT                  : 1;
    volatile uint32_t BITFLD_TIMER1_IN2_EVENT                  : 1;
    volatile uint32_t BITFLD_TIMER1_IN1_OVRFLW                 : 1;
    volatile uint32_t BITFLD_TIMER1_IN2_OVRFLW                 : 1;
};
#define TIMER1_TIMER_VALUE                    (0x07FF)
#define TIMER1_TIMER_EVENT                    (0x0800)
#define TIMER1_IN1_EVENT                      (0x1000)
#define TIMER1_IN2_EVENT                      (0x2000)
#define TIMER1_IN1_OVRFLW                     (0x4000)
#define TIMER1_IN2_OVRFLW                     (0x8000)



#define TIMER1_CAPCNT1_VALUE_REG             (0x5000400C) /* Timer1 value for event on GPIO1 */
#define TIMER1_CAPCNT1_VALUE_REG_RESET       (0x00000000)

/*=============================*/
struct __TIMER1_CAPCNT1_VALUE_REG
/*=============================*/
{
    volatile uint32_t BITFLD_TIMER1_CAPCNT1_VALUE              : 11;
    volatile uint32_t BITFLD_TIMER1_CAPCNT1_RTC_HIGH           : 11;
};
