sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define DMASA                                 (0x0001)



#define UART_DLF_REG                         (0x500010C0) /* Divisor Latch Fraction Register */
#define UART_DLF_REG_RESET                   (0x00000000)

/*=============================*/
struct __UART_DLF_REG
/*=============================*/
{
    volatile uint16_t BITFLD_UART_DLF                          : 4;
};
#define UART_DLF                              (0x000F)



#define UART_UCV_REG                         (0x500010F8) /* Component Version */
#define UART_UCV_REG_RESET                   (0x0000352A)

/*=============================*/
struct __UART_UCV_REG
/*=============================*/
{
    volatile uint16_t BITFLD_UCV                               : 16;
};
#define UCV                                   (0xFFFF)



#define UART_UCV_HIGH_REG                    (0x500010FA) /* Component Version */
#define UART_UCV_HIGH_REG_RESET              (0x00003331)

/*=============================*/
struct __UART_UCV_HIGH_REG
/*=============================*/
{
    volatile uint16_t BITFLD_UCV                               : 16;
};
#define UCV                                   (0xFFFF)



#define UART_CTR_REG                         (0x500010FC) /* Component Type Register */
#define UART_CTR_REG_RESET                   (0x00000110)

/*=============================*/
struct __UART_CTR_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CTR                               : 16;
};
#define CTR                                   (0xFFFF)



#define UART_CTR_HIGH_REG                    (0x500010FE) /* Component Type Register */
#define UART_CTR_HIGH_REG_RESET              (0x00004457)

/*=============================*/
struct __UART_CTR_HIGH_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CTR                               : 16;
};
#define CTR                                   (0xFFFF)



#define UART2_RBR_THR_DLL_REG                (0x50001100) /* Receive Buffer Register/Transmit Holding Register/Divisor Latch Low */
#define UART2_RBR_THR_DLL_REG_RESET          (0x00000000)

/*=============================*/
struct __UART2_RBR_THR_DLL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RBR_THR_DLL                       : 8;
};
#define RBR_THR_DLL                           (0x00FF)



#define UART2_IER_DLH_REG                    (0x50001104) /* Interrupt Enable Register/Divisor Latch High */
#define UART2_IER_DLH_REG_RESET              (0x00000000)

/*=============================*/
struct __UART2_IER_DLH_REG
/*=============================*/
{
    volatile uint16_t BITFLD_ERBFI_dlh0                        : 1;
    volatile uint16_t BITFLD_ETBEI_dlh1                        : 1;
    volatile uint16_t BITFLD_ELSI_dhl2                         : 1;
    volatile uint16_t BITFLD_EDSSI_dlh3                        : 1;
    volatile uint16_t BITFLD_dlh6_4                            : 3;
    volatile uint16_t BITFLD_PTIME_dlh7                        : 1;
};
#define ERBFI_dlh0                            (0x0001)
#define ETBEI_dlh1                            (0x0002)
#define ELSI_dhl2                             (0x0004)
#define EDSSI_dlh3                            (0x0008)
#define dlh6_4                                (0x0070)
#define PTIME_dlh7                            (0x0080)



#define UART2_IIR_FCR_REG                    (0x50001108) /* Interrupt Identification Register/FIFO Control Register */
#define UART2_IIR_FCR_REG_RESET              (0x00000001)

/*=============================*/
struct __UART2_IIR_FCR_REG
/*=============================*/
{
    volatile uint16_t BITFLD_UART_IID0_FIFOE                   : 1;
    volatile uint16_t BITFLD_UART_IID1_RFIFOE                  : 1;
    volatile uint16_t BITFLD_UART_IID2_XFIFOR                  : 1;
    volatile uint16_t BITFLD_UART_IID3_DMAM                    : 1;
    volatile uint16_t BITFLD_UART_TET                          : 2;
    volatile uint16_t BITFLD_UART_FIFOSE_RT                    : 2;
};
#define UART_IID0_FIFOE                       (0x0001)
#define UART_IID1_RFIFOE                      (0x0002)
#define UART_IID2_XFIFOR                      (0x0004)
#define UART_IID3_DMAM                        (0x0008)
#define UART_TET                              (0x0030)
#define UART_FIFOSE_RT                        (0x00C0)



#define UART2_LCR_REG                        (0x5000110C) /* Line Control Register */
#define UART2_LCR_REG_RESET                  (0x00000000)

/*=============================*/
struct __UART2_LCR_REG
/*=============================*/
{
    volatile uint16_t BITFLD_UART_DLS                          : 2;
    volatile uint16_t BITFLD_UART_STOP                         : 1;
    volatile uint16_t BITFLD_UART_PEN                          : 1;
    volatile uint16_t BITFLD_UART_EPS                          : 1;
             uint16_t                                          : 1;
    volatile uint16_t BITFLD_UART_BC                           : 1;
    volatile uint16_t BITFLD_UART_DLAB                         : 1;
};
#define UART_DLS                              (0x0003)
#define UART_STOP                             (0x0004)
#define UART_PEN                              (0x0008)
#define UART_EPS                              (0x0010)
#define UART_BC                               (0x0040)
#define UART_DLAB                             (0x0080)



#define UART2_MCR_REG                        (0x50001110) /* Modem Control Register */
#define UART2_MCR_REG_RESET                  (0x00000000)

/*=============================*/
struct __UART2_MCR_REG
/*=============================*/
{
             uint16_t                                          : 4;
    volatile uint16_t BITFLD_UART_LB                           : 1;
};
#define UART_LB                               (0x0010)



#define UART2_LSR_REG                        (0x50001114) /* Line Status Register */
#define UART2_LSR_REG_RESET                  (0x00000060)

/*=============================*/
struct __UART2_LSR_REG
/*=============================*/
{
    volatile uint16_t BITFLD_UART_DR                           : 1;
    volatile uint16_t BITFLD_UART_OE                           : 1;
    volatile uint16_t BITFLD_UART_PE                           : 1;
    volatile uint16_t BITFLD_UART_FE                           : 1;
    volatile uint16_t BITFLD_UART_BI                           : 1;
    volatile uint16_t BITFLD_UART_THRE                         : 1;
    volatile uint16_t BITFLD_UART_TEMT                         : 1;
    volatile uint16_t BITFLD_UART_RFE                          : 1;
};
