sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define UCV                                   (0xFFFF)



#define UART2_UCV_HIGH_REG                   (0x500011FA) /* Component Version */
#define UART2_UCV_HIGH_REG_RESET             (0x00003331)

/*=============================*/
struct __UART2_UCV_HIGH_REG
/*=============================*/
{
    volatile uint16_t BITFLD_UCV                               : 16;
};
#define UCV                                   (0xFFFF)



#define UART2_CTR_REG                        (0x500011FC) /* Component Type Register */
#define UART2_CTR_REG_RESET                  (0x00000110)

/*=============================*/
struct __UART2_CTR_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CTR                               : 16;
};
#define CTR                                   (0xFFFF)



#define UART2_CTR_HIGH_REG                   (0x500011FE) /* Component Type Register */
#define UART2_CTR_HIGH_REG_RESET             (0x00004457)

/*=============================*/
struct __UART2_CTR_HIGH_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CTR                               : 16;
};
#define CTR                                   (0xFFFF)



/*===========================================================================*/
/* memory map WDOG */
/*===========================================================================*/



#define WATCHDOG_REG                         (0x50003100) /* Watchdog timer register. */
#define WATCHDOG_REG_RESET                   (0x000000FF)

/*=============================*/
struct __WATCHDOG_REG
/*=============================*/
{
    volatile uint16_t BITFLD_WDOG_VAL                          : 8;
    volatile uint16_t BITFLD_WDOG_VAL_NEG                      : 1;
    volatile uint16_t BITFLD_WDOG_WEN                          : 7;
};
#define WDOG_VAL                              (0x00FF)
#define WDOG_VAL_NEG                          (0x0100)
#define WDOG_WEN                              (0xFE00)



#define WATCHDOG_CTRL_REG                    (0x50003102) /* Watchdog control register. */
#define WATCHDOG_CTRL_REG_RESET              (0x00000000)

/*=============================*/
struct __WATCHDOG_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_NMI_RST                           : 1;
             uint16_t                                          : 1;
};
#define NMI_RST                               (0x0001)



/*===========================================================================*/
/* memory map WKUP */
/*===========================================================================*/



#define WKUP_CTRL_REG                        (0x50000100) /* Control register for the wakeup counter */
#define WKUP_CTRL_REG_RESET                  (0x00000000)

/*=============================*/
struct __WKUP_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_WKUP_DEB_VALUE                    : 6;
    volatile uint16_t BITFLD_WKUP_SFT_KEYHIT                   : 1;
    volatile uint16_t BITFLD_WKUP_ENABLE_IRQ                   : 1;
    volatile uint16_t BITFLD_WKUP2_ENABLE_IRQ                  : 1;
    volatile uint16_t BITFLD_ENABLE_125US_CLK                  : 1;
};
#define WKUP_DEB_VALUE                        (0x003F)
#define WKUP_SFT_KEYHIT                       (0x0040)
#define WKUP_ENABLE_IRQ                       (0x0080)
#define WKUP2_ENABLE_IRQ                      (0x0100)
#define ENABLE_125US_CLK                      (0x0200)



#define WKUP_COMPARE_REG                     (0x50000102) /* Number of events before wakeup interrupt */
#define WKUP_COMPARE_REG_RESET               (0x00000000)

/*=============================*/
struct __WKUP_COMPARE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_WKUP_COMPARE                      : 8;
};
#define WKUP_COMPARE                          (0x00FF)



#define WKUP_IRQ_STATUS_REG                  (0x50000104) /* Reset wakeup interrupt */
#define WKUP_IRQ_STATUS_REG_RESET            (0x00000000)

/*=============================*/
struct __WKUP_IRQ_STATUS_REG
/*=============================*/
{
    volatile uint16_t BITFLD_WKUP_IRQ_STATUS                   : 1;
    volatile uint16_t BITFLD_WKUP2_IRQ_STATUS                  : 1;
    volatile uint16_t BITFLD_WKUP_CNTR_RST                     : 1;
    volatile uint16_t BITFLD_WKUP2_CNTR_RST                    : 1;
};
#define WKUP_IRQ_STATUS                       (0x0001)
#define WKUP2_IRQ_STATUS                      (0x0002)
#define WKUP_CNTR_RST                         (0x0004)
#define WKUP2_CNTR_RST                        (0x0008)



#define WKUP_COUNTER_REG                     (0x50000106) /* Actual number of events of the wakeup counter */
#define WKUP_COUNTER_REG_RESET               (0x00000000)

/*=============================*/
struct __WKUP_COUNTER_REG
/*=============================*/
{
    volatile uint16_t BITFLD_EVENT_VALUE                       : 8;
    volatile uint16_t BITFLD_EVENT2_VALUE                      : 8;
};
#define EVENT_VALUE                           (0x00FF)
#define EVENT2_VALUE                          (0xFF00)



#define WKUP_SELECT_GPIO_REG                 (0x50000108) /* Select which inputs from P0 port can trigger wkup counter */
#define WKUP_SELECT_GPIO_REG_RESET           (0x00000000)

/*=============================*/
struct __WKUP_SELECT_GPIO_REG
/*=============================*/
{
    volatile uint16_t BITFLD_WKUP_SELECT_GPIO                  : 12;
};
#define WKUP_SELECT_GPIO                      (0x0FFF)



#define WKUP2_SELECT_GPIO_REG                (0x5000010A) /* Select which inputs from P1 port can trigger wkup counter */
#define WKUP2_SELECT_GPIO_REG_RESET          (0x00000000)

/*=============================*/
struct __WKUP2_SELECT_GPIO_REG
/*=============================*/
{
    volatile uint16_t BITFLD_WKUP2_SELECT_GPIO                 : 12;
};
#define WKUP2_SELECT_GPIO                     (0x0FFF)



