sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define WKUP_POL_GPIO_REG                    (0x5000010C) /* Select the sensitivity polarity for each P0 input */
#define WKUP_POL_GPIO_REG_RESET              (0x00000000)

/*=============================*/
struct __WKUP_POL_GPIO_REG
/*=============================*/
{
    volatile uint16_t BITFLD_WKUP_POL_GPIO                     : 12;
};
#define WKUP_POL_GPIO                         (0x0FFF)



#define WKUP2_POL_GPIO_REG                   (0x5000010E) /* Select the sensitivity polarity for each P1 input */
#define WKUP2_POL_GPIO_REG_RESET             (0x00000000)

/*=============================*/
struct __WKUP2_POL_GPIO_REG
/*=============================*/
{
    volatile uint16_t BITFLD_WKUP2_POL_GPIO                    : 12;
};
#define WKUP2_POL_GPIO                        (0x0FFF)



/*===========================================================================*/
/* Test mode spec map */
/*===========================================================================*/



#define OTPC_TEST_REG                        (0x07F40024)
#define OTPC_TEST_REG_RESET                  (0x00000000)

/*=============================*/
struct __OTPC_TEST_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_TEST_MODE                    : 2;
    volatile uint32_t BITFLD_OTPC_TEST_ECC_EN_DE               : 1;
             uint32_t                                          : 5;
    volatile uint32_t BITFLD_OTPC_TEST_ECC_IN                  : 6;
             uint32_t                                          : 2;
    volatile uint32_t BITFLD_OTPC_TEST_ECC_OUT                 : 6;
             uint32_t                                          : 2;
    volatile uint32_t BITFLD_OTPC_TEST_ECC_ERR                 : 1;
};
#define OTPC_TEST_MODE                        (0x0003)
#define OTPC_TEST_ECC_EN_DE                   (0x0004)
#define OTPC_TEST_ECC_IN                      (0x3F00)
#define OTPC_TEST_ECC_OUT                     (0x3F0000)
#define OTPC_TEST_ECC_ERR                     (0x1000000)



#define RF_ATTR_REG                          (0x40001000)
#define RF_ATTR_REG_RESET                    (0x0C000820)

/*=============================*/
struct __RF_ATTR_REG
/*=============================*/
{
             uint32_t                                          : 3;
    volatile uint32_t BITFLD_IFF_POLARITY                      : 1;
             uint32_t                                          : 1;
             uint32_t                                          : 1;
             uint32_t                                          : 2;
    volatile uint32_t BITFLD_RF_BIAS                           : 4;
    volatile uint32_t BITFLD_TIA_BIAS                          : 1;
             uint32_t                                          : 11;
    volatile uint32_t BITFLD_PA_POWER_SETTING                  : 4;
};
#define IFF_POLARITY                          (0x0008)
#define RF_BIAS                               (0x0F00)
#define TIA_BIAS                              (0x1000)
#define PA_POWER_SETTING                      (0xF000000)



#define RF_RADIO_INIT_REG                    (0x40001004)
#define RF_RADIO_INIT_REG_RESET              (0x00000000)

/*=============================*/
struct __RF_RADIO_INIT_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RADIO_LDO_EN                      : 1;
    volatile uint32_t BITFLD_RADIO_LDO_EN_SEL                  : 1;
    volatile uint32_t BITFLD_RADIO_LDO_EN_WR                   : 1;
    volatile uint32_t BITFLD_ADPLLDIG_PWR_SW1_EN               : 1;
    volatile uint32_t BITFLD_ADPLLDIG_LDO_EN_SEL               : 1;
    volatile uint32_t BITFLD_ADPLLDIG_LDO_EN_WR                : 1;
             uint32_t                                          : 2;
    volatile uint32_t BITFLD_ADPLLDIG_HRESET_N                 : 1;
    volatile uint32_t BITFLD_ADPLLDIG_HCLK_EN                  : 1;
             uint32_t                                          : 6;
    volatile uint32_t BITFLD_RADIO_REGS_RDY                    : 1;
    volatile uint32_t BITFLD_ADPLLDIG_HCLK_DIS                 : 1;
             uint32_t                                          : 6;
    volatile uint32_t BITFLD_RADIO_INIT_AUTOCLEAR              : 1;
};
#define RADIO_LDO_EN                          (0x0001)
#define RADIO_LDO_EN_SEL                      (0x0002)
#define RADIO_LDO_EN_WR                       (0x0004)
#define ADPLLDIG_PWR_SW1_EN                   (0x0008)
#define ADPLLDIG_LDO_EN_SEL                   (0x0010)
#define ADPLLDIG_LDO_EN_WR                    (0x0020)
#define ADPLLDIG_HRESET_N                     (0x0100)
#define ADPLLDIG_HCLK_EN                      (0x0200)
#define RADIO_REGS_RDY                        (0x10000)
#define ADPLLDIG_HCLK_DIS                     (0x20000)
#define RADIO_INIT_AUTOCLEAR                  (0x1000000)



#define RF_LDO_STATUS_REG                    (0x40001008)
#define RF_LDO_STATUS_REG_RESET              (0x00000000)

/*=============================*/
struct __RF_LDO_STATUS_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RADIO_LDO_EN_RD                   : 1;
    volatile uint32_t BITFLD_RADIO_LDO_ZERO_EN_RD              : 1;
    volatile uint32_t BITFLD_ADPLLDIG_LDO_EN_RD                : 1;
    volatile uint32_t BITFLD_ADPLLDIG_LDO_ZERO_EN_RD           : 1;
    volatile uint32_t BITFLD_ldo_dco_en_rd                     : 1;
    volatile uint32_t BITFLD_ldo_dtc_en_rd                     : 1;
    volatile uint32_t BITFLD_ldo_radio_vref_hold_rd            : 1;
    volatile uint32_t BITFLD_ldo_dco_vref_hold_rd              : 1;
    volatile uint32_t BITFLD_ldo_dtc_vref_hold_rd              : 1;
};
#define RADIO_LDO_EN_RD                       (0x0001)
#define RADIO_LDO_ZERO_EN_RD                  (0x0002)
#define ADPLLDIG_LDO_EN_RD                    (0x0004)
#define ADPLLDIG_LDO_ZERO_EN_RD               (0x0008)
#define ldo_dco_en_rd                         (0x0010)
#define ldo_dtc_en_rd                         (0x0020)
#define ldo_radio_vref_hold_rd                (0x0040)
#define ldo_dco_vref_hold_rd                  (0x0080)
#define ldo_dtc_vref_hold_rd                  (0x0100)



