sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define RF_ADPLLDIG_CTRL_REG                 (0x4000100C)
#define RF_ADPLLDIG_CTRL_REG_RESET           (0x00000010)

/*=============================*/
struct __RF_ADPLLDIG_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OPENLOOP_RDY_SEL                  : 1;
    volatile uint32_t BITFLD_OPENLOOP_RDY_WR                   : 1;
             uint32_t                                          : 2;
    volatile uint32_t BITFLD_PWR_SW_TIM_CTRL                   : 3;
};
#define OPENLOOP_RDY_SEL                      (0x0001)
#define OPENLOOP_RDY_WR                       (0x0002)
#define PWR_SW_TIM_CTRL                       (0x0070)



#define RF_AGC_EXT_LUT_REG                   (0x40001010)
#define RF_AGC_EXT_LUT_REG_RESET             (0x00000000)

/*=============================*/
struct __RF_AGC_EXT_LUT_REG
/*=============================*/
{
    volatile uint32_t BITFLD_AGC_EXT_LUT                       : 10;
};
#define AGC_EXT_LUT                           (0x03FF)



#define RF_CALSTATE_REG                      (0x40001014)
#define RF_CALSTATE_REG_RESET                (0x00000000)

/*=============================*/
struct __RF_CALSTATE_REG
/*=============================*/
{
    volatile uint32_t BITFLD_CALSTATE                          : 4;
};
#define CALSTATE                              (0x000F)



#define RF_SCAN_FEEDBACK_REG                 (0x40001018)
#define RF_SCAN_FEEDBACK_REG_RESET           (0x00000000)
//register RF_SCAN_FEEDBACK_REG found for which all fields are reserved, omitting.



#define RF_CAL_CTRL_REG                      (0x40001020)
#define RF_CAL_CTRL_REG_RESET                (0x00000000)

/*=============================*/
struct __RF_CAL_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SO_CAL                            : 1;
    volatile uint32_t BITFLD_EO_CAL                            : 1;
    volatile uint32_t BITFLD_RF_CAL_CTRL_SPARE                 : 1;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_DC_OFFSET_CAL_DIS                 : 1;
};
#define SO_CAL                                (0x0001)
#define EO_CAL                                (0x0002)
#define RF_CAL_CTRL_SPARE                     (0x0004)
#define DC_OFFSET_CAL_DIS                     (0x0010)



#define RF_IRQ_CTRL_REG                      (0x40001024)
#define RF_IRQ_CTRL_REG_RESET                (0x00000001)

/*=============================*/
struct __RF_IRQ_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_EO_CAL_CLEAR                      : 1;
};
#define EO_CAL_CLEAR                          (0x0001)



#define RF_ADCI_DC_OFFSET_REG                (0x40001028)
#define RF_ADCI_DC_OFFSET_REG_RESET          (0x00020100)

/*=============================*/
struct __RF_ADCI_DC_OFFSET_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADC_OFFP_I_RD                     : 9;
    volatile uint32_t BITFLD_ADC_OFFN_I_RD                     : 9;
};
#define ADC_OFFP_I_RD                         (0x01FF)
#define ADC_OFFN_I_RD                         (0x3FE00)



#define RF_ADCQ_DC_OFFSET_REG                (0x4000102C)
#define RF_ADCQ_DC_OFFSET_REG_RESET          (0x00020100)

/*=============================*/
struct __RF_ADCQ_DC_OFFSET_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADC_OFFP_Q_RD                     : 9;
    volatile uint32_t BITFLD_ADC_OFFN_Q_RD                     : 9;
};
#define ADC_OFFP_Q_RD                         (0x01FF)
#define ADC_OFFN_Q_RD                         (0x3FE00)



#define RF_SPARE_REG                         (0x40001030)
#define RF_SPARE_REG_RESET                   (0x00000000)

/*=============================*/
struct __RF_SPARE_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RF_SPARE_BITS                     : 16;
    volatile uint32_t BITFLD_RF_SPARE_BITS_HV                  : 8;
    volatile uint32_t BITFLD_RF_SPARE_IN                       : 4;
    volatile uint32_t BITFLD_RF_SPARE_IN_EN                    : 1;
};
#define RF_SPARE_BITS                         (0xFFFF)
#define RF_SPARE_BITS_HV                      (0xFF0000)
#define RF_SPARE_IN                           (0xF000000)
#define RF_SPARE_IN_EN                        (0x10000000)



#define RF_IFF_CTRL_REG                      (0x4000103C)
#define RF_IFF_CTRL_REG_RESET                (0x00000001)

/*=============================*/
struct __RF_IFF_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_IF_CAL_TRIM                       : 2;
             uint32_t                                          : 2;
    volatile uint32_t BITFLD_IF_MUTE                           : 1;
    volatile uint32_t BITFLD_IFF_DCOC_DAC_DIS                  : 1;
    volatile uint32_t BITFLD_RF_IFF_CTRL_SPARE                 : 6;
    volatile uint32_t BITFLD_IFF_COMPLEX_DIS                   : 1;
    volatile uint32_t BITFLD_IFF_DCOC_DAC_REFCUR_CTRL          : 2;
};
#define IF_CAL_TRIM                           (0x0003)
#define IF_MUTE                               (0x0010)
#define IFF_DCOC_DAC_DIS                      (0x0020)
#define RF_IFF_CTRL_SPARE                     (0x0FC0)
#define IFF_COMPLEX_DIS                       (0x1000)
#define IFF_DCOC_DAC_REFCUR_CTRL              (0x6000)



#define RF_ADC_CTRL1_REG                     (0x40001040)
#define RF_ADC_CTRL1_REG_RESET               (0x00000000)

/*=============================*/
struct __RF_ADC_CTRL1_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADC_DC_OFFSET_SEL                 : 1;
             uint32_t                                          : 12;
    volatile uint32_t BITFLD_ADC_MUTE                          : 1;
    volatile uint32_t BITFLD_ADC_SIGN                          : 1;
};
#define ADC_DC_OFFSET_SEL                     (0x0001)
#define ADC_MUTE                              (0x2000)
#define ADC_SIGN                              (0x4000)



#define RF_ADC_CTRL2_REG                     (0x40001044)
#define RF_ADC_CTRL2_REG_RESET               (0x00000000)

/*=============================*/
struct __RF_ADC_CTRL2_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADC_OFFP_I_WR                     : 9;
    volatile uint32_t BITFLD_ADC_OFFN_I_WR                     : 9;
};
#define ADC_OFFP_I_WR                         (0x01FF)
#define ADC_OFFN_I_WR                         (0x3FE00)



#define RF_ADC_CTRL3_REG                     (0x40001048)
#define RF_ADC_CTRL3_REG_RESET               (0x00000000)

/*=============================*/
struct __RF_ADC_CTRL3_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADC_OFFP_Q_WR                     : 9;
    volatile uint32_t BITFLD_ADC_OFFN_Q_WR                     : 9;
};
#define ADC_OFFP_Q_WR                         (0x01FF)
#define ADC_OFFN_Q_WR                         (0x3FE00)



#define RF_PA_CTRL_REG                       (0x4000104C)
#define RF_PA_CTRL_REG_RESET                 (0x00000300)

/*=============================*/
struct __RF_PA_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_TRIM_DUTY_POS                     : 3;
    volatile uint32_t BITFLD_TRIM_DUTY_NEG                     : 3;
             uint32_t                                          : 2;
    volatile uint32_t BITFLD_PA_RAMP_STEP_SPEED                : 2;
};
#define TRIM_DUTY_POS                         (0x0007)
#define TRIM_DUTY_NEG                         (0x0038)
#define PA_RAMP_STEP_SPEED                    (0x0300)



