sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define ADPLLDIG_SYNC_CLK_INV                 (0x0001)
#define ADPLLDIG_RFMON_MUX_SEL                (0x000E)
#define ADPLLDIG_RFMON_SPARE                  (0x00F0)



#define RF_RDP_CTRL_REG                      (0x400010A4)
#define RF_RDP_CTRL_REG_RESET                (0x00000000)

/*=============================*/
struct __RF_RDP_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RDP_RFCU_SEL                      : 1;
    volatile uint32_t BITFLD_RDP_MOD_SEL1                      : 1;
    volatile uint32_t BITFLD_RDP_MOD_SEL2                      : 2;
    volatile uint32_t BITFLD_RDP_MOD_RATE                      : 2;
};
#define RDP_RFCU_SEL                          (0x0001)
#define RDP_MOD_SEL1                          (0x0002)
#define RDP_MOD_SEL2                          (0x000C)
#define RDP_MOD_RATE                          (0x0030)



#define RF_RFCU_CTRL_REG                     (0x400010A8)
#define RF_RFCU_CTRL_REG_RESET               (0x00000001)

/*=============================*/
struct __RF_RFCU_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RF_RFCU_CLK_DIV                   : 1;
};
#define RF_RFCU_CLK_DIV                       (0x0001)



#define RF_OVERRULE_REG                      (0x400010AC)
#define RF_OVERRULE_REG_RESET                (0x00000000)

/*=============================*/
struct __RF_OVERRULE_REG
/*=============================*/
{
    volatile uint32_t BITFLD_TX_EN_OVR                         : 2;
    volatile uint32_t BITFLD_RX_EN_OVR                         : 2;
};
#define TX_EN_OVR                             (0x0003)
#define RX_EN_OVR                             (0x000C)



#define RF_DIAGIRQ_CTRL_REG                  (0x400010B0)
#define RF_DIAGIRQ_CTRL_REG_RESET            (0x00000000)

/*=============================*/
struct __RF_DIAGIRQ_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DIAG_BUS0_IRQ_MASK                : 1;
    volatile uint32_t BITFLD_DIAG_BUS0_SEL                     : 2;
    volatile uint32_t BITFLD_DIAG_BUS0_BIT_SEL                 : 3;
    volatile uint32_t BITFLD_DIAG_BUS0_EDGE_SEL                : 1;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_DIAG_BUS1_IRQ_MASK                : 1;
    volatile uint32_t BITFLD_DIAG_BUS1_SEL                     : 2;
    volatile uint32_t BITFLD_DIAG_BUS1_BIT_SEL                 : 3;
    volatile uint32_t BITFLD_DIAG_BUS1_EDGE_SEL                : 1;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_DIAG_BUS2_IRQ_MASK                : 1;
    volatile uint32_t BITFLD_DIAG_BUS2_SEL                     : 2;
    volatile uint32_t BITFLD_DIAG_BUS2_BIT_SEL                 : 3;
    volatile uint32_t BITFLD_DIAG_BUS2_EDGE_SEL                : 1;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_DIAG_BUS3_IRQ_MASK                : 1;
    volatile uint32_t BITFLD_DIAG_BUS3_SEL                     : 2;
    volatile uint32_t BITFLD_DIAG_BUS3_BIT_SEL                 : 3;
    volatile uint32_t BITFLD_DIAG_BUS3_EDGE_SEL                : 1;
};
#define DIAG_BUS0_IRQ_MASK                    (0x0001)
#define DIAG_BUS0_SEL                         (0x0006)
#define DIAG_BUS0_BIT_SEL                     (0x0038)
#define DIAG_BUS0_EDGE_SEL                    (0x0040)
#define DIAG_BUS1_IRQ_MASK                    (0x0100)
#define DIAG_BUS1_SEL                         (0x0600)
#define DIAG_BUS1_BIT_SEL                     (0x3800)
#define DIAG_BUS1_EDGE_SEL                    (0x4000)
#define DIAG_BUS2_IRQ_MASK                    (0x10000)
#define DIAG_BUS2_SEL                         (0x60000)
#define DIAG_BUS2_BIT_SEL                     (0x380000)
#define DIAG_BUS2_EDGE_SEL                    (0x400000)
#define DIAG_BUS3_IRQ_MASK                    (0x1000000)
#define DIAG_BUS3_SEL                         (0x6000000)
#define DIAG_BUS3_BIT_SEL                     (0x38000000)
#define DIAG_BUS3_EDGE_SEL                    (0x40000000)



#define RF_DIAGIRQ_STAT_REG                  (0x400010B4)
#define RF_DIAGIRQ_STAT_REG_RESET            (0x00000000)

/*=============================*/
struct __RF_DIAGIRQ_STAT_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DIAGIRQ_STAT                      : 4;
};
#define DIAGIRQ_STAT                          (0x000F)



#define RF_LDO_CTRL_REG                      (0x400010B8)
#define RF_LDO_CTRL_REG_RESET                (0x00190777)

/*=============================*/
struct __RF_LDO_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_LDO_RADIO_LEVEL                   : 3;
    volatile uint32_t BITFLD_LDO_RADIO_CONT_ENABLE             : 1;
    volatile uint32_t BITFLD_LDO_DTC_LEVEL                     : 3;
    volatile uint32_t BITFLD_LDO_DTC_CONT_ENABLE               : 1;
    volatile uint32_t BITFLD_LDO_DCO_LEVEL                     : 3;
    volatile uint32_t BITFLD_LDO_DCO_CONT_ENABLE               : 1;
             uint32_t                                          : 4;
    volatile uint32_t BITFLD_LDO_VREF_SMPL_TIME                : 5;
             uint32_t                                          : 3;
    volatile uint32_t BITFLD_LDO_RADIO_HOLD_OVR_VAL            : 1;
    volatile uint32_t BITFLD_LDO_RADIO_HOLD_OVR_EN             : 1;
    volatile uint32_t BITFLD_LDO_DTC_HOLD_OVR_VAL              : 1;
    volatile uint32_t BITFLD_LDO_DTC_HOLD_OVR_EN               : 1;
    volatile uint32_t BITFLD_LDO_DCO_HOLD_OVR_VAL              : 1;
    volatile uint32_t BITFLD_LDO_DCO_HOLD_OVR_EN               : 1;
};
#define LDO_RADIO_LEVEL                       (0x0007)
#define LDO_RADIO_CONT_ENABLE                 (0x0008)
#define LDO_DTC_LEVEL                         (0x0070)
#define LDO_DTC_CONT_ENABLE                   (0x0080)
#define LDO_DCO_LEVEL                         (0x0700)
#define LDO_DCO_CONT_ENABLE                   (0x0800)
#define LDO_VREF_SMPL_TIME                    (0x1F0000)
#define LDO_RADIO_HOLD_OVR_VAL                (0x1000000)
#define LDO_RADIO_HOLD_OVR_EN                 (0x2000000)
#define LDO_DTC_HOLD_OVR_VAL                  (0x4000000)
#define LDO_DTC_HOLD_OVR_EN                   (0x8000000)
#define LDO_DCO_HOLD_OVR_VAL                  (0x10000000)
#define LDO_DCO_HOLD_OVR_EN                   (0x20000000)



#define RF_ENABLE_CONFIG0_REG                (0x40001200)
#define RF_ENABLE_CONFIG0_REG_RESET          (0x00000083)

/*=============================*/
struct __RF_ENABLE_CONFIG0_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RFIO_LDO_EN_DCF_RX                : 5;
    volatile uint32_t BITFLD_RFIO_LDO_EN_DCF_TX                : 5;
};
#define RFIO_LDO_EN_DCF_RX                    (0x001F)
#define RFIO_LDO_EN_DCF_TX                    (0x03E0)



