sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define RF_ENABLE_CONFIG1_REG                (0x40001204)
#define RF_ENABLE_CONFIG1_REG_RESET          (0x00000083)

/*=============================*/
struct __RF_ENABLE_CONFIG1_REG
/*=============================*/
{
    volatile uint32_t BITFLD_PA_LDO_EN_DCF_RX                  : 5;
    volatile uint32_t BITFLD_PA_LDO_EN_DCF_TX                  : 5;
};
#define PA_LDO_EN_DCF_RX                      (0x001F)
#define PA_LDO_EN_DCF_TX                      (0x03E0)



#define RF_ENABLE_CONFIG2_REG                (0x40001208)
#define RF_ENABLE_CONFIG2_REG_RESET          (0x00000003)

/*=============================*/
struct __RF_ENABLE_CONFIG2_REG
/*=============================*/
{
    volatile uint32_t BITFLD_LNA_LDO_EN_DCF_RX                 : 5;
    volatile uint32_t BITFLD_LNA_LDO_EN_DCF_TX                 : 5;
};
#define LNA_LDO_EN_DCF_RX                     (0x001F)
#define LNA_LDO_EN_DCF_TX                     (0x03E0)



#define RF_ENABLE_CONFIG3_REG                (0x4000120C)
#define RF_ENABLE_CONFIG3_REG_RESET          (0x00000003)

/*=============================*/
struct __RF_ENABLE_CONFIG3_REG
/*=============================*/
{
    volatile uint32_t BITFLD_MIX_LDO_EN_DCF_RX                 : 5;
    volatile uint32_t BITFLD_MIX_LDO_EN_DCF_TX                 : 5;
};
#define MIX_LDO_EN_DCF_RX                     (0x001F)
#define MIX_LDO_EN_DCF_TX                     (0x03E0)



#define RF_ENABLE_CONFIG4_REG                (0x40001210)
#define RF_ENABLE_CONFIG4_REG_RESET          (0x00000003)

/*=============================*/
struct __RF_ENABLE_CONFIG4_REG
/*=============================*/
{
    volatile uint32_t BITFLD_IFF_LDO_EN_DCF_RX                 : 5;
    volatile uint32_t BITFLD_IFF_LDO_EN_DCF_TX                 : 5;
};
#define IFF_LDO_EN_DCF_RX                     (0x001F)
#define IFF_LDO_EN_DCF_TX                     (0x03E0)



#define RF_ENABLE_CONFIG5_REG                (0x40001214)
#define RF_ENABLE_CONFIG5_REG_RESET          (0x00000003)

/*=============================*/
struct __RF_ENABLE_CONFIG5_REG
/*=============================*/
{
    volatile uint32_t BITFLD_IFFADC_LDO_EN_DCF_RX              : 5;
    volatile uint32_t BITFLD_IFFADC_LDO_EN_DCF_TX              : 5;
};
#define IFFADC_LDO_EN_DCF_RX                  (0x001F)
#define IFFADC_LDO_EN_DCF_TX                  (0x03E0)



#define RF_ENABLE_CONFIG6_REG                (0x40001218)
#define RF_ENABLE_CONFIG6_REG_RESET          (0x00000083)

/*=============================*/
struct __RF_ENABLE_CONFIG6_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADPLL_TDC_LDO_EN_DCF_RX           : 5;
    volatile uint32_t BITFLD_ADPLL_TDC_LDO_EN_DCF_TX           : 5;
};
#define ADPLL_TDC_LDO_EN_DCF_RX               (0x001F)
#define ADPLL_TDC_LDO_EN_DCF_TX               (0x03E0)



#define RF_ENABLE_CONFIG7_REG                (0x4000121C)
#define RF_ENABLE_CONFIG7_REG_RESET          (0x00000083)

/*=============================*/
struct __RF_ENABLE_CONFIG7_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADPLL_DTC_LDO_EN_DCF_RX           : 5;
    volatile uint32_t BITFLD_ADPLL_DTC_LDO_EN_DCF_TX           : 5;
};
#define ADPLL_DTC_LDO_EN_DCF_RX               (0x001F)
#define ADPLL_DTC_LDO_EN_DCF_TX               (0x03E0)



#define RF_ENABLE_CONFIG8_REG                (0x40001220)
#define RF_ENABLE_CONFIG8_REG_RESET          (0x00000083)

/*=============================*/
struct __RF_ENABLE_CONFIG8_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADPLL_DCO_LDO_EN_DCF_RX           : 5;
    volatile uint32_t BITFLD_ADPLL_DCO_LDO_EN_DCF_TX           : 5;
};
#define ADPLL_DCO_LDO_EN_DCF_RX               (0x001F)
#define ADPLL_DCO_LDO_EN_DCF_TX               (0x03E0)



#define RF_ENABLE_CONFIG9_REG                (0x40001224)
#define RF_ENABLE_CONFIG9_REG_RESET          (0x00000041)

/*=============================*/
struct __RF_ENABLE_CONFIG9_REG
/*=============================*/
{
    volatile uint32_t BITFLD_LDO_ZERO_EN_DCF_RX                : 5;
    volatile uint32_t BITFLD_LDO_ZERO_EN_DCF_TX                : 5;
};
#define LDO_ZERO_EN_DCF_RX                    (0x001F)
#define LDO_ZERO_EN_DCF_TX                    (0x03E0)



#define RF_ENABLE_CONFIG10_REG               (0x40001228)
#define RF_ENABLE_CONFIG10_REG_RESET         (0x00000001)

/*=============================*/
struct __RF_ENABLE_CONFIG10_REG
/*=============================*/
{
    volatile uint32_t BITFLD_LNA_LDO_ZERO_DCF_RX               : 5;
    volatile uint32_t BITFLD_LNA_LDO_ZERO_DCF_TX               : 5;
};
#define LNA_LDO_ZERO_DCF_RX                   (0x001F)
#define LNA_LDO_ZERO_DCF_TX                   (0x03E0)



#define RF_ENABLE_CONFIG11_REG               (0x4000122C)
#define RF_ENABLE_CONFIG11_REG_RESET         (0x000000C5)

/*=============================*/
struct __RF_ENABLE_CONFIG11_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADPLLDIG_LDO_ACTIVERDY_DCF_RX     : 5;
    volatile uint32_t BITFLD_ADPLLDIG_LDO_ACTIVERDY_DCF_TX     : 5;
};
#define ADPLLDIG_LDO_ACTIVERDY_DCF_RX         (0x001F)
#define ADPLLDIG_LDO_ACTIVERDY_DCF_TX         (0x03E0)



#define RF_ENABLE_CONFIG12_REG               (0x40001230)
#define RF_ENABLE_CONFIG12_REG_RESET         (0x0000018B)

/*=============================*/
struct __RF_ENABLE_CONFIG12_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADPLLDIG_LDO_LP_DCF_RX            : 5;
    volatile uint32_t BITFLD_ADPLLDIG_LDO_LP_DCF_TX            : 5;
};
#define ADPLLDIG_LDO_LP_DCF_RX                (0x001F)
#define ADPLLDIG_LDO_LP_DCF_TX                (0x03E0)



#define RF_ENABLE_CONFIG13_REG               (0x40001234)
#define RF_ENABLE_CONFIG13_REG_RESET         (0x0000000F)

/*=============================*/
struct __RF_ENABLE_CONFIG13_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RFIO_RX_EN_DCF_RX                 : 5;
    volatile uint32_t BITFLD_RFIO_RX_EN_DCF_TX                 : 5;
};
#define RFIO_RX_EN_DCF_RX                     (0x001F)
#define RFIO_RX_EN_DCF_TX                     (0x03E0)



