sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define RF_ENABLE_CONFIG14_REG               (0x40001238)
#define RF_ENABLE_CONFIG14_REG_RESET         (0x000001C0)

/*=============================*/
struct __RF_ENABLE_CONFIG14_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RFIO_TX_EN_DCF_RX                 : 5;
    volatile uint32_t BITFLD_RFIO_TX_EN_DCF_TX                 : 5;
};
#define RFIO_TX_EN_DCF_RX                     (0x001F)
#define RFIO_TX_EN_DCF_TX                     (0x03E0)



#define RF_ENABLE_CONFIG15_REG               (0x4000123C)
#define RF_ENABLE_CONFIG15_REG_RESET         (0x000001C0)

/*=============================*/
struct __RF_ENABLE_CONFIG15_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RFIO_TX_HARM_EN_DCF_RX            : 5;
    volatile uint32_t BITFLD_RFIO_TX_HARM_EN_DCF_TX            : 5;
};
#define RFIO_TX_HARM_EN_DCF_RX                (0x001F)
#define RFIO_TX_HARM_EN_DCF_TX                (0x03E0)



#define RF_ENABLE_CONFIG16_REG               (0x40001240)
#define RF_ENABLE_CONFIG16_REG_RESET         (0x0000008F)

/*=============================*/
struct __RF_ENABLE_CONFIG16_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RFIO_BIAS_EN_DCF_RX               : 5;
    volatile uint32_t BITFLD_RFIO_BIAS_EN_DCF_TX               : 5;
};
#define RFIO_BIAS_EN_DCF_RX                   (0x001F)
#define RFIO_BIAS_EN_DCF_TX                   (0x03E0)



#define RF_ENABLE_CONFIG17_REG               (0x40001244)
#define RF_ENABLE_CONFIG17_REG_RESET         (0x00000210)

/*=============================*/
struct __RF_ENABLE_CONFIG17_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RFIO_BIAS_SH_OPEN_DCF_RX          : 5;
    volatile uint32_t BITFLD_RFIO_BIAS_SH_OPEN_DCF_TX          : 5;
};
#define RFIO_BIAS_SH_OPEN_DCF_RX              (0x001F)
#define RFIO_BIAS_SH_OPEN_DCF_TX              (0x03E0)



#define RF_ENABLE_CONFIG18_REG               (0x40001248)
#define RF_ENABLE_CONFIG18_REG_RESET         (0x000001A0)

/*=============================*/
struct __RF_ENABLE_CONFIG18_REG
/*=============================*/
{
    volatile uint32_t BITFLD_PA_RAMP_EN_DCF_RX                 : 5;
    volatile uint32_t BITFLD_PA_RAMP_EN_DCF_TX                 : 5;
};
#define PA_RAMP_EN_DCF_RX                     (0x001F)
#define PA_RAMP_EN_DCF_TX                     (0x03E0)



#define RF_ENABLE_CONFIG19_REG               (0x4000124C)
#define RF_ENABLE_CONFIG19_REG_RESET         (0x000001C0)

/*=============================*/
struct __RF_ENABLE_CONFIG19_REG
/*=============================*/
{
    volatile uint32_t BITFLD_PA_EN_DCF_RX                      : 5;
    volatile uint32_t BITFLD_PA_EN_DCF_TX                      : 5;
};
#define PA_EN_DCF_RX                          (0x001F)
#define PA_EN_DCF_TX                          (0x03E0)



#define RF_ENABLE_CONFIG20_REG               (0x40001250)
#define RF_ENABLE_CONFIG20_REG_RESET         (0x0000000F)

/*=============================*/
struct __RF_ENABLE_CONFIG20_REG
/*=============================*/
{
    volatile uint32_t BITFLD_LNA_CORE_EN_DCF_RX                : 5;
    volatile uint32_t BITFLD_LNA_CORE_EN_DCF_TX                : 5;
};
#define LNA_CORE_EN_DCF_RX                    (0x001F)
#define LNA_CORE_EN_DCF_TX                    (0x03E0)



#define RF_ENABLE_CONFIG21_REG               (0x40001254)
#define RF_ENABLE_CONFIG21_REG_RESET         (0x0000000F)

/*=============================*/
struct __RF_ENABLE_CONFIG21_REG
/*=============================*/
{
    volatile uint32_t BITFLD_LNA_CGM_EN_DCF_RX                 : 5;
    volatile uint32_t BITFLD_LNA_CGM_EN_DCF_TX                 : 5;
};
#define LNA_CGM_EN_DCF_RX                     (0x001F)
#define LNA_CGM_EN_DCF_TX                     (0x03E0)



#define RF_ENABLE_CONFIG22_REG               (0x40001258)
#define RF_ENABLE_CONFIG22_REG_RESET         (0x0000000F)

/*=============================*/
struct __RF_ENABLE_CONFIG22_REG
/*=============================*/
{
    volatile uint32_t BITFLD_MIX_EN_DCF_RX                     : 5;
    volatile uint32_t BITFLD_MIX_EN_DCF_TX                     : 5;
};
#define MIX_EN_DCF_RX                         (0x001F)
#define MIX_EN_DCF_TX                         (0x03E0)



#define RF_ENABLE_CONFIG23_REG               (0x4000125C)
#define RF_ENABLE_CONFIG23_REG_RESET         (0x00000010)

/*=============================*/
struct __RF_ENABLE_CONFIG23_REG
/*=============================*/
{
    volatile uint32_t BITFLD_MIX_BIAS_SH_OPEN_DCF_RX           : 5;
    volatile uint32_t BITFLD_MIX_BIAS_SH_OPEN_DCF_TX           : 5;
};
#define MIX_BIAS_SH_OPEN_DCF_RX               (0x001F)
#define MIX_BIAS_SH_OPEN_DCF_TX               (0x03E0)



#define RF_ENABLE_CONFIG24_REG               (0x40001260)
#define RF_ENABLE_CONFIG24_REG_RESET         (0x0000000F)

/*=============================*/
struct __RF_ENABLE_CONFIG24_REG
/*=============================*/
{
    volatile uint32_t BITFLD_IFF_EN_DCF_RX                     : 5;
    volatile uint32_t BITFLD_IFF_EN_DCF_TX                     : 5;
};
#define IFF_EN_DCF_RX                         (0x001F)
#define IFF_EN_DCF_TX                         (0x03E0)



#define RF_ENABLE_CONFIG25_REG               (0x40001264)
#define RF_ENABLE_CONFIG25_REG_RESET         (0x00000010)

/*=============================*/
struct __RF_ENABLE_CONFIG25_REG
/*=============================*/
{
    volatile uint32_t BITFLD_IFF_BIAS_SH_OPEN_DCF_RX           : 5;
    volatile uint32_t BITFLD_IFF_BIAS_SH_OPEN_DCF_TX           : 5;
};
#define IFF_BIAS_SH_OPEN_DCF_RX               (0x001F)
#define IFF_BIAS_SH_OPEN_DCF_TX               (0x03E0)



#define RF_ENABLE_CONFIG26_REG               (0x40001268)
#define RF_ENABLE_CONFIG26_REG_RESET         (0x0000000F)

/*=============================*/
struct __RF_ENABLE_CONFIG26_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADC_CLK_EN_DCF_RX                 : 5;
    volatile uint32_t BITFLD_ADC_CLK_EN_DCF_TX                 : 5;
};
#define ADC_CLK_EN_DCF_RX                     (0x001F)
#define ADC_CLK_EN_DCF_TX                     (0x03E0)



