sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define RF_ENABLE_CONFIG27_REG               (0x4000126C)
#define RF_ENABLE_CONFIG27_REG_RESET         (0x00000010)

/*=============================*/
struct __RF_ENABLE_CONFIG27_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADC_EN_DCF_RX                     : 5;
    volatile uint32_t BITFLD_ADC_EN_DCF_TX                     : 5;
};
#define ADC_EN_DCF_RX                         (0x001F)
#define ADC_EN_DCF_TX                         (0x03E0)



#define RF_ENABLE_CONFIG28_REG               (0x40001270)
#define RF_ENABLE_CONFIG28_REG_RESET         (0x00000041)

/*=============================*/
struct __RF_ENABLE_CONFIG28_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADPLL_DCO_EN_DCF_RX               : 5;
    volatile uint32_t BITFLD_ADPLL_DCO_EN_DCF_TX               : 5;
};
#define ADPLL_DCO_EN_DCF_RX                   (0x001F)
#define ADPLL_DCO_EN_DCF_TX                   (0x03E0)



#define RF_ENABLE_CONFIG29_REG               (0x40001274)
#define RF_ENABLE_CONFIG29_REG_RESET         (0x00000041)

/*=============================*/
struct __RF_ENABLE_CONFIG29_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADPLL_CLK_EN_DCF_RX               : 5;
    volatile uint32_t BITFLD_ADPLL_CLK_EN_DCF_TX               : 5;
};
#define ADPLL_CLK_EN_DCF_RX                   (0x001F)
#define ADPLL_CLK_EN_DCF_TX                   (0x03E0)



#define RF_ENABLE_CONFIG30_REG               (0x40001278)
#define RF_ENABLE_CONFIG30_REG_RESET         (0x00000107)

/*=============================*/
struct __RF_ENABLE_CONFIG30_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADPLLDIG_RST_DCF_RX               : 5;
    volatile uint32_t BITFLD_ADPLLDIG_RST_DCF_TX               : 5;
};
#define ADPLLDIG_RST_DCF_RX                   (0x001F)
#define ADPLLDIG_RST_DCF_TX                   (0x03E0)



#define RF_ENABLE_CONFIG31_REG               (0x4000127C)
#define RF_ENABLE_CONFIG31_REG_RESET         (0x00000149)

/*=============================*/
struct __RF_ENABLE_CONFIG31_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADPLLDIG_EN_DCF_RX                : 5;
    volatile uint32_t BITFLD_ADPLLDIG_EN_DCF_TX                : 5;
};
#define ADPLLDIG_EN_DCF_RX                    (0x001F)
#define ADPLLDIG_EN_DCF_TX                    (0x03E0)



#define RF_ENABLE_CONFIG32_REG               (0x40001280)
#define RF_ENABLE_CONFIG32_REG_RESET         (0x00000001)

/*=============================*/
struct __RF_ENABLE_CONFIG32_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADPLLDIG_RX_EN_DCF_RX             : 5;
    volatile uint32_t BITFLD_ADPLLDIG_RX_EN_DCF_TX             : 5;
};
#define ADPLLDIG_RX_EN_DCF_RX                 (0x001F)
#define ADPLLDIG_RX_EN_DCF_TX                 (0x03E0)



#define RF_ENABLE_CONFIG33_REG               (0x40001284)
#define RF_ENABLE_CONFIG33_REG_RESET         (0x000001E0)

/*=============================*/
struct __RF_ENABLE_CONFIG33_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADPLLDIG_PAIN_EN_DCF_RX           : 5;
    volatile uint32_t BITFLD_ADPLLDIG_PAIN_EN_DCF_TX           : 5;
};
#define ADPLLDIG_PAIN_EN_DCF_RX               (0x001F)
#define ADPLLDIG_PAIN_EN_DCF_TX               (0x03E0)



#define RF_ENABLE_CONFIG34_REG               (0x40001288)
#define RF_ENABLE_CONFIG34_REG_RESET         (0x000001C0)

/*=============================*/
struct __RF_ENABLE_CONFIG34_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADPLL_LOBUF_PA_EN_DCF_RX          : 5;
    volatile uint32_t BITFLD_ADPLL_LOBUF_PA_EN_DCF_TX          : 5;
};
#define ADPLL_LOBUF_PA_EN_DCF_RX              (0x001F)
#define ADPLL_LOBUF_PA_EN_DCF_TX              (0x03E0)



#define RF_ENABLE_CONFIG35_REG               (0x4000128C)
#define RF_ENABLE_CONFIG35_REG_RESET         (0x00000294)

/*=============================*/
struct __RF_ENABLE_CONFIG35_REG
/*=============================*/
{
    volatile uint32_t BITFLD_CAL_EN_DCF_RX                     : 5;
    volatile uint32_t BITFLD_CAL_EN_DCF_TX                     : 5;
};
#define CAL_EN_DCF_RX                         (0x001F)
#define CAL_EN_DCF_TX                         (0x03E0)



#define RF_ENABLE_CONFIG36_REG               (0x40001290)
#define RF_ENABLE_CONFIG36_REG_RESET         (0x00000011)

/*=============================*/
struct __RF_ENABLE_CONFIG36_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DEM_EN_DCF_RX                     : 5;
    volatile uint32_t BITFLD_DEM_EN_DCF_TX                     : 5;
};
#define DEM_EN_DCF_RX                         (0x001F)
#define DEM_EN_DCF_TX                         (0x03E0)



#define RF_ENABLE_CONFIG37_REG               (0x40001294)
#define RF_ENABLE_CONFIG37_REG_RESET         (0x00000000)

/*=============================*/
struct __RF_ENABLE_CONFIG37_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DEM_DC_PARCAL_EN_DCF_RX           : 5;
    volatile uint32_t BITFLD_SPARE_DEM_DC_PARCAL_DCF_TX        : 5;
};
#define DEM_DC_PARCAL_EN_DCF_RX               (0x001F)
#define SPARE_DEM_DC_PARCAL_DCF_TX            (0x03E0)



#define RF_ENABLE_CONFIG38_REG               (0x40001298)
#define RF_ENABLE_CONFIG38_REG_RESET         (0x00000011)

/*=============================*/
struct __RF_ENABLE_CONFIG38_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DEM_AGC_UNFREEZE_EN_DCF_RX        : 5;
    volatile uint32_t BITFLD_SPARE_DEM_AGC_UNFREEZE_EN_DCF_TX  : 5;
};
#define DEM_AGC_UNFREEZE_EN_DCF_RX            (0x001F)
#define SPARE_DEM_AGC_UNFREEZE_EN_DCF_TX      (0x03E0)



#define RF_ENABLE_CONFIG39_REG               (0x4000129C)
#define RF_ENABLE_CONFIG39_REG_RESET         (0x00000013)

/*=============================*/
struct __RF_ENABLE_CONFIG39_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DEM_SIGDETECT_EN_DCF_RX           : 5;
    volatile uint32_t BITFLD_SPARE_DEM_SIGDETECT_EN_DCF_TX     : 5;
};
#define DEM_SIGDETECT_EN_DCF_RX               (0x001F)
#define SPARE_DEM_SIGDETECT_EN_DCF_TX         (0x03E0)



#define RF_ENABLE_CONFIG40_REG               (0x400012A0)
#define RF_ENABLE_CONFIG40_REG_RESET         (0x00000253)

/*=============================*/
struct __RF_ENABLE_CONFIG40_REG
/*=============================*/
{
    volatile uint32_t BITFLD_PHY_RDY4BS_DCF_RX                 : 5;
    volatile uint32_t BITFLD_PHY_RDY4BS_DCF_TX                 : 5;
};
#define PHY_RDY4BS_DCF_RX                     (0x001F)
#define PHY_RDY4BS_DCF_TX                     (0x03E0)



#define RF_ENABLE_CONFIG41_REG               (0x400012A4)
#define RF_ENABLE_CONFIG41_REG_RESET         (0x000000C5)

/*=============================*/
struct __RF_ENABLE_CONFIG41_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADPLL_RDY_FOR_DIV_DCF_RX          : 5;
    volatile uint32_t BITFLD_ADPLL_RDY_FOR_DIV_DCF_TX          : 5;
};
