sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define ADPLL_RDY_FOR_DIV_DCF_RX              (0x001F)
#define ADPLL_RDY_FOR_DIV_DCF_TX              (0x03E0)



#define RF_ENABLE_CONFIG42_REG               (0x400012A8)
#define RF_ENABLE_CONFIG42_REG_RESET         (0x00000000)

/*=============================*/
struct __RF_ENABLE_CONFIG42_REG
/*=============================*/
{
    volatile uint32_t BITFLD_CP_EN_DCF_RX                      : 5;
    volatile uint32_t BITFLD_CP_EN_DCF_TX                      : 5;
};
#define CP_EN_DCF_RX                          (0x001F)
#define CP_EN_DCF_TX                          (0x03E0)



#define RF_ENABLE_CONFIG43_REG               (0x400012AC)
#define RF_ENABLE_CONFIG43_REG_RESET         (0x00000000)

/*=============================*/
struct __RF_ENABLE_CONFIG43_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SPARE2_DCF_RX                     : 5;
    volatile uint32_t BITFLD_SPARE2_DCF_TX                     : 5;
};
#define SPARE2_DCF_RX                         (0x001F)
#define SPARE2_DCF_TX                         (0x03E0)



#define RF_ENABLE_CONFIG44_REG               (0x400012B0)
#define RF_ENABLE_CONFIG44_REG_RESET         (0x00000000)

/*=============================*/
struct __RF_ENABLE_CONFIG44_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SPARE3_DCF_RX                     : 5;
    volatile uint32_t BITFLD_SPARE3_DCF_TX                     : 5;
};
#define SPARE3_DCF_RX                         (0x001F)
#define SPARE3_DCF_TX                         (0x03E0)



#define RF_ENABLE_CONFIG45_REG               (0x400012B4)
#define RF_ENABLE_CONFIG45_REG_RESET         (0x00000000)

/*=============================*/
struct __RF_ENABLE_CONFIG45_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SPARE4_DCF_RX                     : 5;
    volatile uint32_t BITFLD_SPARE4_DCF_TX                     : 5;
};
#define SPARE4_DCF_RX                         (0x001F)
#define SPARE4_DCF_TX                         (0x03E0)



#define RF_ENABLE_CONFIG46_REG               (0x400012B8)
#define RF_ENABLE_CONFIG46_REG_RESET         (0x00000000)

/*=============================*/
struct __RF_ENABLE_CONFIG46_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SPARE5_DCF_RX                     : 5;
    volatile uint32_t BITFLD_SPARE5_DCF_TX                     : 5;
};
#define SPARE5_DCF_RX                         (0x001F)
#define SPARE5_DCF_TX                         (0x03E0)



#define RF_CNTRL_TIMER_1_REG                 (0x40001300)
#define RF_CNTRL_TIMER_1_REG_RESET           (0x00000400)

/*=============================*/
struct __RF_CNTRL_TIMER_1_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_2_REG                 (0x40001304)
#define RF_CNTRL_TIMER_2_REG_RESET           (0x00000C00)

/*=============================*/
struct __RF_CNTRL_TIMER_2_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_3_REG                 (0x40001308)
#define RF_CNTRL_TIMER_3_REG_RESET           (0x00000408)

/*=============================*/
struct __RF_CNTRL_TIMER_3_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_4_REG                 (0x4000130C)
#define RF_CNTRL_TIMER_4_REG_RESET           (0x00000C08)

/*=============================*/
struct __RF_CNTRL_TIMER_4_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_5_REG                 (0x40001310)
#define RF_CNTRL_TIMER_5_REG_RESET           (0x00000212)

/*=============================*/
struct __RF_CNTRL_TIMER_5_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_6_REG                 (0x40001314)
#define RF_CNTRL_TIMER_6_REG_RESET           (0x00000A12)

/*=============================*/
struct __RF_CNTRL_TIMER_6_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_7_REG                 (0x40001318)
#define RF_CNTRL_TIMER_7_REG_RESET           (0x00000414)

/*=============================*/
struct __RF_CNTRL_TIMER_7_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_8_REG                 (0x4000131C)
#define RF_CNTRL_TIMER_8_REG_RESET           (0x00000C14)

/*=============================*/
struct __RF_CNTRL_TIMER_8_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
