sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_9_REG                 (0x40001320)
#define RF_CNTRL_TIMER_9_REG_RESET           (0x00000416)

/*=============================*/
struct __RF_CNTRL_TIMER_9_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_10_REG                (0x40001324)
#define RF_CNTRL_TIMER_10_REG_RESET          (0x00000C16)

/*=============================*/
struct __RF_CNTRL_TIMER_10_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_11_REG                (0x40001328)
#define RF_CNTRL_TIMER_11_REG_RESET          (0x0000081A)

/*=============================*/
struct __RF_CNTRL_TIMER_11_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_12_REG                (0x4000132C)
#define RF_CNTRL_TIMER_12_REG_RESET          (0x00000E1A)

/*=============================*/
struct __RF_CNTRL_TIMER_12_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_13_REG                (0x40001330)
#define RF_CNTRL_TIMER_13_REG_RESET          (0x00000220)

/*=============================*/
struct __RF_CNTRL_TIMER_13_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_14_REG                (0x40001334)
#define RF_CNTRL_TIMER_14_REG_RESET          (0x00000A20)

/*=============================*/
struct __RF_CNTRL_TIMER_14_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_15_REG                (0x40001338)
#define RF_CNTRL_TIMER_15_REG_RESET          (0x00000426)

/*=============================*/
struct __RF_CNTRL_TIMER_15_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_16_REG                (0x4000133C)
#define RF_CNTRL_TIMER_16_REG_RESET          (0x00000430)

/*=============================*/
struct __RF_CNTRL_TIMER_16_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_17_REG                (0x40001340)
#define RF_CNTRL_TIMER_17_REG_RESET          (0x00000837)

/*=============================*/
struct __RF_CNTRL_TIMER_17_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_18_REG                (0x40001344)
#define RF_CNTRL_TIMER_18_REG_RESET          (0x00000846)

/*=============================*/
struct __RF_CNTRL_TIMER_18_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_19_REG                (0x40001348)
#define RF_CNTRL_TIMER_19_REG_RESET          (0x00000850)

/*=============================*/
struct __RF_CNTRL_TIMER_19_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_20_REG                (0x4000134C)
#define RF_CNTRL_TIMER_20_REG_RESET          (0x0000125A)

/*=============================*/
struct __RF_CNTRL_TIMER_20_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_21_REG                (0x40001350)
#define RF_CNTRL_TIMER_21_REG_RESET          (0x00000000)

/*=============================*/
struct __RF_CNTRL_TIMER_21_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
