sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_22_REG                (0x40001354)
#define RF_CNTRL_TIMER_22_REG_RESET          (0x00000000)

/*=============================*/
struct __RF_CNTRL_TIMER_22_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_23_REG                (0x40001358)
#define RF_CNTRL_TIMER_23_REG_RESET          (0x00000000)

/*=============================*/
struct __RF_CNTRL_TIMER_23_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_24_REG                (0x4000135C)
#define RF_CNTRL_TIMER_24_REG_RESET          (0x00000000)

/*=============================*/
struct __RF_CNTRL_TIMER_24_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_25_REG                (0x40001360)
#define RF_CNTRL_TIMER_25_REG_RESET          (0x00000000)

/*=============================*/
struct __RF_CNTRL_TIMER_25_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_26_REG                (0x40001364)
#define RF_CNTRL_TIMER_26_REG_RESET          (0x00000000)

/*=============================*/
struct __RF_CNTRL_TIMER_26_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_27_REG                (0x40001368)
#define RF_CNTRL_TIMER_27_REG_RESET          (0x00000000)

/*=============================*/
struct __RF_CNTRL_TIMER_27_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_28_REG                (0x4000136C)
#define RF_CNTRL_TIMER_28_REG_RESET          (0x00000000)

/*=============================*/
struct __RF_CNTRL_TIMER_28_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_29_REG                (0x40001370)
#define RF_CNTRL_TIMER_29_REG_RESET          (0x00000000)

/*=============================*/
struct __RF_CNTRL_TIMER_29_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_30_REG                (0x40001374)
#define RF_CNTRL_TIMER_30_REG_RESET          (0x00000000)

/*=============================*/
struct __RF_CNTRL_TIMER_30_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_31_REG                (0x40001378)
#define RF_CNTRL_TIMER_31_REG_RESET          (0x00000000)

/*=============================*/
struct __RF_CNTRL_TIMER_31_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_ALWAYS_EN1_REG                    (0x40001380)
#define RF_ALWAYS_EN1_REG_RESET              (0x00000000)

/*=============================*/
struct __RF_ALWAYS_EN1_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ALW_EN_RFIO_LDO_EN                : 1;
    volatile uint32_t BITFLD_ALW_EN_PA_LDO_EN                  : 1;
    volatile uint32_t BITFLD_ALW_EN_LNA_LDO_EN                 : 1;
    volatile uint32_t BITFLD_ALW_EN_MIX_LDO_EN                 : 1;
    volatile uint32_t BITFLD_ALW_EN_IFF_LDO_EN                 : 1;
    volatile uint32_t BITFLD_ALW_EN_IFFADC_LDO_EN              : 1;
    volatile uint32_t BITFLD_ALW_EN_ADPLL_TDC_LDO_EN           : 1;
    volatile uint32_t BITFLD_ALW_EN_ADPLL_DTC_LDO_EN           : 1;
    volatile uint32_t BITFLD_ALW_EN_ADPLL_DCO_LDO_EN           : 1;
    volatile uint32_t BITFLD_ALW_EN_LDO_ZERO_EN                : 1;
    volatile uint32_t BITFLD_ALW_EN_LNA_LDO_ZERO               : 1;
    volatile uint32_t BITFLD_ALW_EN_ADPLLDIG_LDO_ACTIVERDY     : 1;
    volatile uint32_t BITFLD_ALW_EN_ADPLLDIG_LDO_LP            : 1;
    volatile uint32_t BITFLD_ALW_EN_RFIO_RX_EN                 : 1;
    volatile uint32_t BITFLD_ALW_EN_RFIO_TX_EN                 : 1;
    volatile uint32_t BITFLD_ALW_EN_RFIO_TX_HARM_EN            : 1;
    volatile uint32_t BITFLD_ALW_EN_RFIO_BIAS_EN               : 1;
    volatile uint32_t BITFLD_ALW_EN_RFIO_BIAS_SH_OPEN          : 1;
    volatile uint32_t BITFLD_ALW_EN_PA_RAMP_EN                 : 1;
    volatile uint32_t BITFLD_ALW_EN_PA_EN                      : 1;
    volatile uint32_t BITFLD_ALW_EN_LNA_CORE_EN                : 1;
    volatile uint32_t BITFLD_ALW_EN_LNA_CGM_EN                 : 1;
    volatile uint32_t BITFLD_ALW_EN_MIX_EN                     : 1;
    volatile uint32_t BITFLD_ALW_EN_MIX_BIAS_SH_OPEN           : 1;
    volatile uint32_t BITFLD_ALW_EN_IFF_EN                     : 1;
    volatile uint32_t BITFLD_ALW_EN_IFF_BIAS_SH_OPEN           : 1;
    volatile uint32_t BITFLD_ALW_EN_ADC_CLK_EN                 : 1;
    volatile uint32_t BITFLD_ALW_EN_ADC_EN                     : 1;
    volatile uint32_t BITFLD_ALW_EN_ADPLL_DCO_EN               : 1;
    volatile uint32_t BITFLD_ALW_EN_ADPLL_CLK_EN               : 1;
    volatile uint32_t BITFLD_ALW_EN_ADPLLDIG_RST               : 1;
    volatile uint32_t BITFLD_ALW_EN_ADPLLDIG_EN                : 1;
};
#define ALW_EN_RFIO_LDO_EN                    (0x0001)
#define ALW_EN_PA_LDO_EN                      (0x0002)
#define ALW_EN_LNA_LDO_EN                     (0x0004)
#define ALW_EN_MIX_LDO_EN                     (0x0008)
#define ALW_EN_IFF_LDO_EN                     (0x0010)
#define ALW_EN_IFFADC_LDO_EN                  (0x0020)
#define ALW_EN_ADPLL_TDC_LDO_EN               (0x0040)
#define ALW_EN_ADPLL_DTC_LDO_EN               (0x0080)
#define ALW_EN_ADPLL_DCO_LDO_EN               (0x0100)
#define ALW_EN_LDO_ZERO_EN                    (0x0200)
#define ALW_EN_LNA_LDO_ZERO                   (0x0400)
#define ALW_EN_ADPLLDIG_LDO_ACTIVERDY         (0x0800)
#define ALW_EN_ADPLLDIG_LDO_LP                (0x1000)
#define ALW_EN_RFIO_RX_EN                     (0x2000)
#define ALW_EN_RFIO_TX_EN                     (0x4000)
#define ALW_EN_RFIO_TX_HARM_EN                (0x8000)
#define ALW_EN_RFIO_BIAS_EN                   (0x10000)
#define ALW_EN_RFIO_BIAS_SH_OPEN              (0x20000)
#define ALW_EN_PA_RAMP_EN                     (0x40000)
#define ALW_EN_PA_EN                          (0x80000)
#define ALW_EN_LNA_CORE_EN                    (0x100000)
#define ALW_EN_LNA_CGM_EN                     (0x200000)
#define ALW_EN_MIX_EN                         (0x400000)
#define ALW_EN_MIX_BIAS_SH_OPEN               (0x800000)
#define ALW_EN_IFF_EN                         (0x1000000)
#define ALW_EN_IFF_BIAS_SH_OPEN               (0x2000000)
#define ALW_EN_ADC_CLK_EN                     (0x4000000)
#define ALW_EN_ADC_EN                         (0x8000000)
#define ALW_EN_ADPLL_DCO_EN                   (0x10000000)
#define ALW_EN_ADPLL_CLK_EN                   (0x20000000)
#define ALW_EN_ADPLLDIG_RST                   (0x40000000)
#define ALW_EN_ADPLLDIG_EN                    (0x80000000)



#define RF_ALWAYS_EN2_REG                    (0x40001384)
#define RF_ALWAYS_EN2_REG_RESET              (0x00000000)

/*=============================*/
struct __RF_ALWAYS_EN2_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ALW_EN_ADPLLDIG_RX_EN             : 1;
    volatile uint32_t BITFLD_ALW_EN_ADPLL_PAIN_EN              : 1;
    volatile uint32_t BITFLD_ALW_EN_ADPLL_LOBUF_PA_EN          : 1;
    volatile uint32_t BITFLD_ALW_EN_CAL_EN                     : 1;
    volatile uint32_t BITFLD_ALW_EN_DEM_EN                     : 1;
    volatile uint32_t BITFLD_ALW_EN_DEM_DC_PARCAL_EN           : 1;
    volatile uint32_t BITFLD_ALW_EN_DEM_AGC_UNFREEZE_EN        : 1;
    volatile uint32_t BITFLD_ALW_EN_DEM_SIGDETECT_EN           : 1;
    volatile uint32_t BITFLD_ALW_EN_PHY_RDY4BS                 : 1;
    volatile uint32_t BITFLD_ALW_EN_ADPLL_RDY_FOR_DIV          : 1;
    volatile uint32_t BITFLD_ALW_EN_SPARE1                     : 1;
    volatile uint32_t BITFLD_ALW_EN_SPARE2                     : 1;
    volatile uint32_t BITFLD_ALW_EN_SPARE3                     : 1;
    volatile uint32_t BITFLD_ALW_EN_SPARE4                     : 1;
    volatile uint32_t BITFLD_ALW_EN_SPARE5                     : 1;
};
