sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define ALW_EN_ADPLLDIG_RX_EN                 (0x0001)
#define ALW_EN_ADPLL_PAIN_EN                  (0x0002)
#define ALW_EN_ADPLL_LOBUF_PA_EN              (0x0004)
#define ALW_EN_CAL_EN                         (0x0008)
#define ALW_EN_DEM_EN                         (0x0010)
#define ALW_EN_DEM_DC_PARCAL_EN               (0x0020)
#define ALW_EN_DEM_AGC_UNFREEZE_EN            (0x0040)
#define ALW_EN_DEM_SIGDETECT_EN               (0x0080)
#define ALW_EN_PHY_RDY4BS                     (0x0100)
#define ALW_EN_ADPLL_RDY_FOR_DIV              (0x0200)
#define ALW_EN_SPARE1                         (0x0400)
#define ALW_EN_SPARE2                         (0x0800)
#define ALW_EN_SPARE3                         (0x1000)
#define ALW_EN_SPARE4                         (0x2000)
#define ALW_EN_SPARE5                         (0x4000)



#define RF_PORT_EN_REG                       (0x40001388)
#define RF_PORT_EN_REG_RESET                 (0x00000000)

/*=============================*/
struct __RF_PORT_EN_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RF_PORT0_RX                       : 1;
    volatile uint32_t BITFLD_RF_PORT0_TX                       : 1;
    volatile uint32_t BITFLD_RF_PORT1_RX                       : 1;
    volatile uint32_t BITFLD_RF_PORT1_TX                       : 1;
    volatile uint32_t BITFLD_RF_PORT2_RX                       : 1;
    volatile uint32_t BITFLD_RF_PORT2_TX                       : 1;
    volatile uint32_t BITFLD_RF_PORT3_RX                       : 1;
    volatile uint32_t BITFLD_RF_PORT3_TX                       : 1;
    volatile uint32_t BITFLD_RF_PORT4_RX                       : 1;
    volatile uint32_t BITFLD_RF_PORT4_TX                       : 1;
};
#define RF_PORT0_RX                           (0x0001)
#define RF_PORT0_TX                           (0x0002)
#define RF_PORT1_RX                           (0x0004)
#define RF_PORT1_TX                           (0x0008)
#define RF_PORT2_RX                           (0x0010)
#define RF_PORT2_TX                           (0x0020)
#define RF_PORT3_RX                           (0x0040)
#define RF_PORT3_TX                           (0x0080)
#define RF_PORT4_RX                           (0x0100)
#define RF_PORT4_TX                           (0x0200)



#define RF_PORT_POL_REG                      (0x4000138C)
#define RF_PORT_POL_REG_RESET                (0x00000000)

/*=============================*/
struct __RF_PORT_POL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RF_PORT0_POL                      : 1;
    volatile uint32_t BITFLD_RF_PORT1_POL                      : 1;
    volatile uint32_t BITFLD_RF_PORT2_POL                      : 1;
    volatile uint32_t BITFLD_RF_PORT3_POL                      : 1;
    volatile uint32_t BITFLD_RF_PORT4_POL                      : 1;
};
#define RF_PORT0_POL                          (0x0001)
#define RF_PORT1_POL                          (0x0002)
#define RF_PORT2_POL                          (0x0004)
#define RF_PORT3_POL                          (0x0008)
#define RF_PORT4_POL                          (0x0010)



#define RF_DEM_CTRL_REG                      (0x40002000)
#define RF_DEM_CTRL_REG_RESET                (0x00000003)

/*=============================*/
struct __RF_DEM_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_EQUAL_EN                          : 1;
    volatile uint32_t BITFLD_BLE_DDC_EN                        : 1;
    volatile uint32_t BITFLD_IQCORR_EN                         : 1;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_AGC_USE_GPIO_IN                   : 1;
    volatile uint32_t BITFLD_IQ_TO_GPIO_EN                     : 1;
};
#define EQUAL_EN                              (0x0001)
#define BLE_DDC_EN                            (0x0002)
#define IQCORR_EN                             (0x0004)
#define AGC_USE_GPIO_IN                       (0x0010)
#define IQ_TO_GPIO_EN                         (0x0020)



#define RF_AGC_LUT_0123_REG                  (0x40002004)
#define RF_AGC_LUT_0123_REG_RESET            (0x23030201)

/*=============================*/
struct __RF_AGC_LUT_0123_REG
/*=============================*/
{
    volatile uint32_t BITFLD_VGA2_GAIN0                        : 2;
    volatile uint32_t BITFLD_VGA1_GAIN0                        : 3;
    volatile uint32_t BITFLD_LNA_GAIN0                         : 3;
    volatile uint32_t BITFLD_VGA2_GAIN1                        : 2;
    volatile uint32_t BITFLD_VGA1_GAIN1                        : 3;
    volatile uint32_t BITFLD_LNA_GAIN1                         : 3;
    volatile uint32_t BITFLD_VGA2_GAIN2                        : 2;
    volatile uint32_t BITFLD_VGA1_GAIN2                        : 3;
    volatile uint32_t BITFLD_LNA_GAIN2                         : 3;
    volatile uint32_t BITFLD_VGA2_GAIN3                        : 2;
    volatile uint32_t BITFLD_VGA1_GAIN3                        : 3;
    volatile uint32_t BITFLD_LNA_GAIN3                         : 3;
};
#define VGA2_GAIN0                            (0x0003)
#define VGA1_GAIN0                            (0x001C)
#define LNA_GAIN0                             (0x00E0)
#define VGA2_GAIN1                            (0x0300)
#define VGA1_GAIN1                            (0x1C00)
#define LNA_GAIN1                             (0xE000)
#define VGA2_GAIN2                            (0x30000)
#define VGA1_GAIN2                            (0x1C0000)
#define LNA_GAIN2                             (0xE00000)
#define VGA2_GAIN3                            (0x3000000)
#define VGA1_GAIN3                            (0x1C000000)
#define LNA_GAIN3                             (0xE0000000)



#define RF_AGC_LUT_4567_REG                  (0x40002008)
#define RF_AGC_LUT_4567_REG_RESET            (0x332F2B27)

/*=============================*/
struct __RF_AGC_LUT_4567_REG
/*=============================*/
{
    volatile uint32_t BITFLD_VGA2_GAIN4                        : 2;
    volatile uint32_t BITFLD_VGA1_GAIN4                        : 3;
    volatile uint32_t BITFLD_LNA_GAIN4                         : 3;
    volatile uint32_t BITFLD_VGA2_GAIN5                        : 2;
    volatile uint32_t BITFLD_VGA1_GAIN5                        : 3;
    volatile uint32_t BITFLD_LNA_GAIN5                         : 3;
    volatile uint32_t BITFLD_VGA2_GAIN6                        : 2;
    volatile uint32_t BITFLD_VGA1_GAIN6                        : 3;
    volatile uint32_t BITFLD_LNA_GAIN6                         : 3;
    volatile uint32_t BITFLD_VGA2_GAIN7                        : 2;
    volatile uint32_t BITFLD_VGA1_GAIN7                        : 3;
    volatile uint32_t BITFLD_LNA_GAIN7                         : 3;
};
#define VGA2_GAIN4                            (0x0003)
#define VGA1_GAIN4                            (0x001C)
#define LNA_GAIN4                             (0x00E0)
#define VGA2_GAIN5                            (0x0300)
#define VGA1_GAIN5                            (0x1C00)
#define LNA_GAIN5                             (0xE000)
#define VGA2_GAIN6                            (0x30000)
#define VGA1_GAIN6                            (0x1C0000)
#define LNA_GAIN6                             (0xE00000)
#define VGA2_GAIN7                            (0x3000000)
#define VGA1_GAIN7                            (0x1C000000)
#define LNA_GAIN7                             (0xE0000000)



