sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define RF_AGC_LUT_89AB_REG                  (0x4000200C)
#define RF_AGC_LUT_89AB_REG_RESET            (0x77775737)

/*=============================*/
struct __RF_AGC_LUT_89AB_REG
/*=============================*/
{
    volatile uint32_t BITFLD_VGA2_GAIN8                        : 2;
    volatile uint32_t BITFLD_VGA1_GAIN8                        : 3;
    volatile uint32_t BITFLD_LNA_GAIN8                         : 3;
    volatile uint32_t BITFLD_VGA2_GAIN9                        : 2;
    volatile uint32_t BITFLD_VGA1_GAIN9                        : 3;
    volatile uint32_t BITFLD_LNA_GAIN9                         : 3;
    volatile uint32_t BITFLD_VGA2_GAIN10                       : 2;
    volatile uint32_t BITFLD_VGA1_GAIN10                       : 3;
    volatile uint32_t BITFLD_LNA_GAIN10                        : 3;
    volatile uint32_t BITFLD_VGA2_GAIN11                       : 2;
    volatile uint32_t BITFLD_VGA1_GAIN11                       : 3;
    volatile uint32_t BITFLD_LNA_GAIN11                        : 3;
};
#define VGA2_GAIN8                            (0x0003)
#define VGA1_GAIN8                            (0x001C)
#define LNA_GAIN8                             (0x00E0)
#define VGA2_GAIN9                            (0x0300)
#define VGA1_GAIN9                            (0x1C00)
#define LNA_GAIN9                             (0xE000)
#define VGA2_GAIN10                           (0x30000)
#define VGA1_GAIN10                           (0x1C0000)
#define LNA_GAIN10                            (0xE00000)
#define VGA2_GAIN11                           (0x3000000)
#define VGA1_GAIN11                           (0x1C000000)
#define LNA_GAIN11                            (0xE0000000)



#define RF_AGC_LUT_CDEF_REG                  (0x40002010)
#define RF_AGC_LUT_CDEF_REG_RESET            (0x01022243)

/*=============================*/
struct __RF_AGC_LUT_CDEF_REG
/*=============================*/
{
    volatile uint32_t BITFLD_VGA2_GAIN12                       : 2;
    volatile uint32_t BITFLD_VGA1_GAIN12                       : 3;
    volatile uint32_t BITFLD_LNA_GAIN12                        : 3;
    volatile uint32_t BITFLD_VGA2_GAIN13                       : 2;
    volatile uint32_t BITFLD_VGA1_GAIN13                       : 3;
    volatile uint32_t BITFLD_LNA_GAIN13                        : 3;
    volatile uint32_t BITFLD_VGA2_GAIN14                       : 2;
    volatile uint32_t BITFLD_VGA1_GAIN14                       : 3;
    volatile uint32_t BITFLD_LNA_GAIN14                        : 3;
    volatile uint32_t BITFLD_VGA2_GAIN15                       : 2;
    volatile uint32_t BITFLD_VGA1_GAIN15                       : 3;
    volatile uint32_t BITFLD_LNA_GAIN15                        : 3;
};
#define VGA2_GAIN12                           (0x0003)
#define VGA1_GAIN12                           (0x001C)
#define LNA_GAIN12                            (0x00E0)
#define VGA2_GAIN13                           (0x0300)
#define VGA1_GAIN13                           (0x1C00)
#define LNA_GAIN13                            (0xE000)
#define VGA2_GAIN14                           (0x30000)
#define VGA1_GAIN14                           (0x1C0000)
#define LNA_GAIN14                            (0xE00000)
#define VGA2_GAIN15                           (0x3000000)
#define VGA1_GAIN15                           (0x1C000000)
#define LNA_GAIN15                            (0xE0000000)



#define RF_AGC_CTRL1_REG                     (0x40002018)
#define RF_AGC_CTRL1_REG_RESET               (0x0056D50D)

/*=============================*/
struct __RF_AGC_CTRL1_REG
/*=============================*/
{
    volatile uint32_t BITFLD_AGC_TH_LOW                        : 7;
    volatile uint32_t BITFLD_AGC_TH_HIGH                       : 7;
    volatile uint32_t BITFLD_AGC_TH2_HIGH                      : 7;
    volatile uint32_t BITFLD_AGC_MODE                          : 2;
};
#define AGC_TH_LOW                            (0x007F)
#define AGC_TH_HIGH                           (0x3F80)
#define AGC_TH2_HIGH                          (0x1FC000)
#define AGC_MODE                              (0x600000)



#define RF_AGC_CTRL2_REG                     (0x4000201C)
#define RF_AGC_CTRL2_REG_RESET               (0x0040148D)

/*=============================*/
struct __RF_AGC_CTRL2_REG
/*=============================*/
{
    volatile uint32_t BITFLD_FASTAGC_EN                        : 1;
    volatile uint32_t BITFLD_FASTAGC_STEPS                     : 2;
    volatile uint32_t BITFLD_FASTAGC_WAIT                      : 2;
    volatile uint32_t BITFLD_AGCINC_WAIT                       : 2;
    volatile uint32_t BITFLD_AGCDEC_WAIT                       : 2;
    volatile uint32_t BITFLD_AGC_MAX_SETTING                   : 4;
             uint32_t                                          : 4;
    volatile uint32_t BITFLD_AGCSETTING_SEL                    : 1;
    volatile uint32_t BITFLD_AGCSETTING_WR                     : 4;
    volatile uint32_t BITFLD_EN_FRZ_GAIN                       : 1;
};
#define FASTAGC_EN                            (0x0001)
#define FASTAGC_STEPS                         (0x0006)
#define FASTAGC_WAIT                          (0x0018)
#define AGCINC_WAIT                           (0x0060)
#define AGCDEC_WAIT                           (0x0180)
#define AGC_MAX_SETTING                       (0x1E00)
#define AGCSETTING_SEL                        (0x20000)
#define AGCSETTING_WR                         (0x3C0000)
#define EN_FRZ_GAIN                           (0x400000)



#define RF_AFC_CTRL_REG                      (0x40002020)
#define RF_AFC_CTRL_REG_RESET                (0x00000015)

/*=============================*/
struct __RF_AFC_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_AFC_MODE                          : 4;
    volatile uint32_t BITFLD_PAD_MODE                          : 2;
    volatile uint32_t BITFLD_APD_MODE                          : 3;
    volatile uint32_t BITFLD_AFC_SYNCF_DIRECT                  : 1;
};
#define AFC_MODE                              (0x000F)
#define PAD_MODE                              (0x0030)
#define APD_MODE                              (0x01C0)
#define AFC_SYNCF_DIRECT                      (0x0200)



#define RF_DC_OFFSET_CTRL1_REG               (0x40002024)
#define RF_DC_OFFSET_CTRL1_REG_RESET         (0x00020100)

/*=============================*/
struct __RF_DC_OFFSET_CTRL1_REG
/*=============================*/
{
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_DCOFFSET_I_WR                     : 8;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_DCOFFSET_Q_WR                     : 8;
};
#define DCOFFSET_I_WR                         (0x01FE)
#define DCOFFSET_Q_WR                         (0x3FC00)



#define RF_DC_OFFSET_CTRL2_REG               (0x40002028)
#define RF_DC_OFFSET_CTRL2_REG_RESET         (0x00F86696)

/*=============================*/
struct __RF_DC_OFFSET_CTRL2_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DCOFFSET_SEL                      : 1;
    volatile uint32_t BITFLD_DCPARCAL_EN                       : 1;
    volatile uint32_t BITFLD_DCNSTEP                           : 3;
    volatile uint32_t BITFLD_DCFULLNGAIN                       : 3;
    volatile uint32_t BITFLD_DCPARCAL_INIT                     : 2;
    volatile uint32_t BITFLD_DCVGA1SCALE_EN                    : 1;
    volatile uint32_t BITFLD_DCPARNGAIN                        : 3;
    volatile uint32_t BITFLD_DCPAR_MULT_STEPS_EN               : 1;
    volatile uint32_t BITFLD_DCPAR_DCF_EN                      : 1;
    volatile uint32_t BITFLD_DCOC_RESULT_LNAGAIN0_LUT          : 2;
    volatile uint32_t BITFLD_DCOC_RESULT_LNAGAIN1_LUT          : 2;
    volatile uint32_t BITFLD_DCOC_RESULT_LNAGAIN2_LUT          : 2;
    volatile uint32_t BITFLD_DCOC_RESULT_LNAGAIN345_LUT        : 2;
};
#define DCOFFSET_SEL                          (0x0001)
#define DCPARCAL_EN                           (0x0002)
#define DCNSTEP                               (0x001C)
#define DCFULLNGAIN                           (0x00E0)
#define DCPARCAL_INIT                         (0x0300)
#define DCVGA1SCALE_EN                        (0x0400)
#define DCPARNGAIN                            (0x3800)
#define DCPAR_MULT_STEPS_EN                   (0x4000)
#define DCPAR_DCF_EN                          (0x8000)
#define DCOC_RESULT_LNAGAIN0_LUT              (0x30000)
#define DCOC_RESULT_LNAGAIN1_LUT              (0xC0000)
#define DCOC_RESULT_LNAGAIN2_LUT              (0x300000)
#define DCOC_RESULT_LNAGAIN345_LUT            (0xC00000)



#define RF_DC_OFFSET_CTRL3_REG               (0x4000202C)
#define RF_DC_OFFSET_CTRL3_REG_RESET         (0x0000DCE4)

/*=============================*/
struct __RF_DC_OFFSET_CTRL3_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DCBETA_I                          : 8;
    volatile uint32_t BITFLD_DCBETA_Q                          : 8;
};
#define DCBETA_I                              (0x00FF)
#define DCBETA_Q                              (0xFF00)



#define RF_DC_OFFSET_CTRL4_REG               (0x40002030)
#define RF_DC_OFFSET_CTRL4_REG_RESET         (0x00009210)

/*=============================*/
struct __RF_DC_OFFSET_CTRL4_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DCAGCSETTING_FULL0                : 4;
    volatile uint32_t BITFLD_DCAGCSETTING_FULL1                : 4;
    volatile uint32_t BITFLD_DCAGCSETTING_FULL2                : 4;
    volatile uint32_t BITFLD_DCAGCSETTING_FULL3                : 4;
};
#define DCAGCSETTING_FULL0                    (0x000F)
#define DCAGCSETTING_FULL1                    (0x00F0)
#define DCAGCSETTING_FULL2                    (0x0F00)
#define DCAGCSETTING_FULL3                    (0xF000)



#define RF_AGC_RESULT_REG                    (0x40002034)
#define RF_AGC_RESULT_REG_RESET              (0x00000000)

/*=============================*/
struct __RF_AGC_RESULT_REG
/*=============================*/
{
    volatile uint32_t BITFLD_AFC_RD                            : 8;
    volatile uint32_t BITFLD_AGCSETTING_RD                     : 4;
};
#define AFC_RD                                (0x00FF)
#define AGCSETTING_RD                         (0x0F00)



#define RF_RSSI_RESULT_REG                   (0x40002038)
#define RF_RSSI_RESULT_REG_RESET             (0x00000000)

/*=============================*/
struct __RF_RSSI_RESULT_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RSSI_LATCHED_RD                   : 10;
    volatile uint32_t BITFLD_RSSI_AVG_RD                       : 10;
};
#define RSSI_LATCHED_RD                       (0x03FF)
#define RSSI_AVG_RD                           (0xFFC00)



