sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define PWR_MODE_RX                           (0x0001)
#define PWR_MODE_TX                           (0x0002)



#define ADPLL_CN_CTRL_REG                    (0x40003004)
#define ADPLL_CN_CTRL_REG_RESET              (0x09620100)

/*=============================*/
struct __ADPLL_CN_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_CN                                : 7;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_CS                                : 1;
             uint32_t                                          : 6;
    volatile uint32_t BITFLD_SGN                               : 1;
    volatile uint32_t BITFLD_CH0                               : 13;
};
#define CN                                    (0x007F)
#define CS                                    (0x0100)
#define SGN                                   (0x8000)
#define CH0                                   (0x1FFF0000)



#define ADPLL_FIF_CTRL1_REG                  (0x40003008)
#define ADPLL_FIF_CTRL1_REG_RESET            (0x00000400)

/*=============================*/
struct __ADPLL_FIF_CTRL1_REG
/*=============================*/
{
    volatile uint32_t BITFLD_FIFRX_1M                          : 14;
};
#define FIFRX_1M                              (0x3FFF)



#define ADPLL_FIF_CTRL2_REG                  (0x4000300C)
#define ADPLL_FIF_CTRL2_REG_RESET            (0x00000000)

/*=============================*/
struct __ADPLL_FIF_CTRL2_REG
/*=============================*/
{
    volatile uint32_t BITFLD_FIFRX_OFFSET                      : 14;
             uint32_t                                          : 2;
    volatile uint32_t BITFLD_FIFTX                             : 14;
};
#define FIFRX_OFFSET                          (0x3FFF)
#define FIFTX                                 (0x3FFF0000)



#define ADPLL_KDCO_CAL_CTRL1_REG             (0x40003010)
#define ADPLL_KDCO_CAL_CTRL1_REG_RESET       (0x00009B9B)

/*=============================*/
struct __ADPLL_KDCO_CAL_CTRL1_REG
/*=============================*/
{
    volatile uint32_t BITFLD_KDCOHFIC_1M                       : 8;
    volatile uint32_t BITFLD_KDCOLF_IN_1M                      : 8;
};
#define KDCOHFIC_1M                           (0x00FF)
#define KDCOLF_IN_1M                          (0xFF00)



#define ADPLL_KDCO_CAL_CTRL2_REG             (0x40003014)
#define ADPLL_KDCO_CAL_CTRL2_REG_RESET       (0x4C14000A)

/*=============================*/
struct __ADPLL_KDCO_CAL_CTRL2_REG
/*=============================*/
{
    volatile uint32_t BITFLD_KMOD_ALPHA_1M                     : 5;
             uint32_t                                          : 1;
             uint32_t                                          : 2;
             uint32_t                                          : 8;
    volatile uint32_t BITFLD_KDCOCN_IC                         : 7;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_TKDCOCAL                          : 3;
    volatile uint32_t BITFLD_KDCOLFCALEN                       : 1;
    volatile uint32_t BITFLD_KDCOCALRX                         : 1;
    volatile uint32_t BITFLD_KDCOCALTX                         : 1;
    volatile uint32_t BITFLD_KDCOESTDEV                        : 2;
};
#define KMOD_ALPHA_1M                         (0x001F)
#define KDCOCN_IC                             (0x7F0000)
#define TKDCOCAL                              (0x7000000)
#define KDCOLFCALEN                           (0x8000000)
#define KDCOCALRX                             (0x10000000)
#define KDCOCALTX                             (0x20000000)
#define KDCOESTDEV                            (0xC0000000)



#define ADPLL_KDTCTDC_CAL_CTRL1_REG          (0x40003018)
#define ADPLL_KDTCTDC_CAL_CTRL1_REG_RESET    (0x8514429C)

/*=============================*/
struct __ADPLL_KDTCTDC_CAL_CTRL1_REG
/*=============================*/
{
    volatile uint32_t BITFLD_KDTC_ALPHA                        : 6;
    volatile uint32_t BITFLD_KTDC_IN                           : 9;
    volatile uint32_t BITFLD_KDTC_PIPELINE_BYPASS              : 1;
    volatile uint32_t BITFLD_KDTCCN_IC                         : 7;
    volatile uint32_t BITFLD_KDTCIC                            : 9;
};
#define KDTC_ALPHA                            (0x003F)
#define KTDC_IN                               (0x7FC0)
#define KDTC_PIPELINE_BYPASS                  (0x8000)
#define KDTCCN_IC                             (0x7F0000)
#define KDTCIC                                (0xFF800000)



#define ADPLL_KDTCTDC_CAL_CTRL2_REG          (0x4000301C)
#define ADPLL_KDTCTDC_CAL_CTRL2_REG_RESET    (0x00007F50)

/*=============================*/
struct __ADPLL_KDTCTDC_CAL_CTRL2_REG
/*=============================*/
{
    volatile uint32_t BITFLD_KDTCCALEN                         : 1;
    volatile uint32_t BITFLD_KDTCCALMOD                        : 1;
    volatile uint32_t BITFLD_KDTCCALMOD1P                      : 1;
    volatile uint32_t BITFLD_KDTCCAL_INV                       : 1;
    volatile uint32_t BITFLD_KDTCCALLG                         : 3;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_KTDCCALEN                         : 1;
    volatile uint32_t BITFLD_PHRDLY                            : 2;
    volatile uint32_t BITFLD_TKDTCCAL                          : 4;
    volatile uint32_t BITFLD_PHRDLY_EXTRA                      : 1;
};
#define KDTCCALEN                             (0x0001)
#define KDTCCALMOD                            (0x0002)
#define KDTCCALMOD1P                          (0x0004)
#define KDTCCAL_INV                           (0x0008)
#define KDTCCALLG                             (0x0070)
#define KTDCCALEN                             (0x0100)
#define PHRDLY                                (0x0600)
#define TKDTCCAL                              (0x7800)
#define PHRDLY_EXTRA                          (0x8000)



#define ADPLL_DCOAMP_CAL_CTRL_REG            (0x40003020)
#define ADPLL_DCOAMP_CAL_CTRL_REG_RESET      (0x77770011)

/*=============================*/
struct __ADPLL_DCOAMP_CAL_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_KCOARSE                           : 3;
    volatile uint32_t BITFLD_KMEDIUM                           : 3;
    volatile uint32_t BITFLD_AMPCALEN                          : 1;
    volatile uint32_t BITFLD_DCOAMPTM                          : 1;
             uint32_t                                          : 8;
    volatile uint32_t BITFLD_DCOAMPIC_HP_RX                    : 4;
    volatile uint32_t BITFLD_DCOAMPIC_HP_TX                    : 4;
    volatile uint32_t BITFLD_DCOAMPIC_LP_RX                    : 4;
    volatile uint32_t BITFLD_DCOAMPIC_LP_TX                    : 4;
};
#define KCOARSE                               (0x0007)
#define KMEDIUM                               (0x0038)
#define AMPCALEN                              (0x0040)
#define DCOAMPTM                              (0x0080)
#define DCOAMPIC_HP_RX                        (0xF0000)
#define DCOAMPIC_HP_TX                        (0xF00000)
#define DCOAMPIC_LP_RX                        (0xF000000)
#define DCOAMPIC_LP_TX                        (0xF0000000)



