sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define TCOARSE                               (0x000F)
#define TMEDIUM                               (0x00F0)
#define TFINE                                 (0x0F00)
#define TMOD                                  (0xF000)
#define TPASETTLE                             (0xF0000)
#define TSETTLE                               (0xF00000)
#define TVPASETTLE                            (0x3F000000)



#define ADPLL_MON_CTRL_REG                   (0x40003044)
#define ADPLL_MON_CTRL_REG_RESET             (0x00FC0F83)

/*=============================*/
struct __ADPLL_MON_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_TFREQMEAS                         : 5;
    volatile uint32_t BITFLD_TMREN                             : 1;
    volatile uint32_t BITFLD_ENRFMEAS                          : 1;
    volatile uint32_t BITFLD_RFMEAS_MODE                       : 1;
    volatile uint32_t BITFLD_HOLD_STATE                        : 4;
             uint32_t                                          : 4;
    volatile uint32_t BITFLD_QUALMONMOD                        : 2;
    volatile uint32_t BITFLD_QUALMONWND                        : 6;
    volatile uint32_t BITFLD_QUALMONTRHLD                      : 6;
    volatile uint32_t BITFLD_QUALMONFRCEN                      : 1;
};
#define TFREQMEAS                             (0x001F)
#define TMREN                                 (0x0020)
#define ENRFMEAS                              (0x0040)
#define RFMEAS_MODE                           (0x0080)
#define HOLD_STATE                            (0x0F00)
#define QUALMONMOD                            (0x30000)
#define QUALMONWND                            (0xFC0000)
#define QUALMONTRHLD                          (0x3F000000)
#define QUALMONFRCEN                          (0x40000000)



#define ADPLL_MISC_CTRL_REG                  (0x40003048)
#define ADPLL_MISC_CTRL_REG_RESET            (0x000000DA)

/*=============================*/
struct __ADPLL_MISC_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DLYFCWDT                          : 2;
    volatile uint32_t BITFLD_RESDLY                            : 2;
    volatile uint32_t BITFLD_MODDLY                            : 2;
    volatile uint32_t BITFLD_ENRESIDUE                         : 1;
    volatile uint32_t BITFLD_ENFCWMOD                          : 1;
    volatile uint32_t BITFLD_PHR_FRAC_PRESET_VAL               : 16;
};
#define DLYFCWDT                              (0x0003)
#define RESDLY                                (0x000C)
#define MODDLY                                (0x0030)
#define ENRESIDUE                             (0x0040)
#define ENFCWMOD                              (0x0080)
#define PHR_FRAC_PRESET_VAL                   (0xFFFF00)



#define ADPLL_OVERRULE_CTRL1_REG             (0x40003050)
#define ADPLL_OVERRULE_CTRL1_REG_RESET       (0x00000000)

/*=============================*/
struct __ADPLL_OVERRULE_CTRL1_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OVR_ACTIVE_SEL                    : 1;
    volatile uint32_t BITFLD_OVR_ACTIVE_WR                     : 1;
    volatile uint32_t BITFLD_OVR_RXBIT_SEL                     : 1;
    volatile uint32_t BITFLD_OVR_RXBIT_WR                      : 1;
    volatile uint32_t BITFLD_OVR_ENPAIN_SEL                    : 1;
    volatile uint32_t BITFLD_OVR_ENPAIN_WR                     : 1;
    volatile uint32_t BITFLD_OVR_SRESETN_SEL                   : 1;
    volatile uint32_t BITFLD_OVR_SRESETN_WR                    : 1;
    volatile uint32_t BITFLD_OVR_VPAEN_SEL                     : 1;
    volatile uint32_t BITFLD_OVR_VPAEN_WR                      : 1;
    volatile uint32_t BITFLD_OVR_RDYFORDIV_SEL                 : 1;
    volatile uint32_t BITFLD_OVR_RDYFORDIV_WR                  : 1;
    volatile uint32_t BITFLD_OVR_DCOAMPHOLD_SEL                : 1;
    volatile uint32_t BITFLD_OVR_DCOAMPHOLD_WR                 : 1;
             uint32_t                                          : 2;
    volatile uint32_t BITFLD_OVR_DCOAMP_SEL                    : 1;
    volatile uint32_t BITFLD_OVR_DCOAMP_WR                     : 4;
             uint32_t                                          : 3;
    volatile uint32_t BITFLD_OVR_DTC_OH_SEL                    : 1;
    volatile uint32_t BITFLD_OVR_DTC_OH_WR                     : 7;
};
#define OVR_ACTIVE_SEL                        (0x0001)
#define OVR_ACTIVE_WR                         (0x0002)
#define OVR_RXBIT_SEL                         (0x0004)
#define OVR_RXBIT_WR                          (0x0008)
#define OVR_ENPAIN_SEL                        (0x0010)
#define OVR_ENPAIN_WR                         (0x0020)
#define OVR_SRESETN_SEL                       (0x0040)
#define OVR_SRESETN_WR                        (0x0080)
#define OVR_VPAEN_SEL                         (0x0100)
#define OVR_VPAEN_WR                          (0x0200)
#define OVR_RDYFORDIV_SEL                     (0x0400)
#define OVR_RDYFORDIV_WR                      (0x0800)
#define OVR_DCOAMPHOLD_SEL                    (0x1000)
#define OVR_DCOAMPHOLD_WR                     (0x2000)
#define OVR_DCOAMP_SEL                        (0x10000)
#define OVR_DCOAMP_WR                         (0x1E0000)
#define OVR_DTC_OH_SEL                        (0x1000000)
#define OVR_DTC_OH_WR                         (0xFE000000)



#define ADPLL_OVERRULE_CTRL2_REG             (0x40003054)
#define ADPLL_OVERRULE_CTRL2_REG_RESET       (0x00000000)

/*=============================*/
struct __ADPLL_OVERRULE_CTRL2_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OVR_DCOCOARSE_SEL                 : 1;
    volatile uint32_t BITFLD_OVR_DCOCOARSE_WR                  : 4;
             uint32_t                                          : 3;
    volatile uint32_t BITFLD_OVR_DCOMEDIUM_SEL                 : 1;
    volatile uint32_t BITFLD_OVR_DCOMEDIUM_WR                  : 3;
             uint32_t                                          : 4;
    volatile uint32_t BITFLD_OVR_DCOFINE_SEL                   : 1;
    volatile uint32_t BITFLD_OVR_DCOFINE_WR                    : 6;
    volatile uint32_t BITFLD_OVR_DCOMOD_SEL                    : 1;
    volatile uint32_t BITFLD_OVR_DCOMOD_WR                     : 8;
};
#define OVR_DCOCOARSE_SEL                     (0x0001)
#define OVR_DCOCOARSE_WR                      (0x001E)
#define OVR_DCOMEDIUM_SEL                     (0x0100)
#define OVR_DCOMEDIUM_WR                      (0x0E00)
#define OVR_DCOFINE_SEL                       (0x10000)
#define OVR_DCOFINE_WR                        (0x7E0000)
#define OVR_DCOMOD_SEL                        (0x800000)
#define OVR_DCOMOD_WR                         (0xFF000000)



#define ADPLL_OVERRULE_CTRL3_REG             (0x40003058)
#define ADPLL_OVERRULE_CTRL3_REG_RESET       (0x00000000)

/*=============================*/
struct __ADPLL_OVERRULE_CTRL3_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OVR_RXDIV_EN_SEL                  : 1;
    volatile uint32_t BITFLD_OVR_RXDIV_EN_WR                   : 1;
    volatile uint32_t BITFLD_OVR_TXDIV_EN_SEL                  : 1;
    volatile uint32_t BITFLD_OVR_TXDIV_EN_WR                   : 1;
    volatile uint32_t BITFLD_OVR_FBDIV_EN_SEL                  : 1;
    volatile uint32_t BITFLD_OVR_FBDIV_EN_WR                   : 1;
    volatile uint32_t BITFLD_OVR_RXDIV_FB_EN_SEL               : 1;
    volatile uint32_t BITFLD_OVR_RXDIV_FB_EN_WR                : 1;
};
#define OVR_RXDIV_EN_SEL                      (0x0001)
#define OVR_RXDIV_EN_WR                       (0x0002)
#define OVR_TXDIV_EN_SEL                      (0x0004)
#define OVR_TXDIV_EN_WR                       (0x0008)
#define OVR_FBDIV_EN_SEL                      (0x0010)
#define OVR_FBDIV_EN_WR                       (0x0020)
#define OVR_RXDIV_FB_EN_SEL                   (0x0040)
#define OVR_RXDIV_FB_EN_WR                    (0x0080)



#define ADPLL_RFPT_CTRL_REG                  (0x4000305C)
#define ADPLL_RFPT_CTRL_REG_RESET            (0x00000000)

/*=============================*/
struct __ADPLL_RFPT_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RFPT_MUX                          : 4;
    volatile uint32_t BITFLD_INV_CKRFPT                        : 1;
    volatile uint32_t BITFLD_RFPT_RATE                         : 1;
             uint32_t                                          : 1;
};
