sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define RFPT_MUX                              (0x000F)
#define INV_CKRFPT                            (0x0010)
#define RFPT_RATE                             (0x0020)



#define ADPLL_ANATST_CTRL_REG                (0x40003060)
#define ADPLL_ANATST_CTRL_REG_RESET          (0x00000000)

/*=============================*/
struct __ADPLL_ANATST_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ANATSTEN                          : 16;
    volatile uint32_t BITFLD_ANATSTSPARE                       : 16;
};
#define ANATSTEN                              (0xFFFF)
#define ANATSTSPARE                           (0xFFFF0000)



#define ADPLL_ACC_CTRL_REG                   (0x40003064)
#define ADPLL_ACC_CTRL_REG_RESET             (0x8BF40BF4)

/*=============================*/
struct __ADPLL_ACC_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_CLIP_MOD_TUNE_0_RX                : 13;
             uint32_t                                          : 3;
    volatile uint32_t BITFLD_CLIP_MOD_TUNE_0_TX                : 13;
             uint32_t                                          : 2;
    volatile uint32_t BITFLD_EN_CMF_AVG                        : 1;
};
#define CLIP_MOD_TUNE_0_RX                    (0x1FFF)
#define CLIP_MOD_TUNE_0_TX                    (0x1FFF0000)
#define EN_CMF_AVG                            (0x80000000)



#define ADPLL_FREQMEAS_RD_REG                (0x4000307C)
#define ADPLL_FREQMEAS_RD_REG_RESET          (0x21000000)

/*=============================*/
struct __ADPLL_FREQMEAS_RD_REG
/*=============================*/
{
    volatile uint32_t BITFLD_FREQDIFF                          : 23;
    volatile uint32_t BITFLD_PHVSA1                            : 1;
    volatile uint32_t BITFLD_PHVSA0                            : 1;
    volatile uint32_t BITFLD_TDCBUB                            : 1;
    volatile uint32_t BITFLD_QUALMONDET                        : 1;
             uint32_t                                          : 1;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_MEASDONE_OUT                      : 1;
};
#define FREQDIFF                              (0x7FFFFF)
#define PHVSA1                                (0x800000)
#define PHVSA0                                (0x1000000)
#define TDCBUB                                (0x2000000)
#define QUALMONDET                            (0x4000000)
#define MEASDONE_OUT                          (0x20000000)



#define ADPLL_DCO_RD_REG                     (0x40003080)
#define ADPLL_DCO_RD_REG_RESET               (0x1C000007)

/*=============================*/
struct __ADPLL_DCO_RD_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DCOCOARSE                         : 4;
    volatile uint32_t BITFLD_DCOMEDIUM                         : 3;
    volatile uint32_t BITFLD_DCOFINE                           : 6;
    volatile uint32_t BITFLD_DCOMOD                            : 13;
    volatile uint32_t BITFLD_DCOAMP                            : 4;
};
#define DCOCOARSE                             (0x000F)
#define DCOMEDIUM                             (0x0070)
#define DCOFINE                               (0x1F80)
#define DCOMOD                                (0x3FFE000)
#define DCOAMP                                (0x3C000000)



#define ADPLL_KDCO_RD_REG                    (0x40003084)
#define ADPLL_KDCO_RD_REG_RESET              (0x00000000)

/*=============================*/
struct __ADPLL_KDCO_RD_REG
/*=============================*/
{
    volatile uint32_t BITFLD_KDCO_HF_INT                       : 8;
    volatile uint32_t BITFLD_KDCO_HF_OUT                       : 8;
    volatile uint32_t BITFLD_KDCOCN                            : 7;
    volatile uint32_t BITFLD_CAL_KDCOCAL                       : 1;
};
#define KDCO_HF_INT                           (0x00FF)
#define KDCO_HF_OUT                           (0xFF00)
#define KDCOCN                                (0x7F0000)
#define CAL_KDCOCAL                           (0x800000)



#define ADPLL_KDTC_RD_REG                    (0x40003088)
#define ADPLL_KDTC_RD_REG_RESET              (0x00000000)

/*=============================*/
struct __ADPLL_KDTC_RD_REG
/*=============================*/
{
    volatile uint32_t BITFLD_KDTC_OUT                          : 9;
    volatile uint32_t BITFLD_KDTCCN                            : 7;
    volatile uint32_t BITFLD_KDTC_ALPHA_COMP                   : 9;
    volatile uint32_t BITFLD_CAL_KDTCCAL                       : 1;
};
#define KDTC_OUT                              (0x01FF)
#define KDTCCN                                (0xFE00)
#define KDTC_ALPHA_COMP                       (0x1FF0000)
#define CAL_KDTCCAL                           (0x2000000)



#define ADPLL_TUNESTATE_RD_REG               (0x4000308C)
#define ADPLL_TUNESTATE_RD_REG_RESET         (0x00000000)

/*=============================*/
struct __ADPLL_TUNESTATE_RD_REG
/*=============================*/
{
    volatile uint32_t BITFLD_TUNE_STATE                        : 4;
    volatile uint32_t BITFLD_TMRVAL                            : 10;
};
#define TUNE_STATE                            (0x000F)
#define TMRVAL                                (0x3FF0)



#define ADPLL_PLLFCWDT_RD_REG                (0x40003090)
#define ADPLL_PLLFCWDT_RD_REG_RESET          (0x00258800)

/*=============================*/
struct __ADPLL_PLLFCWDT_RD_REG
/*=============================*/
{
    volatile uint32_t BITFLD_PLLFCWDT                          : 23;
};
#define PLLFCWDT                              (0x7FFFFF)



#define ADPLL_ANATST_RD_REG                  (0x40003094)
#define ADPLL_ANATST_RD_REG_RESET            (0x00000000)

/*=============================*/
struct __ADPLL_ANATST_RD_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ANATSTSPARE_IN                    : 16;
};
#define ANATSTSPARE_IN                        (0xFFFF)



