sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define PATCH_VALID_REG                      (0x40080000)
#define PATCH_VALID_REG_RESET                (0x00000000)

/*=============================*/
struct __PATCH_VALID_REG
/*=============================*/
{
    volatile uint32_t BITFLD_PATCH_VALID                       : 22;
};
#define PATCH_VALID                           (0x3FFFFF)



#define PATCH_ADDR0_REG                      (0x40080020)
#define PATCH_ADDR0_REG_RESET                (0x07F00000)

/*=============================*/
struct __PATCH_ADDR0_REG
/*=============================*/
{
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_ADDR1_REG                      (0x40080028)
#define PATCH_ADDR1_REG_RESET                (0x07F00000)

/*=============================*/
struct __PATCH_ADDR1_REG
/*=============================*/
{
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_ADDR2_REG                      (0x40080030)
#define PATCH_ADDR2_REG_RESET                (0x07F00000)

/*=============================*/
struct __PATCH_ADDR2_REG
/*=============================*/
{
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_ADDR3_REG                      (0x40080038)
#define PATCH_ADDR3_REG_RESET                (0x07F00000)

/*=============================*/
struct __PATCH_ADDR3_REG
/*=============================*/
{
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_ADDR4_REG                      (0x40080040)
#define PATCH_ADDR4_REG_RESET                (0x07F00000)

/*=============================*/
struct __PATCH_ADDR4_REG
/*=============================*/
{
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_ADDR5_REG                      (0x40080048)
#define PATCH_ADDR5_REG_RESET                (0x07F00000)

/*=============================*/
struct __PATCH_ADDR5_REG
/*=============================*/
{
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_ADDR6_REG                      (0x40080050)
#define PATCH_ADDR6_REG_RESET                (0x07F00000)

/*=============================*/
struct __PATCH_ADDR6_REG
/*=============================*/
{
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_ADDR7_REG                      (0x40080058)
#define PATCH_ADDR7_REG_RESET                (0x07F00000)

/*=============================*/
struct __PATCH_ADDR7_REG
/*=============================*/
{
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_ADDR8_REG                      (0x40080060)
#define PATCH_ADDR8_REG_RESET                (0x07F00000)

/*=============================*/
struct __PATCH_ADDR8_REG
/*=============================*/
{
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_ADDR9_REG                      (0x40080068)
#define PATCH_ADDR9_REG_RESET                (0x07F00000)

/*=============================*/
struct __PATCH_ADDR9_REG
/*=============================*/
{
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_ADDR10_REG                     (0x40080070)
#define PATCH_ADDR10_REG_RESET               (0x07F00000)

/*=============================*/
struct __PATCH_ADDR10_REG
/*=============================*/
{
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_ADDR11_REG                     (0x40080078)
#define PATCH_ADDR11_REG_RESET               (0x07F00000)

/*=============================*/
struct __PATCH_ADDR11_REG
/*=============================*/
{
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_ADDR12_REG                     (0x40080080)
#define PATCH_ADDR12_REG_RESET               (0x07F00000)

/*=============================*/
struct __PATCH_ADDR12_REG
/*=============================*/
{
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_ADDR13_REG                     (0x40080088)
#define PATCH_ADDR13_REG_RESET               (0x07F00000)

/*=============================*/
struct __PATCH_ADDR13_REG
/*=============================*/
{
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



