sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define PATCH_ADDR14_REG                     (0x40080090)
#define PATCH_ADDR14_REG_RESET               (0x07F00000)

/*=============================*/
struct __PATCH_ADDR14_REG
/*=============================*/
{
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_ADDR15_REG                     (0x40080098)
#define PATCH_ADDR15_REG_RESET               (0x07F00000)

/*=============================*/
struct __PATCH_ADDR15_REG
/*=============================*/
{
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_ADDR16_REG                     (0x400800A0)
#define PATCH_ADDR16_REG_RESET               (0x07F00000)

/*=============================*/
struct __PATCH_ADDR16_REG
/*=============================*/
{
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_ADDR17_REG                     (0x400800A8)
#define PATCH_ADDR17_REG_RESET               (0x07F00000)

/*=============================*/
struct __PATCH_ADDR17_REG
/*=============================*/
{
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_ADDR18_REG                     (0x400800B0)
#define PATCH_ADDR18_REG_RESET               (0x07F00000)

/*=============================*/
struct __PATCH_ADDR18_REG
/*=============================*/
{
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_ADDR19_REG                     (0x400800B8)
#define PATCH_ADDR19_REG_RESET               (0x07F00000)

/*=============================*/
struct __PATCH_ADDR19_REG
/*=============================*/
{
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_ADDR20_REG                     (0x400800C0)
#define PATCH_ADDR20_REG_RESET               (0x07F00000)

/*=============================*/
struct __PATCH_ADDR20_REG
/*=============================*/
{
             uint32_t                                          : 2;
    volatile uint32_t BITFLD_PATCH_ADDR_D                      : 16;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_D                          (0x3FFFC)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_DATA20_REG                     (0x400800C4)
#define PATCH_DATA20_REG_RESET               (0x00000000)

/*=============================*/
struct __PATCH_DATA20_REG
/*=============================*/
{
    volatile uint32_t BITFLD_PATCH_DATA                        : 32;
};
#define PATCH_DATA                            (0xFFFFFFFF)



#define PATCH_ADDR21_REG                     (0x400800C8)
#define PATCH_ADDR21_REG_RESET               (0x07F00000)

/*=============================*/
struct __PATCH_ADDR21_REG
/*=============================*/
{
             uint32_t                                          : 2;
    volatile uint32_t BITFLD_PATCH_ADDR_D                      : 16;
             uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_D                          (0x3FFFC)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_DATA21_REG                     (0x400800CC)
#define PATCH_DATA21_REG_RESET               (0x00000000)

/*=============================*/
struct __PATCH_DATA21_REG
/*=============================*/
{
    volatile uint32_t BITFLD_PATCH_DATA                        : 32;
};
#define PATCH_DATA                            (0xFFFFFFFF)



#define CLK_XTAL32K_REG                      (0x50000022) /* 32 kHz XTAL oscillator register */
#define CLK_XTAL32K_REG_RESET                (0x0000002E)

/*=============================*/
struct __CLK_XTAL32K_REG
/*=============================*/
{
    volatile uint16_t BITFLD_XTAL32K_ENABLE                    : 1;
    volatile uint16_t BITFLD_XTAL32K_RBIAS                     : 2;
    volatile uint16_t BITFLD_XTAL32K_CUR                       : 4;
    volatile uint16_t BITFLD_XTAL32K_DISABLE_AMPREG            : 1;
    volatile uint16_t BITFLD_XTAL32K_XTAL1_BIAS_DISABLE        : 1;
};
#define XTAL32K_ENABLE                        (0x0001)
#define XTAL32K_RBIAS                         (0x0006)
#define XTAL32K_CUR                           (0x0078)
#define XTAL32K_DISABLE_AMPREG                (0x0080)
#define XTAL32K_XTAL1_BIAS_DISABLE            (0x0100)



#define ANA_STATUS_REG                       (0x5000002A) /* Status bit of analog (power management) circuits */
#define ANA_STATUS_REG_RESET                 (0x00000000)

/*=============================*/
struct __ANA_STATUS_REG
/*=============================*/
{
    volatile uint16_t BITFLD_LDO_CORE_OK                       : 1;
    volatile uint16_t BITFLD_LDO_LOW_OK                        : 1;
    volatile uint16_t BITFLD_DCDC_OK                           : 1;
    volatile uint16_t BITFLD_COMP_VBAT_HIGH_OK                 : 1;
    volatile uint16_t BITFLD_COMP_VBAT_HIGH_NOK                : 1;
    volatile uint16_t BITFLD_BANDGAP_OK                        : 1;
    volatile uint16_t BITFLD_POR_VBAT_LOW                      : 1;
    volatile uint16_t BITFLD_POR_VBAT_HIGH                     : 1;
    volatile uint16_t BITFLD_BOOST_SELECTED                    : 1;
    volatile uint16_t BITFLD_LDO_XTAL_OK                       : 1;
    volatile uint16_t BITFLD_LDO_GPADC_OK                      : 1;
    volatile uint16_t BITFLD_FORCE_RUNNING                     : 1;
    volatile uint16_t BITFLD_CLKLESS_WAKEUP_STAT               : 1;
    volatile uint16_t BITFLD_DCDC_SLP_INTERVAL_STAT            : 1;
};
#define LDO_CORE_OK                           (0x0001)
#define LDO_LOW_OK                            (0x0002)
#define DCDC_OK                               (0x0004)
#define COMP_VBAT_HIGH_OK                     (0x0008)
#define COMP_VBAT_HIGH_NOK                    (0x0010)
#define BANDGAP_OK                            (0x0020)
#define POR_VBAT_LOW                          (0x0040)
#define POR_VBAT_HIGH                         (0x0080)
#define BOOST_SELECTED                        (0x0100)
#define LDO_XTAL_OK                           (0x0200)
#define LDO_GPADC_OK                          (0x0400)
#define FORCE_RUNNING                         (0x0800)
#define CLKLESS_WAKEUP_STAT                   (0x1000)
#define DCDC_SLP_INTERVAL_STAT                (0x2000)



