sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define XTALRDY_STAT_REG                     (0x50000036)
#define XTALRDY_STAT_REG_RESET               (0x00000000)

/*=============================*/
struct __XTALRDY_STAT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_XTALRDY_STAT                      : 8;
};
#define XTALRDY_STAT                          (0x00FF)



#define XTAL32M_CTRL0_REG                    (0x50000038) /* Control bits for XTAL32M */
#define XTAL32M_CTRL0_REG_RESET              (0x00000069)

/*=============================*/
struct __XTAL32M_CTRL0_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DCBLOCK_ENABLE                    : 1;
    volatile uint16_t BITFLD_CORE_AMPL_REG_NULLBIAS            : 1;
    volatile uint16_t BITFLD_CORE_CUR_SET                      : 3;
    volatile uint16_t BITFLD_CORE_AMPL_TRIM                    : 3;
    volatile uint16_t BITFLD_CMP_BIAS_LVL                      : 1;
    volatile uint16_t BITFLD_XTAL32M_SPARE                     : 1;
};
#define DCBLOCK_ENABLE                        (0x0001)
#define CORE_AMPL_REG_NULLBIAS                (0x0002)
#define CORE_CUR_SET                          (0x001C)
#define CORE_AMPL_TRIM                        (0x00E0)
#define CMP_BIAS_LVL                          (0x0100)
#define XTAL32M_SPARE                         (0x0200)



#define POWER_LEVEL_REG                      (0x50000054) /* Power management level and trim settings */
#define POWER_LEVEL_REG_RESET                (0x00002A3E)

/*=============================*/
struct __POWER_LEVEL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_LDO_CORE_LEVEL_BOOST              : 1;
    volatile uint16_t BITFLD_LDO_LOW_TRIM                      : 3;
    volatile uint16_t BITFLD_LDO_XTAL_TRIM                     : 3;
    volatile uint16_t BITFLD_FORCE_RCX_LDO_CORE_RET            : 1;
             uint16_t                                          : 1;
    volatile uint16_t BITFLD_DCDC_LEVEL                        : 2;
    volatile uint16_t BITFLD_DCDC_TRIM                         : 3;
};
#define LDO_CORE_LEVEL_BOOST                  (0x0001)
#define LDO_LOW_TRIM                          (0x000E)
#define LDO_XTAL_TRIM                         (0x0070)
#define FORCE_RCX_LDO_CORE_RET                (0x0080)
#define DCDC_LEVEL                            (0x0600)
#define DCDC_TRIM                             (0x3800)



#define DCDC_TEST1_REG                       (0x50000084)
#define DCDC_TEST1_REG_RESET                 (0x00000400)

/*=============================*/
struct __DCDC_TEST1_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DCDC_FORCE_IDLE                   : 1;
    volatile uint16_t BITFLD_DCDC_FORCE_TRIG                   : 1;
    volatile uint16_t BITFLD_DCDC_SW_TST                       : 2;
    volatile uint16_t BITFLD_DCDC_FORCE_COMP_CLK               : 1;
    volatile uint16_t BITFLD_DCDC_FORCE_COMP_TRIM              : 1;
    volatile uint16_t BITFLD_DCDC_FORCE_ILIM                   : 1;
    volatile uint16_t BITFLD_DCDC_COMP_CLK_VAL                 : 1;
    volatile uint16_t BITFLD_DCDC_ILIM_VAL                     : 4;
    volatile uint16_t BITFLD_DCDC_DIG_TST_SEL                  : 3;
};
#define DCDC_FORCE_IDLE                       (0x0001)
#define DCDC_FORCE_TRIG                       (0x0002)
#define DCDC_SW_TST                           (0x000C)
#define DCDC_FORCE_COMP_CLK                   (0x0010)
#define DCDC_FORCE_COMP_TRIM                  (0x0020)
#define DCDC_FORCE_ILIM                       (0x0040)
#define DCDC_COMP_CLK_VAL                     (0x0080)
#define DCDC_ILIM_VAL                         (0x0F00)
#define DCDC_DIG_TST_SEL                      (0x7000)



#define DCDC_TEST2_REG                       (0x50000086)
#define DCDC_TEST2_REG_RESET                 (0x00000000)

/*=============================*/
struct __DCDC_TEST2_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DCDC_COMP_TRIM_VAL                : 6;
};
#define DCDC_COMP_TRIM_VAL                    (0x003F)



#define DCDC_STATUS1_REG                     (0x50000088)
#define DCDC_STATUS1_REG_RESET               (0x00000048)

/*=============================*/
struct __DCDC_STATUS1_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DCDC_VDCDC_OK                     : 1;
    volatile uint16_t BITFLD_DCDC_ENABLED                      : 1;
    volatile uint16_t BITFLD_DCDC_STARTUP_COMPLETE             : 1;
    volatile uint16_t BITFLD_DCDC_BOOST_MODE                   : 1;
    volatile uint16_t BITFLD_DCDC_ILIM                         : 4;
    volatile uint16_t BITFLD_DCDC_VOUT_OK                      : 1;
    volatile uint16_t BITFLD_DCDC_VOUT_NOK                     : 1;
    volatile uint16_t BITFLD_DCDC_SW_STATE                     : 2;
    volatile uint16_t BITFLD_DCDC_FSM_STATE                    : 4;
};
#define DCDC_VDCDC_OK                         (0x0001)
#define DCDC_ENABLED                          (0x0002)
#define DCDC_STARTUP_COMPLETE                 (0x0004)
#define DCDC_BOOST_MODE                       (0x0008)
#define DCDC_ILIM                             (0x00F0)
#define DCDC_VOUT_OK                          (0x0100)
#define DCDC_VOUT_NOK                         (0x0200)
#define DCDC_SW_STATE                         (0x0C00)
#define DCDC_FSM_STATE                        (0xF000)



#define DCDC_STATUS2_REG                     (0x5000008A)
#define DCDC_STATUS2_REG_RESET               (0x00000000)

/*=============================*/
struct __DCDC_STATUS2_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DCDC_COMP_N_CONT                  : 1;
    volatile uint16_t BITFLD_DCDC_COMP_N_DYN_N                 : 1;
    volatile uint16_t BITFLD_DCDC_COMP_N_DYN_P                 : 1;
    volatile uint16_t BITFLD_DCDC_COMP_P_CONT                  : 1;
    volatile uint16_t BITFLD_DCDC_COMP_P_DYN_N                 : 1;
    volatile uint16_t BITFLD_DCDC_COMP_P_DYN_P                 : 1;
    volatile uint16_t BITFLD_DCDC_TIMEOUT_NSW                  : 1;
    volatile uint16_t BITFLD_DCDC_TIMEOUT_PSW                  : 1;
    volatile uint16_t BITFLD_DCDC_COMP_TRIM                    : 6;
};
#define DCDC_COMP_N_CONT                      (0x0001)
#define DCDC_COMP_N_DYN_N                     (0x0002)
#define DCDC_COMP_N_DYN_P                     (0x0004)
#define DCDC_COMP_P_CONT                      (0x0008)
#define DCDC_COMP_P_DYN_N                     (0x0010)
#define DCDC_COMP_P_DYN_P                     (0x0020)
#define DCDC_TIMEOUT_NSW                      (0x0040)
#define DCDC_TIMEOUT_PSW                      (0x0080)
#define DCDC_COMP_TRIM                        (0x3F00)



