sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/include/da14535.h
#define XTAL32M_TESTCTRL0_REG                (0x50003038)
#define XTAL32M_TESTCTRL0_REG_RESET          (0x00003400)

/*=============================*/
struct __XTAL32M_TESTCTRL0_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SPIKE_FLT_DISABLE                 : 1;
    volatile uint16_t BITFLD_OSC_TRIM_OPEN_DISABLE             : 1;
    volatile uint16_t BITFLD_DIFFBUF_BYPASS                    : 1;
    volatile uint16_t BITFLD_DCBLOCK_LV_MODE                   : 1;
    volatile uint16_t BITFLD_CORE_XTAL_DISCHARGE               : 1;
    volatile uint16_t BITFLD_CORE_MAX_CURRENT                  : 1;
    volatile uint16_t BITFLD_CORE_I2V_TO_TESTBUS_10X           : 1;
    volatile uint16_t BITFLD_CORE_I2V_TO_TESTBUS               : 1;
    volatile uint16_t BITFLD_CORE_HOLD_AMP_REG_OVERRIDE        : 2;
    volatile uint16_t BITFLD_CORE_GM_CURRENT                   : 1;
    volatile uint16_t BITFLD_CORE_FREQ_TRIM_SW2_AMP            : 3;
    volatile uint16_t BITFLD_BIAS_SAH_HOLD_OVERRIDE            : 2;
};
#define SPIKE_FLT_DISABLE                     (0x0001)
#define OSC_TRIM_OPEN_DISABLE                 (0x0002)
#define DIFFBUF_BYPASS                        (0x0004)
#define DCBLOCK_LV_MODE                       (0x0008)
#define CORE_XTAL_DISCHARGE                   (0x0010)
#define CORE_MAX_CURRENT                      (0x0020)
#define CORE_I2V_TO_TESTBUS_10X               (0x0040)
#define CORE_I2V_TO_TESTBUS                   (0x0080)
#define CORE_HOLD_AMP_REG_OVERRIDE            (0x0300)
#define CORE_GM_CURRENT                       (0x0400)
#define CORE_FREQ_TRIM_SW2_AMP                (0x3800)
#define BIAS_SAH_HOLD_OVERRIDE                (0xC000)



#define XTAL32M_TESTCTRL1_REG                (0x5000303A)
#define XTAL32M_TESTCTRL1_REG_RESET          (0x00000000)

/*=============================*/
struct __XTAL32M_TESTCTRL1_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DISABLE_TM_CLK                    : 1;
    volatile uint16_t BITFLD_LDO_VREF_HOLD_OVERRIDE            : 1;
    volatile uint16_t BITFLD_VARICAP_TEST_ENABLE               : 1;
    volatile uint16_t BITFLD_VARICAP_TEST_SEL_XTAL             : 1;
    volatile uint16_t BITFLD_PROG_VREF_SEL                     : 1;
    volatile uint16_t BITFLD_RFCLK_ADPLL_TO_GPIO               : 1;
    volatile uint16_t BITFLD_RFCLK_ADC_TO_GPIO                 : 1;
    volatile uint16_t BITFLD_RFCLK_SEL_ADPLL_ADC_TO_GPIO       : 1;
             uint16_t                                          : 1;
};
#define DISABLE_TM_CLK                        (0x0001)
#define LDO_VREF_HOLD_OVERRIDE                (0x0002)
#define VARICAP_TEST_ENABLE                   (0x0004)
#define VARICAP_TEST_SEL_XTAL                 (0x0008)
#define PROG_VREF_SEL                         (0x0010)
#define RFCLK_ADPLL_TO_GPIO                   (0x0020)
#define RFCLK_ADC_TO_GPIO                     (0x0040)
#define RFCLK_SEL_ADPLL_ADC_TO_GPIO           (0x0080)



#define BIST_CTRL_REG                        (0x5000303C)
#define BIST_CTRL_REG_RESET                  (0x00000480)

/*=============================*/
struct __BIST_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RAM_BIST_CONFIG                   : 2;
    volatile uint16_t BITFLD_ROMBIST_ENABLE                    : 1;
    volatile uint16_t BITFLD_SYSRAM12_BIST_ENABLE              : 1;
             uint16_t                                          : 1;
    volatile uint16_t BITFLD_ROM_BIST_BUSY                     : 1;
             uint16_t                                          : 1;
    volatile uint16_t BITFLD_SYSRAM3_BIST_FAIL                 : 1;
    volatile uint16_t BITFLD_SYSRAM3_BIST_BUSY                 : 1;
             uint16_t                                          : 1;
    volatile uint16_t BITFLD_SYSRAM12_BIST_FAIL                : 1;
    volatile uint16_t BITFLD_SYSRAM12_BIST_BUSY                : 1;
    volatile uint16_t BITFLD_RAM_BIST_PATTERN                  : 2;
    volatile uint16_t BITFLD_SYSRAM3_BIST_ENABLE               : 1;
};
#define RAM_BIST_CONFIG                       (0x0003)
#define ROMBIST_ENABLE                        (0x0004)
#define SYSRAM12_BIST_ENABLE                  (0x0008)
#define ROM_BIST_BUSY                         (0x0020)
#define SYSRAM3_BIST_FAIL                     (0x0080)
#define SYSRAM3_BIST_BUSY                     (0x0100)
#define SYSRAM12_BIST_FAIL                    (0x0400)
#define SYSRAM12_BIST_BUSY                    (0x0800)
#define RAM_BIST_PATTERN                      (0x3000)
#define SYSRAM3_BIST_ENABLE                   (0x4000)



#define ROMBIST_RESULTL_REG                  (0x5000303E)
#define ROMBIST_RESULTL_REG_RESET            (0x00000000)

/*=============================*/
struct __ROMBIST_RESULTL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_ROMBIST_RESULTL                   : 16;
};
#define ROMBIST_RESULTL                       (0xFFFF)



#define ROMBIST_RESULTH_REG                  (0x50003040)
#define ROMBIST_RESULTH_REG_RESET            (0x00000000)

/*=============================*/
struct __ROMBIST_RESULTH_REG
/*=============================*/
{
    volatile uint16_t BITFLD_ROMBIST_RESULTH                   : 16;
};
#define ROMBIST_RESULTH                       (0xFFFF)



#define MEM_CTRL_REG                         (0x5000330C)
#define MEM_CTRL_REG_RESET                   (0x00000164)

/*=============================*/
struct __MEM_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RAM_EMA                           : 3;
    volatile uint16_t BITFLD_RAM_EMAW                          : 2;
    volatile uint16_t BITFLD_ROM_KEN                           : 1;
    volatile uint16_t BITFLD_ROM_EMA                           : 3;
    volatile uint16_t BITFLD_ARB1_AHB_WR_BUFF                  : 1;
    volatile uint16_t BITFLD_ARB1_AHB2_WR_BUFF                 : 1;
    volatile uint16_t BITFLD_ARB2_AHB_WR_BUFF                  : 1;
    volatile uint16_t BITFLD_ARB2_AHB2_WR_BUFF                 : 1;
};
#define RAM_EMA                               (0x0007)
#define RAM_EMAW                              (0x0018)
#define ROM_KEN                               (0x0020)
#define ROM_EMA                               (0x01C0)
#define ARB1_AHB_WR_BUFF                      (0x0200)
#define ARB1_AHB2_WR_BUFF                     (0x0400)
#define ARB2_AHB_WR_BUFF                      (0x0800)
#define ARB2_AHB2_WR_BUFF                     (0x1000)



#define RFMON_CTRL_REG                       (0x50003500)
#define RFMON_CTRL_REG_RESET                 (0x00000000)

/*=============================*/
struct __RFMON_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RFMON_PACK_EN                     : 1;
    volatile uint16_t BITFLD_RFMON_CIRC_EN                     : 1;
};
#define RFMON_PACK_EN                         (0x0001)
#define RFMON_CIRC_EN                         (0x0002)



#define RFMON_ADDR_REG                       (0x50003504)
#define RFMON_ADDR_REG_RESET                 (0x00000000)

/*=============================*/
struct __RFMON_ADDR_REG
/*=============================*/
{
             uint16_t                                          : 2;
    volatile uint16_t BITFLD_RFMON_ADDR                        : 14;
};
